[
  {
    "title": "China's internet firms cautiously revive lending as Beijing pushes consumer loans",
    "url": "https://www.reuters.com/business/finance/chinas-internet-firms-cautiously-revive-lending-beijing-pushes-consumer-loans-2025-11-10/",
    "description": "China's internet platforms are quietly reviving consumer lending, taking Beijing's push to make household borrowing cheaper as a signal that regulators may be easing a years-long crackdown on the sector, four industry sources said.",
    "date": "2025-11-10T05:31:20.000Z"
  },
  {
    "title": "ASX appoints new compliance chief amid pressure to deliver on turnaround plan",
    "url": "https://www.reuters.com/business/finance/asx-appoints-new-compliance-chief-amid-pressure-deliver-turnaround-plan-2025-11-10/",
    "description": null,
    "date": "2025-11-10T01:59:48.000Z"
  },
  {
    "title": "China grants conditional approval for Codelco-SQM lithium joint venture",
    "url": "https://www.reuters.com/business/finance/china-grants-conditional-approval-codelco-sqm-lithium-joint-venture-2025-11-10/",
    "description": null,
    "date": "2025-11-10T09:22:21.000Z"
  },
  {
    "title": "Bank of England proposes new rules for stablecoins",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/bank-england-proposes-new-rules-stablecoins-2025-11-10/",
    "description": null,
    "date": "2025-11-10T09:22:31.000Z"
  },
  {
    "title": "Policy uncertainty, geopolitical risk are top stability concerns in latest Fed survey",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/policy-uncertainty-geopolitical-risk-are-top-stability-concerns-latest-fed-2025-11-07/",
    "description": "Policy uncertainty, including on global trade and central bank independence, and overall geopolitical risk topped the list of financial stability concerns in a new Federal Reserve survey released on Friday.",
    "date": "2025-11-07T21:16:56.000Z"
  },
  {
    "title": "Banks lend $18 billion for Oracle-tied data center project, Bloomberg News reports",
    "url": "https://www.reuters.com/business/finance/banks-lend-18-billion-oracle-tied-data-center-project-bloomberg-news-reports-2025-11-07/",
    "description": "A consortium of around 20 banks is providing a project finance loan of about $18 billion to support the construction of a data center campus linked to Oracle in New Mexico, Bloomberg News reported on Friday.",
    "date": "2025-11-07T21:39:36.000Z"
  },
  {
    "title": "Fed's Miran: Stablecoin adoption could put downward pressure on interest rates",
    "url": "https://www.reuters.com/markets/asia/feds-miran-stablecoin-adoption-could-put-downward-pressure-interest-rates-2025-11-07/",
    "description": "Federal Reserve Governor Stephen Miran on Friday said that if stablecoins end up enjoying widespread adoption it could mean the central bank needs to keep short-term interest rates lower than they would otherwise be.",
    "date": "2025-11-07T20:12:02.000Z"
  },
  {
    "title": "UBS to liquidate O'Connor funds hit by First Brands bankruptcy",
    "url": "https://www.reuters.com/business/finance/ubs-liquidate-oconnor-funds-hit-by-first-brands-bankruptcy-2025-11-07/",
    "description": "UBS Group is winding down investment funds run by its hedge fund unit O'Connor, it said on Friday, after suffering losses due to exposure to bankrupt U.S. auto parts supplier First Brands Group.",
    "date": "2025-11-07T18:54:12.000Z"
  },
  {
    "title": "KKR’s profit beats forecast on credit-led inflows, one-off charge weighs",
    "url": "https://www.reuters.com/business/finance/kkrs-quarterly-profit-beats-estimates-rising-inflows-2025-11-07/",
    "description": "Investment firm KKR reported a rise in third-quarter profit that beat Wall Street's expectations on Friday, boosted by strong fundraising, particularly in credit and its insurance unit.",
    "date": "2025-11-07T19:01:25.000Z"
  },
  {
    "title": "Euronext lowers acceptance threshold for buying Athens bourse",
    "url": "https://www.reuters.com/business/finance/euronext-lowers-acceptance-threshold-buying-athens-bourse-2025-11-07/",
    "description": "Pan-European exchange operator Euronext on Friday said it is cutting the acceptance threshold from 67% to 50% plus one share of the voting rights in its bid to take control of the Athens stock exchange.",
    "date": "2025-11-07T19:15:31.000Z"
  },
  {
    "title": "Italy's MPS hikes 2025 goal after strong quarter as Mediobanca tie-up advances",
    "url": "https://www.reuters.com/business/finance/italys-mps-posts-surprise-profit-jump-ahead-new-plan-after-mediobanca-buy-2025-11-07/",
    "description": "Italy's Monte dei Paschi di Siena on Friday posted third-quarter profit that topped estimates and raised its 2025 outlook, ahead of presenting a new strategy early next year following the acquisition of rival Mediobanca .",
    "date": "2025-11-07T10:41:46.000Z"
  },
  {
    "title": "KKR executives see nothing alarming in credit default rise",
    "url": "https://www.reuters.com/business/finance/kkr-executives-see-nothing-alarming-credit-default-rise-2025-11-07/",
    "description": "KKR executives signaled optimism for investment returns and dealmaking on Friday and sought to allay concerns about slower private equity fundraising, deal volume and credit defaults saying there was no reason for alarm.",
    "date": "2025-11-07T18:18:29.000Z"
  },
  {
    "title": "Bundesbank chief uses AI to check dovish-hawkish balance in speeches",
    "url": "https://www.reuters.com/business/finance/bundesbank-chief-uses-ai-check-dovish-hawkish-balance-speeches-2025-11-07/",
    "description": "Exploring the potential uses of artificial intelligence, Bundesbank President Joachim Nagel is now using the technology to check how his speeches will be perceived and whether he found the right balance on the dovish-hawkish spectrum, he said on Friday.",
    "date": "2025-11-07T14:45:38.000Z"
  },
  {
    "title": "Ex-Commerzbank analyst jailed for false sexual harassment claims in UK",
    "url": "https://www.reuters.com/business/finance/ex-commerzbank-analyst-jailed-false-sexual-harassment-claims-uk-2025-11-07/",
    "description": "A former Commerzbank analyst who made false allegations of sexual harassment by a female colleague in a British employment tribunal was jailed for 20 months on Friday for his \"dishonest pursuit of undeserved damages\".",
    "date": "2025-11-07T15:44:57.000Z"
  },
  {
    "title": "How hedge funds performed in October",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/how-hedge-funds-performed-october-2025-11-07/",
    "description": "Hedge funds including stock traders have returned more than 13% in 2025 to the end of October, just ahead of many of the biggest multi-strategy hedge funds, according to a Goldman Sachs report and sources familiar with each of the funds.",
    "date": "2025-11-07T17:34:48.000Z"
  },
  {
    "title": "Italy's Intesa expands digital investment offer in Belgium and Luxembourg",
    "url": "https://www.reuters.com/business/finance/italys-intesa-expands-digital-investment-offer-belgium-luxembourg-2025-11-07/",
    "description": "Italy's biggest bank Intesa Sanpaolo said on Friday its Fideuram private banking arm was launching a digital investment offer partnering with BlackRock in Belgium and Luxembourg.",
    "date": "2025-11-07T14:04:07.000Z"
  },
  {
    "title": "PNC broadens branch expansion plan to more than 300 by 2030",
    "url": "https://www.reuters.com/business/finance/pnc-broadens-branch-expansion-plan-more-than-300-by-2030-2025-11-07/",
    "description": "U.S. lender PNC said on Friday it will be opening more than 300 new branches by 2030, adding about 100 locations to its earlier plan as it looks to expand its in-person banking footprint.",
    "date": "2025-11-07T13:57:03.000Z"
  },
  {
    "title": "More 'bumps in the road' likely as Bank of England shrinks balance sheet, official says",
    "url": "https://www.reuters.com/business/finance/more-bumps-road-likely-bank-england-shrinks-balance-sheet-official-says-2025-11-07/",
    "description": "Money markets are likely to see more \"bumps in the road\" as the Bank of England reduces its balance sheet, but BoE liquidity facilities are working well to smooth them, a senior official said on Friday.",
    "date": "2025-11-07T12:59:36.000Z"
  },
  {
    "title": "Goldman to promote highest number of executives to managing director since 2021",
    "url": "https://www.reuters.com/business/goldman-promote-highest-number-executives-managing-director-since-2021-2025-11-06/",
    "description": "Wall Street lender Goldman Sachs will promote 638 executives to managing director next year, the highest number since 2021, a company memo said, as the bank benefits from a pickup in investment banking across the industry.",
    "date": "2025-11-07T00:49:06.000Z"
  },
  {
    "title": "US employment report will not be published again as government shutdown drags on",
    "url": "https://www.reuters.com/business/finance/us-employment-report-will-not-be-published-again-government-shutdown-drags-2025-11-07/",
    "description": "The U.S. Labor Department on Friday will not publish its closely watched employment report for an unprecedented second straight month as the government remains shut, and fears are mounting October's report might not be released when full operations resume.",
    "date": "2025-11-07T15:15:54.000Z"
  },
  {
    "title": "Bain Capital private credit executive brushes off systemic concerns, eyes Asia growth",
    "url": "https://www.reuters.com/business/finance/bain-capital-private-credit-executive-brushes-off-systemic-concerns-eyes-asia-2025-11-07/",
    "description": "The global private credit market currently has no systemic risks, while Asia offers the biggest growth opportunities, a senior Bain Capital private credit executive told Reuters.",
    "date": "2025-11-07T07:49:49.000Z"
  },
  {
    "title": "Westpac will not appeal work-from-home ruling loss",
    "url": "https://www.reuters.com/business/finance/westpac-will-not-appeal-work-from-home-ruling-loss-2025-11-07/",
    "description": "Australian bank Westpac will not appeal a labour tribunal ruling after it lost a case to compel one of its workers to be in the office twice a week, according to a bank spokesperson.",
    "date": "2025-11-07T05:08:25.000Z"
  },
  {
    "title": "Japanese investors sell foreign stocks on caution over Fed comments, valuation concerns",
    "url": "https://www.reuters.com/business/finance/japanese-investors-sell-foreign-stocks-caution-over-fed-comments-valuation-2025-11-07/",
    "description": "Japanese investors divested significant holdings in foreign stocks in the week to November 1, as they turned cautious amid hawkish remarks from some U.S. Federal Reserve officials and favoured locking in profits after the recent market rally.",
    "date": "2025-11-07T04:47:35.000Z"
  },
  {
    "title": "Japan PM Takaichi fills panel posts with advocates of big spending",
    "url": "https://www.reuters.com/business/finance/japan-pm-takaichi-fills-panel-posts-with-advocates-big-spending-2025-11-07/",
    "description": "Japan's reflationist advocates of expansionary fiscal policy are making a comeback in economic decision-making with some hand-picked by Prime Minister Sanae Takaichi to fill posts in key government panels.",
    "date": "2025-11-07T04:04:34.000Z"
  },
  {
    "title": "Exclusive: JPMorgan CEO says Argentina may not need bank loan, Fed will likely remain independent",
    "url": "https://www.reuters.com/business/finance/jpmorgan-ceo-says-federal-reserve-likely-to-remain-independent-2025-11-05/",
    "description": "Argentina may not ultimately need a bank loan, JPMorgan Chase CEO Jamie Dimon said on Wednesday, adding Argentine President Javier Milei is doing a good job overhauling the country's troubled economy.",
    "date": "2025-11-06T18:24:44.000Z"
  },
  {
    "title": "US regional banks weather CRE storm, office loans continue to lag",
    "url": "https://www.reuters.com/business/finance/us-regional-banks-weather-cre-storm-office-loans-continue-lag-2025-11-06/",
    "description": "U.S. regional banks' commercial real estate loan books are proving broadly resilient despite worries sparked by a handful of soured loans, but the office sector continues to be a pain point, analysts said.",
    "date": "2025-11-06T14:55:16.000Z"
  },
  {
    "title": "Exclusive: Comcast hires bankers to explore bid for Warner Bros Discovery",
    "url": "https://www.reuters.com/business/finance/comcast-hires-bankers-explore-bid-warner-bros-discovery-2025-11-06/",
    "description": "Comcast has retained financial advisors and gained access to financial information as it explores a bid for Warner Bros Discovery’s studio and streaming businesses, according to four sources familiar with the matter.",
    "date": "2025-11-06T21:03:48.000Z"
  },
  {
    "title": "Ripple says 'skinny' Fed master account is attractive despite limitations",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/ripple-says-skinny-fed-master-account-is-attractive-despite-limitations-2025-11-06/",
    "description": "Crypto giant Ripple supports the idea of a \"skinny\" Federal Reserve payments account for non-banks, which could still be a game changer while addressing banks' concerns over financial stability and competition risks, a top company executive said.",
    "date": "2025-11-06T19:20:58.000Z"
  },
  {
    "title": "Irish regulator fines Coinbase Europe 21.5 million euros over monitoring failures",
    "url": "https://www.reuters.com/business/irish-central-bank-fines-coinbase-europe-215-million-euros-2025-11-06/",
    "description": "Ireland's central bank fined an Irish subsidiary of cryptocurrency exchange Coinbase Global 21.5 million euros ($25 million) on Thursday for breaching anti-money laundering and counter-terrorist transaction monitoring obligations.",
    "date": "2025-11-06T19:05:39.000Z"
  },
  {
    "title": "HSBC softens near-term emissions targets for polluting sectors",
    "url": "https://www.reuters.com/sustainability/cop/hsbc-softens-near-term-emissions-targets-polluting-sectors-2025-11-06/",
    "description": "HSBC on Thursday issued a set of new, softer near-term climate targets for sectors such as oil and gas in response to the slow pace of change in the real economy.",
    "date": "2025-11-06T12:20:25.000Z"
  },
  {
    "title": "Commerzbank profit unexpectedly falls 8% as higher tax rates, costs weigh",
    "url": "https://www.reuters.com/business/finance/commerzbank-profit-unexpectedly-falls-8-higher-tax-rates-costs-weigh-2025-11-06/",
    "description": "Germany's Commerzbank , fending off a possible takeover by Italy's UniCredit , reported an unexpected 7.9% drop in third-quarter net profit on Thursday as higher tax rates and costs weighed on earnings.",
    "date": "2025-11-06T08:48:11.000Z"
  },
  {
    "title": "The end is near for policy easing among big central banks",
    "url": "https://www.reuters.com/business/finance/global-markets-cenbank-2025-11-06/",
    "description": "Central banks in big economies are nearing the end of their rate-cutting cycles, though some, like the U.S. Federal Reserve and Bank of England - which were more cautious earlier in the year - have scope to ease a little more.",
    "date": "2025-11-06T14:25:59.000Z"
  },
  {
    "title": "Euronext tops sixth consecutive growth quarter with buyback",
    "url": "https://www.reuters.com/business/finance/euronext-tops-sixth-consecutive-growth-quarter-with-buyback-2025-11-06/",
    "description": "The pan-European exchange group Euronext on Thursday",
    "date": "2025-11-06T16:47:13.000Z"
  },
  {
    "title": "Italy's Banco BPM beats profit forecast as net fees jump",
    "url": "https://www.reuters.com/business/finance/italys-banco-bpm-sticks-outlook-after-net-fees-drive-profit-above-forecasts-2025-11-06/",
    "description": "Italy's Banco BPM on Thursday posted a higher-than-expected quarterly profit helped by higher net fees following its recent purchase of fund manager Anima Holding, which more than offset falling income from lending.",
    "date": "2025-11-06T17:15:47.000Z"
  },
  {
    "title": "Nordic Capital, Permira takeover offer for Bavarian Nordic falls through",
    "url": "https://www.reuters.com/business/finance/nordic-capital-permira-takeover-offer-bavarian-nordic-falls-through-2025-11-06/",
    "description": "Innosera, a consortium led by Nordic Capital and Permira, failed to achieve the required level of support from shareholders for its planned takeover of Bavarian Nordic and will withdraw its bid, Bavarian Nordic said on Thursday.",
    "date": "2025-11-06T16:42:36.000Z"
  },
  {
    "title": "Germany's Merz, finance minister call for European patriotism to protect steel industry",
    "url": "https://www.reuters.com/business/finance/germanys-merz-finance-minister-call-european-patriotism-protect-steel-industry-2025-11-06/",
    "description": "German Chancellor Friedrich Merz and Finance Minister Lars Klingbeil signalled a new European patriotism to protect the steel industry on Thursday after a summit bringing together domestic producers, German states and trade unions.",
    "date": "2025-11-06T14:18:25.000Z"
  },
  {
    "title": "Too big to swallow? Lukoil empire no simple acquisition for Gunvor",
    "url": "https://www.reuters.com/business/energy/too-big-swallow-lukoil-empire-no-simple-acquisition-gunvor-2025-11-06/",
    "description": "Russian energy group Lukoil's foreign empire is suitor Gunvor's biggest acquisition target to date but looks far beyond the Swiss trader's borrowing capacity, bankers and insiders say.",
    "date": "2025-11-06T14:10:06.000Z"
  },
  {
    "title": "Swedish Riksbank's Thedeen says outlook for economic activity and inflation is uncertain",
    "url": "https://www.reuters.com/business/finance/swedish-riksbanks-thedeen-says-outlook-economic-activity-inflation-is-uncertain-2025-11-06/",
    "description": "The Swedish outlook for economic activity and inflation is uncertain, central bank Governor Erik Thedeen said on Thursday, adding that the Riksbank was still vigilant regarding developments.",
    "date": "2025-11-06T13:18:27.000Z"
  },
  {
    "title": "Bank of England policymakers speak after keeping rates on hold",
    "url": "https://www.reuters.com/business/finance/bank-england-policymakers-speak-after-keeping-rates-hold-2025-11-06/",
    "description": "The Bank of England kept borrowing costs on hold on Thursday, but the narrow vote signals a rate cut could come in December, when they hold their next meeting after the government budget later this month.",
    "date": "2025-11-07T10:12:29.000Z"
  },
  {
    "title": "Banca Mediolanum boosts interest income outlook, confirms higher 2025 dividend",
    "url": "https://www.reuters.com/business/finance/banca-mediolanum-boosts-interest-income-outlook-confirms-higher-2025-dividend-2025-11-06/",
    "description": "Italy's Banca Mediolanum said on Thursday its 2025 net interest income would be around last year's level, raising the forecast communicated in July, after posting an 8% jump in its net income for the first nine months of the year.",
    "date": "2025-11-06T12:08:19.000Z"
  },
  {
    "title": "Morning Bid: Selloff abates as economy hums, layoffs rise",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-11-06/",
    "description": "What matters in U.S. and global markets today",
    "date": "2025-11-06T11:44:15.000Z"
  },
  {
    "title": "Schwab to buy Forge Global for $660 million as demand for pre-IPO shares grows",
    "url": "https://www.reuters.com/legal/transactional/charles-schwab-strikes-660-million-deal-private-shares-platform-forge-global-2025-11-06/",
    "description": "Charles Schwab on Thursday agreed to buy private shares platform Forge Global for $660 million, as Wall Street looks to take advantage of the fast-growing demand for access to pre-IPO companies.",
    "date": "2025-11-06T20:16:17.000Z"
  },
  {
    "title": "Bank of England policymakers' views on close November rates decision",
    "url": "https://www.reuters.com/business/finance/bank-england-policymakers-views-close-november-rates-decision-2025-11-06/",
    "description": "The Bank of England, which kept interest rates on hold on Thursday in a tight vote, for the first time set out the views of the individual members of its Monetary Policy Committee.",
    "date": "2025-11-06T12:12:51.000Z"
  },
  {
    "title": "UK stocks fall after BoE holds rates, pound gains ground",
    "url": "https://www.reuters.com/business/finance/uk-stocks-steady-traders-await-rate-cues-sterling-holds-near-lows-2025-11-06/",
    "description": "London's main stock indexes pulled back on Thursday as the pound strengthened following the Bank of England's decision to keep interest rates steady ahead of the government's budget, while investors also digested a flurry of corporate earnings.",
    "date": "2025-11-06T17:27:12.000Z"
  },
  {
    "title": "Swiss stock exchange operator SIX hit by losses related to Worldline stake",
    "url": "https://www.reuters.com/business/finance/swiss-stock-exchange-operator-six-hit-by-losses-related-worldline-stake-2025-11-06/",
    "description": "Swiss stock exchange operator SIX said on Thursday it expects a 2025 net loss of about 300 million Swiss francs ($378.26 million), citing an impairment of roughly 550 million francs on its 10.5% stake in French payments group Worldline .",
    "date": "2025-11-06T11:24:55.000Z"
  },
  {
    "title": "ECB to join Deutsche Boerse's Eurex repo market in 2026",
    "url": "https://www.reuters.com/business/finance/ecb-join-deutsche-boerses-eurex-repo-market-2026-2025-11-06/",
    "description": "The European Central Bank will join Eurex's centrally-cleared repo market from the first quarter of 2026, the Deutsche Boerse derivatives exchange said on Thursday.",
    "date": "2025-11-06T11:15:07.000Z"
  },
  {
    "title": "AI stock wobble points to US market reliance on tech",
    "url": "https://www.reuters.com/business/finance/ai-stock-wobble-points-us-market-reliance-tech-2025-11-06/",
    "description": "This week's wobble in shares connected to artificial intelligence is a stark reminder that the U.S. stock market is ever more reliant on the technology sector to drive it higher.",
    "date": "2025-11-06T14:23:43.000Z"
  },
  {
    "title": "Commerzbank CEO surprised by meeting of her ex-boss with UniCredit CEO",
    "url": "https://www.reuters.com/business/finance/commerzbank-ceo-surprised-by-meeting-her-ex-boss-with-unicredit-ceo-2025-11-06/",
    "description": "Commerzbank's CEO Bettina Orlopp said on Thursday that she was \"incredibly surprised\" by news of a 2024 meeting between then-CEO Manfred Knof and his counterpart at UniCredit , Andrea Orcel.",
    "date": "2025-11-06T10:56:21.000Z"
  },
  {
    "title": "Germany facing rising financial stability risk, Bundesbank warns",
    "url": "https://www.reuters.com/business/finance/germany-facing-rising-financial-stability-risk-bundesbank-warns-2025-11-06/",
    "description": "Germany is facing rising risks to its financial stability from erratic U.S. economic policy, overvalued equity markets, excessive debt levels around the world and souring bank credit, the Bundesbank warned on Thursday.",
    "date": "2025-11-06T09:32:57.000Z"
  },
  {
    "title": "ECB comfortable with rates; sees only temporary inflation undershoot, VP says",
    "url": "https://www.reuters.com/business/finance/ecb-comfortable-with-rates-sees-only-temporary-inflation-undershoot-vp-says-2025-11-06/",
    "description": "The European Central Bank is comfortable with the current level of interest rates and considers any inflation dip below 2% to be temporary, Luis de Guindos, the bank's Vice President said on Thursday.",
    "date": "2025-11-06T09:35:59.000Z"
  },
  {
    "title": "Tesla shareholders approve Elon Musk’s $1 trillion pay package - as it happened",
    "url": "https://www.reuters.com/world/live-tesla-shareholders-vote-elon-musks-1-trillion-pay-package-2025-11-06/",
    "description": "It is the largest corporate pay package in history.",
    "date": "2025-11-07T04:08:44.898Z"
  },
  {
    "title": "Germany financial watchdog slaps record fine on JPMorgan of $52 million",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/germanys-bafin-imposes-45-million-fine-jp-morgan-2025-11-06/",
    "description": "Germany's financial watchdog BaFin has imposed its largest-ever fine of 45 million euros ($52.5 million) on Frankfurt-based JPMorgan SE for deficiencies in money-laundering prevention.",
    "date": "2025-11-06T10:09:28.000Z"
  },
  {
    "title": "Norway central bank keeps rates on hold, plans cut next year",
    "url": "https://www.reuters.com/business/finance/norway-central-bank-keeps-rates-hold-expected-2025-11-06/",
    "description": "Norway's central bank kept its policy interest rate on hold at 4.0% on Thursday to combat inflation, as unanimously predicted by a Reuters poll, and said it was in no hurry to cut even if further easing was likely in the year ahead.",
    "date": "2025-11-06T11:25:27.000Z"
  },
  {
    "title": "Wall Street bonuses expected to be highest in four years, consultancy says",
    "url": "https://www.reuters.com/business/world-at-work/wall-street-bonuses-expected-be-highest-four-years-consultancy-says-2025-11-05/",
    "description": "Wall Street bonuses are expected to rise for the second year for traders and investment bankers on surging deal volume and market volatility, according to financial compensation consultancy Johnson Associates.",
    "date": "2025-11-05T16:02:01.000Z"
  },
  {
    "title": "ECB's Schnabel says new bond purchases 'still far away'",
    "url": "https://www.reuters.com/business/finance/ecbs-schnabel-says-new-bond-purchases-still-far-away-2025-11-06/",
    "description": "The European Central Bank is still far away from resuming debt purchases to inject liquidity into the banking system as it first needs to work off more of the bonds it bought over a decade of easy policy, ECB board member Isabel Schnabel said on Thursday.",
    "date": "2025-11-06T08:50:59.000Z"
  },
  {
    "title": "UK bank stocks rise after reports they may dodge budget tax raid",
    "url": "https://www.reuters.com/business/finance/uk-bank-stocks-rise-after-reports-they-may-dodge-budget-tax-raid-2025-11-06/",
    "description": "A gauge of British bank stocks rose in steady markets on Thursday after the Financial Times reported Chancellor Rachel Reeves was set to spare them from a punitive budget tax raid.",
    "date": "2025-11-06T08:19:39.000Z"
  },
  {
    "title": "Italy's BPER beats profit forecast with Pop Sondrio merger contribution",
    "url": "https://www.reuters.com/business/finance/bper-sees-64-billion-euros-revenue-2025-after-acquisition-rival-sondrio-2025-11-06/",
    "description": "Italian lender BPER Banca beat expectations in the third quarter as it began to benefit from its acquisition of regional rival Banca Popolare di Sondrio .",
    "date": "2025-11-06T14:13:14.000Z"
  },
  {
    "title": "Commerzbank profit unexpectedly falls 8% as higher tax rates, costs weigh",
    "url": "https://www.reuters.com/business/finance/commerzbank-profit-falls-79-q3-defying-expectations-increase-2025-11-06/",
    "description": "Germany's Commerzbank , fending off a possible takeover by Italy's UniCredit , reported an unexpected 7.9% drop in third-quarter net profit on Thursday as higher tax rates and costs weighed on earnings.",
    "date": "2025-11-06T07:18:12.000Z"
  },
  {
    "title": "US arrests 5 at Germany's request in probe of online fraud involving payment providers",
    "url": "https://www.reuters.com/business/finance/us-arrests-5-germanys-request-probe-online-fraud-involving-payment-providers-2025-11-06/",
    "description": "The United States has arrested five individuals at Germany's request in a German-led internationally coordinated investigation of online fraud and money laundering networks that used payment service providers, the U.S. Department of Justice said.",
    "date": "2025-11-06T11:07:26.000Z"
  },
  {
    "title": "Payments firm Worldline plans 500-million-euro capital injection",
    "url": "https://www.reuters.com/business/finance/worldline-raise-500-million-euros-capital-injection-led-by-french-banks-2025-11-06/",
    "description": "Worldline on Thursday unveiled plans to raise 500 million euros ($583 million) by tapping some of France's biggest banks to fund a strategy aimed at turning around the payments firm following years of setbacks.",
    "date": "2025-11-06T14:23:20.000Z"
  },
  {
    "title": "Santander set to pick insider as next UK boss, FT reports",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/santander-set-appoint-insider-next-uk-boss-ft-reports-2025-11-06/",
    "description": "Spanish lender Santander is set to name an insider as its next UK chief executive, the Financial Times reported on Thursday, citing people familiar with the matter.",
    "date": "2025-11-06T10:11:51.000Z"
  },
  {
    "title": "Investor Attestor reviews strategic options for Condor, airline's CEO says",
    "url": "https://www.reuters.com/business/finance/investor-attestor-reviews-strategic-options-condor-airlines-ceo-says-2025-11-06/",
    "description": "Investment firm Attestor is reviewing strategic options, including a partial sale, of German charter airline Condor and has hired Barclays to that effect, the carrier's CEO Peter Gerber said.",
    "date": "2025-11-06T08:59:29.000Z"
  },
  {
    "title": "Apollo-backed Aeromexico raises about $223 million in long-awaited US IPO",
    "url": "https://www.reuters.com/business/apollo-backed-aeromexico-raises-2228-million-long-awaited-us-ipo-2025-11-06/",
    "description": "Apollo-backed Grupo Aeromexico raised $222.8 million in its long-awaited U.S. initial public offering on Wednesday, setting the stage for the Mexican airline's public market comeback nearly four years after it exited bankruptcy.",
    "date": "2025-11-06T04:31:34.000Z"
  },
  {
    "title": "Bank of England set for tight rates decision as inflation softens and budget looms",
    "url": "https://www.reuters.com/business/finance/bank-england-set-tight-rates-decision-inflation-softens-budget-looms-2025-11-06/",
    "description": "The Bank of England is set to announce a potentially knife-edge interest rate decision on Thursday with most investors expecting no change before this month's government budget, but some analysts say inflation heat is cooling enough for a cut.",
    "date": "2025-11-06T00:01:39.000Z"
  },
  {
    "title": "Executive who worked with Charlie Javice at Frank sentenced to 68 months in prison for fraud",
    "url": "https://www.reuters.com/legal/government/executive-who-worked-with-charlie-javice-frank-sentenced-68-months-prison-fraud-2025-11-05/",
    "description": "A former finance executive convicted of helping Charlie Javice defraud JPMorgan Chase into buying the college financial aid startup Frank for $175 million was sentenced on Wednesday to 68 months in prison.",
    "date": "2025-11-05T23:14:46.000Z"
  },
  {
    "title": "JPMorgan investment in Detroit to model plans for other US cities",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/jpmorgan-investment-detroit-model-plans-other-us-cities-2025-11-05/",
    "description": "JPMorgan Chase has invested $2 billion during the past 11 years in Detroit to help reduce unemployment and boost growth, CEO Jamie Dimon said in an interview in the city on Wednesday, and the bank plans to roll out the model in other U.S. cities.",
    "date": "2025-11-05T22:08:58.000Z"
  },
  {
    "title": "Fed finalizes revised standard for grading big banks",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/fed-finalizes-revised-standard-grading-big-banks-2025-11-05/",
    "description": "The U.S. Federal Reserve announced on Wednesday it had finalized a revised framework for how it grades large banks, which will make it easier for firms to maintain a passing grade.",
    "date": "2025-11-05T22:03:26.000Z"
  },
  {
    "title": "BofA raises return target as CEO's new plan aims to catch up with rivals",
    "url": "https://www.reuters.com/business/finance/bank-america-raises-return-target-bid-catch-up-with-rivals-2025-11-05/",
    "description": "Bank of America raised a closely watched profitability target on Wednesday as CEO Brian Moynihan laid out a plan to catch up with Wall Street rivals that includes tech investments and an expansion strategy.",
    "date": "2025-11-05T19:26:34.000Z"
  },
  {
    "title": "Australia's NAB CEO says housing is greatest societal challenge as bank books $4.6 bln profit",
    "url": "https://www.reuters.com/business/finance/national-australia-banks-annual-cash-profit-broadly-stable-2025-11-05/",
    "description": "National Australia Bank Chief Executive Andrew Irvine said Australia needs to speed up its decision making to drive economic growth and fast-track increasing housing supply, which is the country's \"biggest societal and policy challenge\".",
    "date": "2025-11-05T23:39:33.000Z"
  },
  {
    "title": "Chime lifts 2025 revenue outlook as more customers turn to digital banks",
    "url": "https://www.reuters.com/business/finance/chime-lifts-2025-revenue-forecast-growth-digital-banking-users-2025-11-05/",
    "description": "Chime raised its full-year revenue forecast above Wall Street estimates on Wednesday, as demand for its digital banking services kept growing, sending shares up 4% in extended trading.",
    "date": "2025-11-05T21:58:16.000Z"
  },
  {
    "title": "Robinhood profit surpasses expectations as retail traders ride market momentum",
    "url": "https://www.reuters.com/business/finance/robinhood-profit-skyrockets-retail-traders-ride-market-momentum-2025-11-05/",
    "description": "Robinhood Markets topped third-quarter profit estimates on Wednesday as retail traders shrugged off bubble fears, and the online brokerage announced the retirement of its longtime finance chief.",
    "date": "2025-11-05T22:53:32.000Z"
  },
  {
    "title": "UK's Reeves set to spare banks from budget tax raid, FT reports",
    "url": "https://www.reuters.com/business/finance/uks-reeves-set-spare-banks-budget-tax-raid-ft-reports-2025-11-05/",
    "description": "British Finance Minister Rachel Reeves is set to spare banks from a punitive budget tax raid, after making it clear to colleagues she wants the sector to remain competitive and able to support the country’s growth, the Financial Times reported on Wednesday.",
    "date": "2025-11-05T21:12:50.000Z"
  },
  {
    "title": "Italian banks BPER Banca and Popolare di Sondrio boards approve merger plan",
    "url": "https://www.reuters.com/business/finance/italian-banks-bper-banca-popolare-di-sondrio-boards-approve-merger-plan-2025-11-05/",
    "description": "The boards of BPER Banca and Banca Popolare di Sondrio on Wednesday signed off on a merger plan between the two Italian lenders, the companies said in a statement.",
    "date": "2025-11-05T19:46:28.000Z"
  },
  {
    "title": "Wells Fargo CEO expects bank's workforce to shrink further",
    "url": "https://www.reuters.com/business/finance/wells-fargo-ceo-says-bank-not-under-pressure-make-acquisitions-2025-11-05/",
    "description": "Wells Fargo CEO Charlie Scharf said on Wednesday he expects the U.S. bank's workforce to decline further as it focuses on efficiency.",
    "date": "2025-11-05T22:42:06.000Z"
  },
  {
    "title": "Bank of America CEO says company may consider acquisitions in payments",
    "url": "https://www.reuters.com/business/finance/bank-america-ceo-says-company-may-consider-acquisitions-payments-2025-11-05/",
    "description": "Bank of America could consider acquiring more payment businesses in the United States, but the bank is not looking at deals in overseas markets, CEO Brian Moynihan said on Wednesday.",
    "date": "2025-11-05T18:54:03.000Z"
  },
  {
    "title": "Mediobanca profit falls 11.8% hit by MPS, Banca Generali bid costs",
    "url": "https://www.reuters.com/business/finance/mediobanca-profit-falls-118-hit-by-mps-banca-generali-bid-costs-2025-11-05/",
    "description": "Italian merchant bank Mediobanca on Wednesday reported an 11.8% yearly fall in quarterly net profit, hit by costs tied to its defence against Banca Monte dei Paschi's (MPS) takeover bid, despite steady revenues.",
    "date": "2025-11-05T17:49:19.000Z"
  },
  {
    "title": "SocGen to close 101 branches in France in 2026, CGT union says",
    "url": "https://www.reuters.com/business/finance/socgen-close-101-branches-france-2026-cgt-union-says-2025-11-05/",
    "description": "Societe Generale , France's third-biggest listed bank, is poised to close 101 branches in the country next year, the CGT union said in an emailed statement on Wednesday.",
    "date": "2025-11-05T17:34:24.000Z"
  },
  {
    "title": "Bank of England's Breeden urges closer UK-US stablecoin collaboration",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/bank-englands-breeden-bangs-drum-uk-us-stablecoin-collaboration-2025-11-05/",
    "description": "Bank of England deputy governor Sarah Breeden said on Wednesday it was \"really important\" for the U.S. and Britain to be synchronised on regulation of stablecoins.",
    "date": "2025-11-05T17:24:34.000Z"
  },
  {
    "title": "Bank of America's wealth unit eyes 4%-5% net new asset growth",
    "url": "https://www.reuters.com/business/finance/bank-americas-wealth-unit-eyes-4-5-net-new-asset-growth-2025-11-05/",
    "description": "Bank of America's wealth business is targeting 4% to 5% net new asset growth in the medium term, executives said on Wednesday.",
    "date": "2025-11-05T16:38:12.000Z"
  },
  {
    "title": "Deutsche Bank chairman Wynaendts nominated for another term",
    "url": "https://www.reuters.com/business/finance/deutsche-bank-chairman-wynaendts-nominated-another-term-2025-11-05/",
    "description": "Deutsche Bank's supervisory board nominated its Chairman Alexander Wynaendts for another term, the German bank said on Wednesday.",
    "date": "2025-11-05T16:26:20.000Z"
  },
  {
    "title": "Orsted says it has no plans to merge with Equinor's renewables unit",
    "url": "https://www.reuters.com/business/energy/orsted-says-it-has-no-plans-merge-with-equinors-renewables-unit-2025-11-05/",
    "description": "Danish offshore wind giant Orsted said on Wednesday that it had no plans to take over the renewables business of Equinor , its second biggest shareholder, which has proposed closer ties between the companies.",
    "date": "2025-11-05T15:57:11.000Z"
  },
  {
    "title": "Germany says 18 arrested after probe of online fraud involving payment providers",
    "url": "https://www.reuters.com/world/americas/germany-arrests-18-international-crackdown-suspected-online-fraud-german-2025-11-05/",
    "description": "Eighteen people have been arrested following a German-led internationally coordinated investigation of online fraud and money laundering networks that used payment service providers, German authorities said on Wednesday.",
    "date": "2025-11-05T14:05:43.000Z"
  },
  {
    "title": "BofA's top brass to focus on growth plans at investor day",
    "url": "https://www.reuters.com/business/finance/bofas-top-brass-focus-growth-plans-investor-day-2025-11-05/",
    "description": "Bank of America's top executives will take center stage at Wednesday's investor day in Boston, with analysts expecting them to outline plans to boost performance and narrow the gap to rival JPMorgan Chase .",
    "date": "2025-11-05T11:35:27.000Z"
  },
  {
    "title": "Nexi cautious on profit margin outlook as bank contracts weigh",
    "url": "https://www.reuters.com/business/finance/nexi-cautious-profit-margin-outlook-bank-contracts-weigh-2025-11-05/",
    "description": "Italy's Nexi , one of Europe's top two payments groups, sounded a note of caution about its profit margin on Wednesday, after reporting a lower than expected core profit for the third quarter and sending its shares down as much as 10%.",
    "date": "2025-11-05T13:11:37.000Z"
  },
  {
    "title": "Opinions split over AI bubble after billions invested",
    "url": "https://www.reuters.com/business/finance/opinions-split-over-ai-bubble-after-billions-invested-2025-10-16/",
    "description": "Companies announcing multi-billion dollar investments in artificial intelligence have raised concerns about the formation of a bubble reminiscent of the dotcom boom and bust.",
    "date": "2025-11-05T14:48:25.000Z"
  },
  {
    "title": "JPMorgan Chase responding to requests on 'debanking' policies",
    "url": "https://www.reuters.com/business/finance/jpmorgan-chase-responding-government-fair-access-banking-policies-2025-11-04/",
    "description": "JPMorgan Chase said in a regulatory filing on Tuesday it was cooperating with inquiries from government agencies and other entities regarding its policies and procedures in light of the Trump administration's push to scrutinize banks over alleged \"debanking\" of certain industries or clients.",
    "date": "2025-11-04T22:51:42.000Z"
  },
  {
    "title": "UK's FTSE 100 clinches new record close; focus on BoE, earnings",
    "url": "https://www.reuters.com/business/finance/uk-stocks-flat-financials-losses-counter-energy-gains-focus-boe-earnings-2025-11-05/",
    "description": "UK's FTSE 100 scaled a fresh record close on Wednesday after starting on a quiet note, while investors await the Bank of England's interest rate decision and more corporate earnings later this week.",
    "date": "2025-11-05T18:43:28.000Z"
  },
  {
    "title": "Japan's crypto players jostle for market share on regulatory easing hopes",
    "url": "https://www.reuters.com/business/finance/japans-crypto-players-jostle-market-share-regulatory-easing-hopes-2025-11-04/",
    "description": "From the launch of new products and services in Japan to facilitating leveraged trading bets, crypto exchanges and some financial firms are rushing to cash in on rising investor enthusiasm for digital assets amid hopes of easing regulations.",
    "date": "2025-11-05T20:25:30.000Z"
  },
  {
    "title": "Nexi says it no longer has commitment to buy Sabadell unit, but is open to new deal",
    "url": "https://www.reuters.com/business/finance/nexi-says-it-no-longer-has-commitment-buy-sabadell-unit-is-open-new-deal-2025-11-05/",
    "description": "Italian payments group Nexi no longer has any commitment or obligation to buy Sabadell's retailers' payments unit, but is open to discussing a possible future deal on different terms, its CEO said on Wednesday.",
    "date": "2025-11-05T16:26:41.000Z"
  },
  {
    "title": "Morning Bid: Wall Street gets vertigo",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-11-05/",
    "description": "What matters in U.S. and global markets today",
    "date": "2025-11-05T11:44:48.000Z"
  },
  {
    "title": "Futuristic quantum computing stocks take speculators on roller-coaster ride",
    "url": "https://www.reuters.com/business/finance/futuristic-quantum-computing-stocks-take-speculators-roller-coaster-ride-2025-11-05/",
    "description": "Investors in pure-play quantum computing stocks are grappling to value these futuristic companies, making prices highly volatile for the latest hot trend on Wall Street.",
    "date": "2025-11-05T11:10:55.000Z"
  },
  {
    "title": "Poland's government in talks with banks over loans for miner JSW, minister says",
    "url": "https://www.reuters.com/business/finance/polands-government-talks-with-banks-over-loans-miner-jsw-minister-says-2025-11-05/",
    "description": "Poland's government is in talks with banks about possible loans to help save troubled miner JSW , State Assets Minister Wojciech Balczun said on Wednesday.",
    "date": "2025-11-05T10:56:34.000Z"
  },
  {
    "title": "UK watchdog extends consultation on motor finance compensation scheme",
    "url": "https://www.reuters.com/world/uk/uk-regulator-extends-motor-finance-consultation-deadline-2025-11-05/",
    "description": "Britain's financial regulator has extended a deadline for feedback on a proposed compensation scheme for motor finance mis-selling by three weeks after banks, consumers and dealership groups called for more time to analyse reams of market data.",
    "date": "2025-11-05T13:15:27.000Z"
  },
  {
    "title": "Tesla board to shareholders: Pay Musk or else",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/tesla-board-shareholders-pay-musk-or-else-2025-11-05/",
    "description": "Tesla's board of directors has pushed in all its chips on Elon Musk. Now investors must decide whether to back the biggest bet in company history.",
    "date": "2025-11-06T19:42:58.000Z"
  },
  {
    "title": "Nordea targets return on equity exceeding 15% in 2026–2030",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/nordea-targets-return-equity-above-15-2026-2030-2025-11-05/",
    "description": "Nordea , the Nordic region's biggest bank, is targeting a return on equity of more than 15% between 2026 and 2030, and significantly above that in 2030, it said in a statement ahead of its investor day on Wednesday.",
    "date": "2025-11-05T12:18:06.000Z"
  },
  {
    "title": "Italy's Fineco exceeds quarterly profit, revenue forecasts",
    "url": "https://www.reuters.com/business/finance/fineco-posts-higher-than-expected-third-quarter-profit-2025-11-05/",
    "description": "Italian online bank and brokerage Fineco reported a higher-than-forecast third quarter profit on Wednesday, with its revenue bucking expectations for a drop from a year earlier.",
    "date": "2025-11-05T09:20:38.000Z"
  },
  {
    "title": "UK savers pulling cash from pensions ahead of budget, money managers say",
    "url": "https://www.reuters.com/business/finance/uk-savers-pulling-cash-pensions-ahead-budget-money-managers-say-2025-11-05/",
    "description": "British money managers are reporting a jump in people withdrawing cash from their pensions before this month's budget, amid fears for their tax advantages as the government warns it needs to make hard choices to prop up public finances.",
    "date": "2025-11-05T15:26:27.000Z"
  },
  {
    "title": "Five debt hotspots in the AI data centre boom",
    "url": "https://www.reuters.com/business/finance/five-debt-hotspots-ai-data-centre-boom-2025-11-05/",
    "description": "AI fever has propelled global stocks to record highs, but the data centres needed to power the promised revolution are increasingly being financed with complex debt that investors are scouring for signs of a bubble.",
    "date": "2025-11-05T05:42:16.000Z"
  },
  {
    "title": "China's services growth hits three-month low in October, PMI shows",
    "url": "https://www.reuters.com/business/finance/chinas-services-growth-hits-three-month-low-october-pmi-shows-2025-11-05/",
    "description": "China's services activity expanded in October but at its slowest pace in three months, as a decline in overseas orders offset the boost from improved domestic demand, a private survey released on Wednesday showed.",
    "date": "2025-11-05T01:54:50.000Z"
  },
  {
    "title": "Wall Street heavyweights flag risk of pullback in equity markets",
    "url": "https://www.reuters.com/business/finance/morgan-stanley-ceo-warns-market-heading-towards-correction-2025-11-04/",
    "description": "CEOs of Wall Street heavyweights Morgan Stanley and Goldman Sachs on Tuesday cautioned that equity markets could be heading toward a drawdown, underscoring growing concerns over sky-high valuations.",
    "date": "2025-11-04T19:40:23.000Z"
  },
  {
    "title": "Appeals court skeptical of Sam Bankman-Fried's bid to toss crypto fraud conviction",
    "url": "https://www.reuters.com/legal/government/sam-bankman-frieds-lawyers-argue-new-fraud-trial-ftx-founder-2025-11-04/",
    "description": "A federal appeals court on Tuesday appeared skeptical toward Sam Bankman-Fried's arguments that his fraud conviction and 25-year prison sentence over the collapse of his FTX cryptocurrency exchange should be tossed because his trial was unfair.",
    "date": "2025-11-04T21:41:27.000Z"
  },
  {
    "title": "U.S. bank regulator looking to ensure big banks have scrapped 'debanking' policies",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-bank-regulator-looking-ensure-big-banks-have-scrapped-debanking-policies-2025-11-04/",
    "description": "A senior U.S. bank regulator said Tuesday that he is looking to ensure that large banks have abandoned previous policies that may have contributed to \"debanking\" of certain industries or clients.",
    "date": "2025-11-04T20:31:07.000Z"
  },
  {
    "title": "Brazil's Itau hikes net interest income outlook, posts recurring profit in line with forecasts",
    "url": "https://www.reuters.com/business/finance/brazils-itau-hikes-net-interest-income-outlook-posts-line-recurring-profit-2025-11-04/",
    "description": "Brazilian lender Itau Unibanco on Tuesday reported third-quarter net recurring profit in line with analysts' estimates and raised its projection for 2025 net interest income with the market.",
    "date": "2025-11-05T00:26:17.000Z"
  },
  {
    "title": "U.S. bank regulator says mergers could be 'valuable,' committed to speedy review",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-bank-regulator-says-mergers-could-be-valuable-committed-speedy-review-2025-11-04/",
    "description": "A top U.S. bank regulator said Tuesday that his agency is committed to promptly reviewing potential bank mergers, adding that such deals could be \"quite valuable\" to the financial system.",
    "date": "2025-11-04T20:32:45.000Z"
  },
  {
    "title": "Exclusive: Apollo withdraws $2.1 billion bid to take pizza chain Papa John's private, sources say",
    "url": "https://www.reuters.com/business/finance/apollo-withdraws-bid-take-pizza-chain-papa-johns-private-64-share-sources-say-2025-11-04/",
    "description": "Apollo Global has withdrawn its offer to take pizza chain Papa John’s private at $64 a share, according to two people familiar with the deal, as Wall Street waits to see what is expected to be a tough earnings report on Thursday.",
    "date": "2025-11-04T20:32:52.000Z"
  },
  {
    "title": "Jeffrey Epstein had accounts with Goldman Sachs and HSBC, documents show",
    "url": "https://www.reuters.com/business/finance/jeffrey-epstein-had-accounts-with-goldman-sachs-hsbc-documents-show-2025-11-04/",
    "description": "Jeffrey Epstein, the disgraced late financier and sex offender, had accounts at Goldman Sachs , HSBC and other banks, new court filings show.",
    "date": "2025-11-04T17:38:14.000Z"
  },
  {
    "title": "Some UBS capital rules should be softened, lawmakers tell Swiss government",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/some-ubs-capital-rules-should-be-softened-lawmakers-tell-swiss-government-2025-11-04/",
    "description": "Capital requirements for UBS should not exceed those in other major financial centres, a Swiss parliamentary committee said on Tuesday, increasing pressure on the government to ease part of proposed rules that do not require lawmakers' approval.",
    "date": "2025-11-04T16:57:36.000Z"
  },
  {
    "title": "EU's frozen-asset funding for Ukraine may need bridging solution, Dombrovskis says",
    "url": "https://www.reuters.com/business/finance/eus-frozen-asset-funding-ukraine-may-need-bridging-solution-dombrovskis-says-2025-11-04/",
    "description": "The European Union may need to come up with a bridging solution to keep Ukraine financed in early 2026 if a deal on an EU loan, based on immobilised Russian assets, continues to be delayed, European Economic Commissioner Valdis Dombrovskis said.",
    "date": "2025-11-04T17:04:16.000Z"
  },
  {
    "title": "UK's Starling signs software deal with Canada's Tangerine, plans 100 hires",
    "url": "https://www.reuters.com/business/finance/uks-starling-signs-software-deal-with-canadas-tangerine-plans-100-hires-2025-11-04/",
    "description": "Starling Group has signed a 10-year agreement to upgrade core software at Tangerine, a Canadian digital bank owned by Bank of Nova Scotia , as the British-based bank continues its global expansion, Starling said on Tuesday.",
    "date": "2025-11-04T14:14:07.000Z"
  },
  {
    "title": "Norway pauses wealth fund's ethical divestments",
    "url": "https://www.reuters.com/business/finance/norway-poised-pause-wealth-funds-ethical-divestments-2025-11-04/",
    "description": "Norway's parliament on Tuesday voted in favour of pausing ethical divestments by its $2.1 trillion sovereign wealth fund, the world's largest, while it updates the fund's ethical guidelines.",
    "date": "2025-11-04T14:25:39.000Z"
  },
  {
    "title": "Brazil asset manager rejects report of talks with Bunge over Kepler Weber stake",
    "url": "https://www.reuters.com/business/finance/bunge-talks-buy-stake-brazils-kepler-weber-o-globo-reports-2025-11-04/",
    "description": "Brazilian asset manager Trigono Capital is not seeking to sell its stake in grains silo maker Kepler Weber , an executive said on Tuesday, rebuffing a report of talks with U.S. commodities trader Bunge about a potential deal.",
    "date": "2025-11-05T06:29:49.000Z"
  },
  {
    "title": "Morning Bid: Nerves rising about frothy valuations",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-11-04/",
    "description": "What matters in U.S. and global markets today",
    "date": "2025-11-04T11:49:50.000Z"
  },
  {
    "title": "Apollo pledges future growth as profit, assets swell",
    "url": "https://www.reuters.com/business/finance/apollos-profit-beats-expectations-record-fee-related-income-2025-11-04/",
    "description": "Apollo Global Management beat Wall Street's forecasts for third-quarter profit and pledged more growth on Tuesday, backed by a swelling pile of assets, growth in lending and profit from its retirement unit.",
    "date": "2025-11-04T17:45:40.000Z"
  },
  {
    "title": "Orsted sells 50% stake in UK wind farm for $6 billion to Apollo",
    "url": "https://www.reuters.com/sustainability/climate-energy/orsted-sells-50-stake-uk-wind-farm-6-billion-2025-11-03/",
    "description": "Denmark's Orsted said on Monday it agreed to sell a 50% stake in Britain's Hornsea 3 offshore wind farm for around 39 billion Danish crowns ($6.09 billion), widely regarded as a crucial move to prevent a crippling credit rating downgrade.",
    "date": "2025-11-04T10:55:12.000Z"
  },
  {
    "title": "Germany property bank PBB falls to near record lows",
    "url": "https://www.reuters.com/business/finance/germany-property-bank-pbb-falls-near-record-lows-2025-11-04/",
    "description": "Deutsche Pfandbriefbank (PBB) shares fell further on Tuesday with traders citing no clear driver behind the slump amid markets growing concerned about broader credit conditions.",
    "date": "2025-11-04T09:24:50.000Z"
  },
  {
    "title": "Santander's Botin warns against overregulation, calls for EU innovation policies",
    "url": "https://www.reuters.com/business/finance/santander-chief-ana-botin-warns-against-overregulation-europe-2025-11-04/",
    "description": "Santander's executive chair Ana Botin warned on Tuesday against overregulation of Europe's banking sector, saying it would hurt economic growth, and urged European governments to allow companies to invest and be more innovative.",
    "date": "2025-11-04T15:12:50.000Z"
  },
  {
    "title": "Swiss National Bank in good position with current rates, board member says",
    "url": "https://www.reuters.com/business/finance/swiss-national-bank-good-position-with-current-rates-board-member-says-2025-11-04/",
    "description": "The Swiss National Bank is well positioned with its current interest rates, governing board member Petra Tschudin told Swiss broadcaster TeleZueri in an interview to be broadcast on Tuesday.",
    "date": "2025-11-04T08:02:24.000Z"
  },
  {
    "title": "ECB gives Caltagirone green light to up stake in Monte dei Paschi, source says",
    "url": "https://www.reuters.com/business/finance/ecb-gives-caltagirone-green-light-up-stake-monte-dei-paschi-source-says-2025-11-04/",
    "description": "The European Central Bank (ECB) has authorised Francesco Gaetano Caltagirone to raise his stake in Tuscan lender Monte dei Paschi di Siena (MPS) to up to 20%, a source close to the Italian entrepreneur told Reuters on Tuesday.",
    "date": "2025-11-04T06:33:16.000Z"
  },
  {
    "title": "UBS chairman says Switzerland is having an 'identity crisis'",
    "url": "https://www.reuters.com/business/finance/ubs-chairman-says-switzerland-is-having-an-identity-crisis-2025-11-04/",
    "description": "UBS Chairman Colm Kelleher on Tuesday said Switzerland is having an \"identity crisis\" about its role in the world of banking.",
    "date": "2025-11-04T03:10:15.000Z"
  },
  {
    "title": "Loan demand from US mid- and large firms improves, Fed survey shows",
    "url": "https://www.reuters.com/business/finance/loan-demand-us-mid-large-firms-improves-fed-survey-shows-2025-11-03/",
    "description": "Business loan demand from large and mid-sized U.S. firms strengthened by the most in about three years in the third quarter while demand from small firms was essentially unchanged from the prior quarter, a Federal Reserve survey showed on Monday.",
    "date": "2025-11-03T23:15:40.000Z"
  },
  {
    "title": "Divided Fed policymakers stake out positions ahead of December meeting",
    "url": "https://www.reuters.com/business/feds-miran-cant-judge-stance-monetary-policy-buoyant-financial-markets-2025-11-03/",
    "description": "Federal Reserve officials on Monday continued pressing competing views of where the economy stands and the risks facing it, a debate set to intensify ahead of the U.S. central bank's next policy meeting and in the absence of data suspended due to the federal government shutdown.",
    "date": "2025-11-03T23:03:44.000Z"
  },
  {
    "title": "Indian financial crimes agency freezes Anil Ambani Group properties worth $853 million",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/india-crime-agency-attaches-anil-ambani-group-properties-worth-over-341-million-2025-11-03/",
    "description": "India's financial crime agency has frozen 75 billion rupees ($853 million) worth of properties linked to companies of the Reliance Anil Ambani Group as part of a money-laundering probe, it said in a statement on Monday.",
    "date": "2025-11-03T15:22:26.000Z"
  },
  {
    "title": "BofA CEO faces calls to boost returns, dealmaking as investors gather",
    "url": "https://www.reuters.com/business/finance/bofa-ceo-faces-calls-boost-returns-dealmaking-investors-gather-2025-11-03/",
    "description": "As Bank of America executives step on stage on Wednesday to address investors, they face pressure to boost returns through dealmaking and wealth management to catch up with larger rival JPMorgan Chase .",
    "date": "2025-11-03T15:53:49.000Z"
  },
  {
    "title": "TechMet to add to portfolio, fears Europe losing battle for critical minerals",
    "url": "https://www.reuters.com/business/finance/techmet-add-portfolio-fears-europe-losing-battle-critical-minerals-2025-11-03/",
    "description": "The CEO of U.S.-backed investment vehicle TechMet is evaluating portfolio additions, including bidding for a Ukraine lithium deposit, but worries that Europe is lagging behind the U.S. in building a critical minerals sector to reduce Chinese dominance.",
    "date": "2025-11-03T18:17:20.000Z"
  },
  {
    "title": "European banks increase reliance on US dollar funding, EU regulator finds",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/european-banks-increase-reliance-us-dollar-funding-eu-regulator-finds-2025-11-03/",
    "description": "European banks increased their reliance on U.S. dollars last year, Europe's banking regulator said on Monday, amid growing concerns about the region's vulnerability should dollar financing dry up.",
    "date": "2025-11-03T15:18:24.000Z"
  },
  {
    "title": "Hedge fund Millennium sells 15% stake to select investors, internal email shows",
    "url": "https://www.reuters.com/business/hedge-fund-millennium-sells-15-stake-select-investors-ft-reports-2025-11-03/",
    "description": "Millennium Management has sold a 15% stake to a group that included some of its largest institutional investors, according to an internal email seen by Reuters, marking the first time the hedge fund has divested ownership in its nearly four-decade run.",
    "date": "2025-11-03T16:05:39.000Z"
  },
  {
    "title": "UK regulator refers Getty-Shutterstock merger for an in-depth investigation",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/uk-regulator-refers-getty-shutterstock-merger-an-in-depth-investigation-2025-11-03/",
    "description": "Britain's competition watchdog said on Monday it will launch an investigation into the proposed merger between U.S.-based Getty Images and rival Shutterstock after remedies offered by the companies failed to address its concerns.",
    "date": "2025-11-04T06:53:08.000Z"
  },
  {
    "title": "Rabobank and PGGM in 1 billion euro deal to share credit risk on Dutch real estate",
    "url": "https://www.reuters.com/business/finance/rabobank-pggm-1-billion-euro-deal-share-credit-risk-dutch-real-estate-2025-11-03/",
    "description": "Dutch bank Rabobank has signed a 1 billion euro ($1.17 billion) deal with pension investment firm PGGM to share the credit risk on a portfolio of Dutch property estates, the companies said on Monday.",
    "date": "2025-11-03T12:27:58.000Z"
  },
  {
    "title": "Westpac annual profit slips as it faces fierce home-lending competition",
    "url": "https://www.reuters.com/business/finance/australian-lender-westpacs-annual-profit-falls-2-2025-11-02/",
    "description": "Australia's Westpac Banking Corp reported a slight fall in annual profit on Monday but beat analyst forecasts, sending its shares up nearly 3%, as the bank works to boost its market share in the intensely competitive home loan market.",
    "date": "2025-11-03T07:04:09.000Z"
  },
  {
    "title": "RBNZ stress test finds top banks strong against geopolitical risks",
    "url": "https://www.reuters.com/business/finance/rbnz-stress-test-finds-top-banks-strong-against-geopolitical-risks-2025-11-02/",
    "description": "A bank solvency stress test conducted by the Reserve Bank of New Zealand found the country's five largest banks are well placed to withstand the impact of heightened geopolitical risks, the central bank said on Monday.",
    "date": "2025-11-02T22:41:30.000Z"
  },
  {
    "title": "Surprise Swiss inflation dip not enough to warrant central bank action, analysts say",
    "url": "https://www.reuters.com/business/finance/surprise-swiss-inflation-dip-not-enough-warrant-central-bank-action-analysts-say-2025-11-03/",
    "description": "Inflation in Switzerland fell unexpectedly in October, government data showed on Monday, although not enough to make the central bank consider interest rate cuts, analysts said.",
    "date": "2025-11-03T14:33:51.000Z"
  },
  {
    "title": "Morning Bid: November lift ahead of tariff hearing",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-11-03/",
    "description": "What matters in U.S. and global markets today.",
    "date": "2025-11-03T11:34:23.000Z"
  },
  {
    "title": "Investors call for creation of International Minerals Agency",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/investors-call-creation-international-minerals-agency-2025-11-03/",
    "description": "A group of investors in mining called on Monday for the creation of an independent agency for the sector modelled after the International Energy Agency.",
    "date": "2025-11-03T00:24:54.000Z"
  },
  {
    "title": "Bank of America picks Manelski and Zuberi to run global markets unit, memo shows",
    "url": "https://www.reuters.com/business/finance/bank-america-picks-manelski-zuberi-run-global-markets-unit-memo-shows-2025-10-31/",
    "description": "Bank of America promoted Denis Manelski and Soofian Zuberi to become presidents and co-heads of global markets and made several other leadership changes in its trading arm, according to an internal memo seen by Reuters on Friday.",
    "date": "2025-10-31T21:29:20.000Z"
  },
  {
    "title": "Berkshire cash sets record as profit rises, signaling caution ahead of Buffett exit",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/berkshire-profit-rises-cash-soars-record-2025-11-01/",
    "description": "Berkshire Hathaway signaled on Saturday that it remained cautious about markets, letting cash swell to a record $381.7 billion even as profit rose, in its last financial report before Warren Buffett bows out as chief executive.",
    "date": "2025-11-01T16:17:48.000Z"
  },
  {
    "title": "First Guaranty Bancshares swings to quarterly loss on exposure to auto parts bankruptcy",
    "url": "https://www.reuters.com/business/finance/first-guaranty-bancshares-swings-quarterly-loss-exposure-auto-parts-bankruptcy-2025-10-31/",
    "description": "First Guaranty Bancshares said on Friday it has swung to a third-quarter loss, as the lender booked an impairment charge and increased reserves for bad loans linked to an auto parts manufacturer bankruptcy.",
    "date": "2025-10-31T22:20:22.000Z"
  },
  {
    "title": "Central Bancompany eyes up to $5.7 billion valuation in rare US bank IPO",
    "url": "https://www.reuters.com/business/finance/central-bancompany-seeks-raise-up-nearly-427-million-us-ipo-2025-10-31/",
    "description": "Central Bancompany said on Friday that it was targeting a valuation of up to $5.72 billion in its U.S. initial public offering, in a rare move for a U.S. bank looking for a fresh flotation.",
    "date": "2025-10-31T22:46:41.000Z"
  },
  {
    "title": "Banks tap Fed Standing Repo Facility in record numbers amid month-end pressures",
    "url": "https://www.reuters.com/business/finance/banks-tap-fed-standing-repo-facility-record-numbers-amid-month-end-pressures-2025-10-31/",
    "description": "Federal Reserve liquidity facilities caught fire on Friday as month-end pressures pushed a key lending tool to a record level of usage.",
    "date": "2025-10-31T20:24:08.000Z"
  },
  {
    "title": "Bitcoin breaks October streak with first monthly loss since 2018",
    "url": "https://www.reuters.com/business/finance/bitcoin-breaks-october-streak-with-first-monthly-loss-since-2018-2025-10-31/",
    "description": "Bitcoin on Friday was on track for a monthly loss in October for the first time since 2018, snapping a seven-year streak of gains that had earned the month a lucky reputation among cryptocurrency traders.",
    "date": "2025-10-31T20:31:05.000Z"
  },
  {
    "title": "Buffett to issue letter to children and shareholders, hand off annual letter to Abel, WSJ says",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/buffett-issue-letter-children-shareholders-hand-off-annual-letter-abel-wsj-says-2025-10-31/",
    "description": "Warren Buffett will release a letter to his three children and Berkshire Hathaway shareholders on November 10, while Greg Abel will write Berkshire's annual shareholder letter in February after becoming chief executive, the Wall Street Journal said on Thursday, citing Buffett's assistant.",
    "date": "2025-10-31T16:35:12.000Z"
  },
  {
    "title": "Volkswagen secures credit lines from Brazil's BNDES to boost hybrids",
    "url": "https://www.reuters.com/business/finance/volkswagen-secures-credit-lines-brazils-bndes-boost-hybrids-2025-10-31/",
    "description": "Volkswagen said on Friday it has secured 2.3 billion reais ($425.62 million) in credit lines from Brazil's state development bank BNDES to boost the development of hybrid vehicles and expand exports from its Brazilian operations.",
    "date": "2025-10-31T16:20:57.000Z"
  },
  {
    "title": "LME fines Mizuho 265,000 pounds for rules breach",
    "url": "https://www.reuters.com/sustainability/lme-fines-mizuho-265000-pounds-rules-breach-2025-10-31/",
    "description": "The London Metal Exchange said on Friday it had fined a unit of Japanese financial group Mizuho 265,000 pounds ($356,000) for a breach of rules following an investigation into alleged misconduct.",
    "date": "2025-10-31T19:33:12.000Z"
  },
  {
    "title": "Morgan Stanley forecasts gold prices to reach $4,500/Oz by mid-2026",
    "url": "https://www.reuters.com/business/finance/bofa-hikes-gold-price-forecast-5000oz-2026-2025-10-13/",
    "description": "Morgan Stanley said on Friday that gold prices had potential to climb to $4,500 per ounce by mid-2026, citing strong physical demand by exchange-traded funds and central banks as the economic outlook remains uncertain.",
    "date": "2025-10-31T19:44:21.000Z"
  },
  {
    "title": "Exclusive: Russia plans to issue debut sovereign yuan-denominated bonds, sources say",
    "url": "https://www.reuters.com/markets/europe/russia-plans-issue-debut-sovereign-yuan-denominated-bonds-sources-say-2025-10-31/",
    "description": "Russia is planning to issue its debut yuan-denominated bond on the local market this year, sources told Reuters, offering an investment option for the vast amounts of yuan liquidity accumulated by exporters and banks from Russian energy sales to China.",
    "date": "2025-10-31T13:46:58.000Z"
  },
  {
    "title": "Morning Bid: 'Trick or Treat' on Wall Street",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-corrected-2025-10-31/",
    "description": "Everything Mike Dolan and the ROI team are excited to read, watch and listen to over the weekend.",
    "date": "2025-10-31T13:00:23.000Z"
  },
  {
    "title": "Erste Group lifts targets after profit beat, shares hit record high",
    "url": "https://www.reuters.com/business/finance/erste-group-lifts-targets-after-profit-beat-shares-hit-record-high-2025-10-31/",
    "description": "Erste Group Bank on Friday raised its annual targets after its third-quarter results beat expectations, supported by loan growth and lower customer deposit costs, sending its shares to a record high.",
    "date": "2025-10-31T10:55:09.000Z"
  },
  {
    "title": "Trump’s war on ‘woke’ forces community lenders to cut services or close",
    "url": "https://www.reuters.com/world/us/trumps-war-woke-forces-community-lenders-cut-services-or-close-2025-10-31/",
    "description": "A year ago, Karlene Sinclair-Robinson was writing loans and hosting education seminars for small businesses and entrepreneurs as finance director of a community development financial institution, or CDFI, in northern Virginia. Now, she’s helping shut it down for good on December 31.",
    "date": "2025-10-31T16:15:10.000Z"
  },
  {
    "title": "Wall Street has misgivings about Mamdani as mayor, but prepares for collaboration",
    "url": "https://www.reuters.com/world/us/wall-street-has-misgivings-about-mamdani-mayor-prepares-collaboration-2025-10-31/",
    "description": "Wall Street and the finance industry have broad misgivings about the prospect of frontrunner Zohran Mamdani becoming New York City's mayor, but many are hopeful he moderates his positions as they prepare to try and work alongside him.",
    "date": "2025-10-31T10:13:25.000Z"
  },
  {
    "title": "Princes Group makes subdued start to trading in London IPO",
    "url": "https://www.reuters.com/business/finance/princes-group-set-156-billion-valuation-london-ipo-2025-10-31/",
    "description": "Princes Group made a subdued trading debut on Friday after the food producer priced its IPO at the lower end of a marketed range, in a sign of investor caution for one of London's largest listings this year.",
    "date": "2025-10-31T11:49:07.000Z"
  },
  {
    "title": "UK house prices rise in October, defying pre-budget nerves",
    "url": "https://www.reuters.com/business/finance/uk-house-prices-rise-by-03-october-nationwide-says-2025-10-31/",
    "description": "British house prices rose in October, lender Nationwide said on Friday outpacing forecasts by economists and adding to signs of demand in the housing market in the run-up to finance minister Rachel Reeves' budget which is likely to include tax increases.",
    "date": "2025-10-31T07:34:11.000Z"
  },
  {
    "title": "Danske Bank reports third-quarter net profit slightly ahead of forecasts",
    "url": "https://www.reuters.com/business/finance/danske-banks-third-quarter-net-profit-slightly-beats-forecasts-2025-10-31/",
    "description": "Danske Bank , Denmark's biggest lender, reported third-quarter net profit slightly above expectations on Friday, supported by stable net interest income, and said it expected full-year net profit to be at the upper end of its guided range.",
    "date": "2025-10-31T07:32:56.000Z"
  },
  {
    "title": "Record gold profit adds shine to Swiss National Bank's results",
    "url": "https://www.reuters.com/business/finance/gold-price-surge-pushes-swiss-national-bank-profit-higher-2025-10-31/",
    "description": "The Swiss National Bank reported on Friday a third-quarter profit of 27.93 billion Swiss francs ($35 billion), helped by the booming value of its gold reserves.",
    "date": "2025-10-31T09:45:32.000Z"
  },
  {
    "title": "Fed's Bowman plans to cut bank-supervision unit by about 30%, email shows",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/feds-bowman-moves-reduce-bank-supervision-unit-by-about-30-bloomberg-news-2025-10-30/",
    "description": "U.S. Federal Reserve Vice Chair for Supervision Michelle Bowman plans to reorganize the agency's supervision and regulation division and cut the unit's staff by about 30%, according to an email sent to staff Thursday.",
    "date": "2025-10-31T01:00:12.000Z"
  },
  {
    "title": "US-backed mortgage giant Fannie Mae cuts more than 62 jobs across departments",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-backed-mortgage-giant-fannie-mae-cuts-more-than-62-jobs-across-departments-2025-10-30/",
    "description": "U.S. government-sponsored mortgage enterprise Fannie Mae has cut more than 62 jobs across departments, including Information Technology, and Diversity, Equity and Inclusion, Federal Housing Finance Agency Director William Pulte said on Thursday.",
    "date": "2025-10-30T22:31:37.000Z"
  },
  {
    "title": "ANZ flags $721 million hit to second-half profit from restructuring, compliance costs",
    "url": "https://www.reuters.com/business/finance/australias-anz-flags-over-721-million-profit-hit-second-half-2025-10-30/",
    "description": "Australia's ANZ Group on Friday said it would take a A$1.11 billion ($721.28 million) after-tax profit hit in the second half due to charges related to restructuring, staff cuts and a major regulatory settlement.",
    "date": "2025-10-31T03:12:19.000Z"
  },
  {
    "title": "DOGE to leave top US markets regulator, sources say",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/doge-leave-top-us-markets-regulator-sources-say-2025-10-30/",
    "description": "U.S. President Donald Trump's Department of Government Efficiency initiative, or DOGE, has wrapped up work at the Securities and Exchange Commission and will exit the agency this week, two sources familiar with the matter told Reuters on Thursday.",
    "date": "2025-10-30T21:43:13.000Z"
  },
  {
    "title": "Global central banks converge towards rate cut caution",
    "url": "https://www.reuters.com/business/finance/global-markets-cenbank-graphic-2025-10-30/",
    "description": "The U.S. Federal Reserve has moved back into line with other major rate setters after it cut rates by a quarter point on Wednesday but pushed back against market bets that it would keep going as the Washington shutdown fogs up its forecasting lens.",
    "date": "2025-10-31T07:09:16.000Z"
  },
  {
    "title": "JPMorgan names new vice chair for its diversified industries business, memo shows",
    "url": "https://www.reuters.com/business/finance/jpmorgan-names-new-vice-chair-its-diversified-industries-business-memo-shows-2025-10-30/",
    "description": "JPMorgan Chase has appointed former Rothschild executive Eric Hirschfield as the vice chair for its diversified industries business, according to a memo seen by Reuters.",
    "date": "2025-10-30T19:14:43.000Z"
  },
  {
    "title": "StanChart to hit return target early on robust wealth growth",
    "url": "https://www.reuters.com/business/finance/stanchart-third-quarter-profit-rises-3-beats-estimates-2025-10-30/",
    "description": "Standard Chartered (StanChart) said it would hit a key profitability target a year earlier than expected, after posting better-than-expected third-quarter earnings as its strategy to shift to fee-generating business paid off.",
    "date": "2025-10-30T10:00:36.000Z"
  },
  {
    "title": "Satellite maker EnduroSat gets $104 million funding from Google Ventures, others",
    "url": "https://www.reuters.com/science/satellite-maker-endurosat-gets-104-million-funding-google-ventures-others-2025-10-30/",
    "description": "EnduroSat said on Thursday it has raised $104 million from investors, Google Ventures and the European Investment Council Fund, as the Bulgaria-based company scales up production of its small and midsized satellites.",
    "date": "2025-10-30T18:41:07.000Z"
  },
  {
    "title": "Bullish options plays set to boost S&P 500 gyrations around 7,000 level",
    "url": "https://www.reuters.com/business/finance/bullish-options-plays-set-boost-sp-500-gyrations-around-7000-level-2025-10-30/",
    "description": "A wave of bullish options trading has amplified the U.S. stock market's advance toward another major milestone and left dealers positioned so that market swings are likely to be exaggerated in coming days or weeks, according to options specialists.",
    "date": "2025-10-30T18:08:43.000Z"
  },
  {
    "title": "ECB policymakers prepare for December showdown on inflation, rates",
    "url": "https://www.reuters.com/business/finance/ecb-policymakers-prepare-december-showdown-inflation-rates-2025-10-30/",
    "description": "European Central Bank policymakers are preparing for something of a showdown at their next meeting in December, when new three-year projections will shed light on whether or not they risk undershooting their target, four sources told Reuters.",
    "date": "2025-10-30T17:53:16.000Z"
  },
  {
    "title": "Lagarde's statement after ECB policy meeting",
    "url": "https://www.reuters.com/markets/europe/lagardes-statement-after-ecb-policy-meeting-2025-01-30/",
    "description": "Following is the text of European Central Bank President Christine Lagarde's statement after the bank's policy meeting on Thursday:",
    "date": "2025-10-30T14:06:17.000Z"
  },
  {
    "title": "KKR-backed ContourGlobal seals $350 mln funding package for US solar project",
    "url": "https://www.reuters.com/sustainability/climate-energy/kkr-backed-contourglobal-seals-350-mln-funding-package-us-solar-project-2025-10-30/",
    "description": "ContourGlobal has secured a funding package worth more than $350 million to support its solar installations in Colorado, the group owned by U.S. investment fund KKR said on Thursday.",
    "date": "2025-10-30T13:58:52.000Z"
  },
  {
    "title": "ECB keeps rates unchanged as economy hums along despite trade strife",
    "url": "https://www.reuters.com/business/finance/ecb-keeps-rates-unchanged-economy-hums-along-despite-trade-strife-2025-10-30/",
    "description": "The European Central Bank kept interest rates unchanged at 2% in a well-telegraphed decision on Thursday, offering no clues about its next move, even as investors keep betting that one final cut may be on the agenda in the coming months.",
    "date": "2025-10-30T13:20:27.000Z"
  },
  {
    "title": "Exclusive: State Street takes US fund arm out of climate group",
    "url": "https://www.reuters.com/sustainability/cop/state-street-takes-us-fund-arm-out-climate-group-2025-10-30/",
    "description": "State Street , the world's fourth-biggest asset manager, said it is pulling the bulk of its operations out of the sector's main global climate coalition despite the group's efforts to retain members by relaxing its rules.",
    "date": "2025-10-30T16:18:36.000Z"
  },
  {
    "title": "UK mobile bank Monzo to replace CEO Anil from February",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/uk-mobile-bank-monzo-replace-ceo-anil-february-2025-10-30/",
    "description": "British mobile bank Monzo said on Thursday that TS Anil would step down after almost six years as CEO and be replaced by Diana Layfield from February next year.",
    "date": "2025-10-30T13:32:19.000Z"
  },
  {
    "title": "Morning Bid: Hesitation about 'foregone conclusions'",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-10-30/",
    "description": "What matters in U.S. and global markets today",
    "date": "2025-10-30T11:34:24.000Z"
  },
  {
    "title": "Spain to cede some bank M&A powers to ECB, central bank",
    "url": "https://www.reuters.com/business/finance/spain-cede-some-bank-ma-powers-ecb-central-bank-2025-10-30/",
    "description": "The Spanish government plans to cede some powers related to banking supervision to the European Central Bank and the Bank of Spain, it said on Thursday, following EU criticism of its attempts to hinder BBVA's bid for Sabadell .",
    "date": "2025-10-30T18:25:51.000Z"
  },
  {
    "title": "Spanish PM Sanchez defends party financing in Senate grilling over graft scandals",
    "url": "https://www.reuters.com/world/spanish-pm-sanchez-defends-party-financing-senate-grilling-over-graft-scandals-2025-10-30/",
    "description": "Spanish Prime Minister Pedro Sanchez said on Thursday his Socialist Party's financing was completely above board as he faced a Senate commission of inquiry into a corruption scandal dogging his party and threatening his premiership.",
    "date": "2025-10-30T11:20:12.000Z"
  },
  {
    "title": "Exclusive: FBI searched California real estate firm linked to bad bank loans",
    "url": "https://www.reuters.com/legal/government/fbi-searched-california-real-estate-firm-linked-bad-bank-loans-2025-10-30/",
    "description": "The FBI last month searched the offices of a California real estate investment firm Continuum Analytics, which is linked to bad loans recently disclosed by Zions and Western Alliance , according to legal correspondence seen by Reuters.",
    "date": "2025-10-30T22:10:45.000Z"
  },
  {
    "title": "ECB hopes to launch digital euro pilot in 2027",
    "url": "https://www.reuters.com/business/finance/ecb-hopes-launch-digital-euro-pilot-2027-2025-10-30/",
    "description": "The European Central Bank said on Thursday it could launch a pilot of its digital currency in 2027 provided it can secure timely approval from lawmakers for a project it deems vital for the euro zone's financial autonomy.",
    "date": "2025-10-30T10:39:02.000Z"
  },
  {
    "title": "UK tax options for finance minister Reeves in budget",
    "url": "https://www.reuters.com/business/finance/uk-tax-options-finance-minister-reeves-november-budget-2025-10-30/",
    "description": "British finance minister Rachel Reeves is expected to raise tens of billions of pounds in taxes in her November 26 budget in order not to break her self-imposed fiscal rules, a key issue for bond investors.",
    "date": "2025-11-07T14:30:20.000Z"
  },
  {
    "title": "Shawbrook shares jump after biggest UK company IPO on LSE in two years",
    "url": "https://www.reuters.com/business/finance/british-lender-shawbrook-set-258-billion-valuation-london-ipo-2025-10-30/",
    "description": "Shares in British lender Shawbrook jumped as much as 8% in early Thursday trade following London's biggest initial public offering by a UK-based company in two years.",
    "date": "2025-10-30T17:41:15.000Z"
  },
  {
    "title": "Norway's Kongsberg Gruppen to spin off maritime business in IPO",
    "url": "https://www.reuters.com/business/aerospace-defense/norways-kongsberg-gruppen-spin-off-maritime-business-ipo-2025-10-30/",
    "description": "Norwegian defence contractor Kongsberg Gruppen , maker of the Joint Strike Missile air defence system, said on Thursday it planned to spin off its civilian-focused Kongsberg Maritime business in an initial public offering on the Oslo Bourse.",
    "date": "2025-10-30T07:03:28.000Z"
  },
  {
    "title": "ING sweetens profit beat with 1.6 billion euros of shareholder returns",
    "url": "https://www.reuters.com/business/finance/dutch-bank-ing-plans-11-billion-euro-buyback-q3-profit-beats-expectations-2025-10-30/",
    "description": "ING will return 1.6 billion euros ($1.9 billion) to investors through share buybacks and dividends, the Netherlands' largest bank said on Thursday, as strong growth in fee income and lending volumes helped it beat quarterly profit forecasts.",
    "date": "2025-10-30T12:35:35.000Z"
  },
  {
    "title": "BBVA sees higher lending income in its main markets in Mexico and Spain",
    "url": "https://www.reuters.com/business/finance/bbvas-q3-net-profit-falls-37-same-period-year-ago-2025-10-30/",
    "description": "Spain's BBVA on Thursday said it expected its lending income to keep growing in 2025 in Mexico and Spain after solid underlying results in the third quarter were somewhat overshadowed by a lower contribution from its Mexican unit.",
    "date": "2025-10-30T11:32:43.000Z"
  },
  {
    "title": "Credit Agricole's Q3 profit climbs after revaluing BPM stake",
    "url": "https://www.reuters.com/business/finance/credit-agricoles-q3-profit-climbs-after-revaluing-bpm-stake-2025-10-30/",
    "description": "France's Credit Agricole SA said on Thursday its third-quarter profit rose 10%, beating expectations but only after it marked up the value of its increased stake in Italy's Banco BPM and investment banking revenues rose.",
    "date": "2025-10-30T07:20:23.000Z"
  },
  {
    "title": "SocGen tops profit forecasts but shares slip as CEO holds fire on buybacks",
    "url": "https://www.reuters.com/business/finance/socgen-profit-jumps-11-ceo-steps-up-cost-cutting-drive-2025-10-30/",
    "description": "Societe Generale beat forecasts with an 11% third-quarter profit rise on Thursday, as the French bank's CEO Slawomir Krupa stepped up his drive to curb costs.",
    "date": "2025-10-30T10:14:29.000Z"
  },
  {
    "title": "Australia's Pepper Money in talks to buy Westpac's mortgage broking portfolio",
    "url": "https://www.reuters.com/business/finance/australias-pepper-money-talks-buy-westpacs-mortgage-broking-portfolio-2025-10-29/",
    "description": "Australian non-bank lender Pepper Money said on Thursday it is part of a consortium that is negotiating with major financial institution Westpac over acquiring the latter's mortgage broking portfolio.",
    "date": "2025-10-29T23:30:32.000Z"
  },
  {
    "title": "Italy is ready to amend golden powers to appease EU, sources say",
    "url": "https://www.reuters.com/business/finance/italy-is-ready-amend-golden-powers-appease-eu-sources-say-2025-10-29/",
    "description": "Italy has told the European Commission it is ready to make some changes to its so-called \"golden power\" rules aimed at shielding companies in strategic sectors, sources said, as the EU prepares disciplinary steps over the matter.",
    "date": "2025-10-29T16:32:52.000Z"
  },
  {
    "title": "Private credit bosses hit back at 'misinformation' over First Brands collapse",
    "url": "https://www.reuters.com/business/finance/private-credit-bosses-criticise-misinformation-over-first-brands-collapse-2025-10-29/",
    "description": "Blackstone Apollo and Ares had no exposure to U.S. companies First Brands and Tricolor at the time of their bankruptcies, executives said on Wednesday, arguing that the private credit industry had been unfairly linked to the collapses.",
    "date": "2025-10-29T16:04:53.000Z"
  },
  {
    "title": "ECB must have active role in payments' evolution to protect public trust in money",
    "url": "https://www.reuters.com/business/finance/ecb-must-have-active-role-payments-evolution-protect-public-trust-money-2025-10-29/",
    "description": "Central banks must remain on top of developments in the finance and payments industries and play an active role in order to protect the monetary systems that underpin all modern economies, a top European Central Bank said.",
    "date": "2025-10-29T19:19:48.000Z"
  },
  {
    "title": "Fed winding down balance sheet contraction amid tightening money markets",
    "url": "https://www.reuters.com/business/finance/fed-end-balance-sheet-reduction-december-1-2025-10-29/",
    "description": "The Federal Reserve on Wednesday said it is ending the drawdown of its still substantial balance sheet amid evidence money market liquidity conditions have begun tightening and bank reserve levels dropping.",
    "date": "2025-10-29T21:15:11.000Z"
  },
  {
    "title": "HSBC expands startup-focused group in Singapore as part of global push",
    "url": "https://www.reuters.com/business/finance/hsbc-expands-startup-focused-group-singapore-part-global-push-2025-10-29/",
    "description": "HSBC has expanded its innovation banking business to Singapore, pledging to allocate $1.5 billion in the city-state as part of a global push to lend to startup companies, the bank said on Wednesday.",
    "date": "2025-10-29T11:04:06.000Z"
  },
  {
    "title": "Bond write-down concerns take shine off UBS profit beat",
    "url": "https://www.reuters.com/business/finance/ubs-beats-expectations-third-quarter-profit-soars-25-billion-2025-10-29/",
    "description": "UBS reported a surge in third-quarter profit on Wednesday, but investors' focus quickly turned to billions of liabilities Switzerland's top bank could face from the disputed write-down of bonds during its takeover of rival Credit Suisse.",
    "date": "2025-10-29T13:11:18.000Z"
  },
  {
    "title": "Millennium bcp's profit rises 8.7%, driven by Polish unit",
    "url": "https://www.reuters.com/business/finance/millennium-bcps-profit-rises-87-driven-by-polish-unit-2025-10-29/",
    "description": "Portugal's largest listed bank, Millennium bcp on Wednesday posted an 8.7% rise in nine-month profit, boosted by its Polish unit Bank Millennium and solid domestic operations, despite pressure from lower ECB rates.",
    "date": "2025-10-29T17:47:42.000Z"
  },
  {
    "title": "Exclusive: Germany examines nationalising Rosneft arm after Trump sanctions",
    "url": "https://www.reuters.com/business/energy/germany-examines-nationalising-rosneft-arm-after-trump-sanctions-say-sources-2025-10-29/",
    "description": "U.S. sanctions on Russian oil producer Rosneft have rekindled discussions in Germany about nationalising the company's business there, including a refinery that Berlin depends on for most of its fuel, two sources familiar with the talks told Reuters.",
    "date": "2025-10-30T07:51:51.000Z"
  },
  {
    "title": "US judges question whether Argentina YPF case belongs in US",
    "url": "https://www.reuters.com/business/energy/us-judges-question-whether-argentina-ypf-case-belongs-us-2025-10-29/",
    "description": "At least two U.S. judges on a panel considering whether Argentina must pay investors $16.1 billion after seizing control of state-owned oil company YPF in 2012 questioned on Wednesday whether the case belonged in the United States.",
    "date": "2025-10-29T20:04:48.000Z"
  },
  {
    "title": "US judge blocks consumer agency’s 'open banking' rules for now",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-judge-blocks-consumer-agencys-open-banking-rules-now-2025-10-29/",
    "description": "A coalition of banking groups has convinced a federal judge to temporarily block enforcement of a U.S. Consumer Financial Protection Bureau rule aimed at making it easier for consumers to switch financial-service providers.",
    "date": "2025-10-29T17:03:10.000Z"
  },
  {
    "title": "Bank of Canada signals likely end to rate cuts, but keeps options open",
    "url": "https://www.reuters.com/world/americas/bank-canada-trims-key-interest-rate-hints-end-cuts-2025-10-29/",
    "description": "The Bank of Canada signaled on Wednesday an end to its cutting cycle after trimming its key overnight interest rate to 2.25%, but Governor Tiff Macklem said he would be ready to respond if Canada's economic outlook changed materially.",
    "date": "2025-10-29T17:00:58.000Z"
  },
  {
    "title": "German energy regulator signals concessions on grid reform, Handelsblatt says",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/german-energy-regulator-signals-concessions-grid-reform-handelsblatt-says-2025-10-29/",
    "description": "Germany's grid regulator is moving closer to meeting some of the demands of energy operators in a reform of infrastructure spending returns for the five years from 2028/2029 being finalised this year, Handelsblatt reported on Wednesday.",
    "date": "2025-10-29T16:06:54.000Z"
  },
  {
    "title": "Police raid Portugal's Novo Banco in corruption investigation",
    "url": "https://www.reuters.com/business/finance/police-raid-portugals-novo-banco-corruption-investigation-2025-10-29/",
    "description": "Portuguese police searched the premises of Novo Banco, the country's fourth-largest bank, as well as the local unit of auditing firm KPMG on Wednesday as part of an investigation into suspected corruption linked to the sale of the lender's assets, prosecutors said.",
    "date": "2025-10-29T16:09:19.000Z"
  },
  {
    "title": "Italy’s Bending Spoons to acquire AOL, secures $2.8 bln in debt financing",
    "url": "https://www.reuters.com/business/finance/italys-bending-spoons-acquire-aol-secures-28-bln-debt-financing-2025-10-29/",
    "description": "Italian tech company Bending Spoons said on Wednesday it will acquire AOL from Yahoo, which is backed by Apollo Global Management , adding a storied internet brand to its growing portfolio of digital businesses.",
    "date": "2025-10-29T15:35:46.000Z"
  },
  {
    "title": "Supply of widebody aircraft \"extraordinarily acute\", Aercap CEO says",
    "url": "https://www.reuters.com/business/finance/supply-widebody-aircraft-extraordinarily-acute-aercap-ceo-says-2025-10-29/",
    "description": "The head of the world's largest aircraft leasing company, AerCap , said the supply of widebody jets is \"extraordinarily acute\" with Boeing and Airbus unlikely to surpass their previous production peak this decade.",
    "date": "2025-10-29T13:23:32.000Z"
  },
  {
    "title": "Morgan Stanley to buy private shares platform EquityZen",
    "url": "https://www.reuters.com/legal/transactional/morgan-stanley-buy-private-shares-platform-equityzen-2025-10-29/",
    "description": "Investment banking giant Morgan Stanley said on Wednesday it will buy private shares platform EquityZen, as Wall Street races to meet growing investor demand for stakes in fast-growing startups.",
    "date": "2025-10-29T17:36:14.000Z"
  },
  {
    "title": "Putin's envoy Dmitriev believes there may be peace in Ukraine within a year",
    "url": "https://www.reuters.com/business/finance/putins-envoy-dmitriev-says-there-will-be-peace-ukraine-within-one-year-2025-10-29/",
    "description": "Russian President Vladimir Putin's special envoy Kirill Dmitriev said on Wednesday during a visit to Saudi Arabia that he expected the war in Ukraine to end within a year.",
    "date": "2025-10-29T17:35:36.000Z"
  },
  {
    "title": "Microsoft CEO Satya Nadella to visit India in December, sources say",
    "url": "https://www.reuters.com/business/finance/microsoft-ceo-satya-nadella-visit-india-december-sources-say-2025-10-29/",
    "description": "Microsoft chief executive Satya Nadella is set to travel to India in December, his second visit to the South Asian country this year where he plans to hold meetings with top government officials, two sources with direct knowledge said.",
    "date": "2025-10-29T12:38:39.000Z"
  },
  {
    "title": "Market liquidity concerns cloud end of Fed's balance sheet drawdown",
    "url": "https://www.reuters.com/business/finance/market-liquidity-concerns-cloud-end-feds-balance-sheet-drawdown-2025-10-28/",
    "description": "As Wall Street's expectations have rapidly shifted toward an imminent end to the Federal Reserve's effort to shrink its bond holdings, some analysts also anticipate a return to balance sheet expansion in relatively short order.",
    "date": "2025-10-28T10:02:37.000Z"
  },
  {
    "title": "Deutsche Bank posts surprise rise in quarterly profit",
    "url": "https://www.reuters.com/business/finance/deutsche-bank-posts-surprise-rise-quarterly-profit-2025-10-29/",
    "description": "Deutsche Bank on Wednesday posted a 7% increase in third-quarter profit, defying expectations for a drop after its global investment banking division generated a chunky increase in revenue.",
    "date": "2025-10-29T06:45:43.000Z"
  },
  {
    "title": "Morning Bid: 48 hours to test the exuberance",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-10-29/",
    "description": "What matters in U.S. and global markets today",
    "date": "2025-10-29T11:32:42.000Z"
  },
  {
    "title": "US appeals court signals $16.1 billion award against Argentina may not stand",
    "url": "https://www.reuters.com/business/energy/argentina-ask-us-appeals-court-overturn-161-billion-ypf-judgment-2025-10-29/",
    "description": "A U.S. appeals court on Wednesday signaled a willingness to set aside a $16.1 billion judgment against Argentina for seizing control of state-owned oil company YPF in 2012, because the case didn't belong in the United States.",
    "date": "2025-10-29T20:02:32.000Z"
  },
  {
    "title": "Santander UK criticises motor finance scheme as it withholds third-quarter results",
    "url": "https://www.reuters.com/business/finance/santander-uk-withholds-third-quarter-results-amid-motor-finance-scrutiny-2025-10-29/",
    "description": "Santander UK criticised Britain's motor finance redress scheme and said on Wednesday it decided not to publish its third-quarter results as it seeks clarity on the financial regulator's proposals related to the mis-selling scandal.",
    "date": "2025-10-29T12:59:54.000Z"
  },
  {
    "title": "Santander beats third quarter forecasts on US growth",
    "url": "https://www.reuters.com/business/finance/santanders-q3-net-profit-rises-8-same-period-2024-2025-10-29/",
    "description": "Santander expects to meet its higher profit goals in 2025 after third quarter net profit beat forecasts thanks to lending growth in the U.S. and efficiency gains that offset weakness in Brazil.",
    "date": "2025-10-29T10:40:43.000Z"
  },
  {
    "title": "US consumer finance watchdog formally kills Biden-era bad actor registry",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-consumer-finance-watchdog-formally-kills-biden-era-bad-actor-registry-2025-10-28/",
    "description": "The top U.S. government watchdog for consumer finance has formally scrapped a registry for non-bank financial companies caught violating consumer laws, asserting that its costs outweighed any benefit to the public, according to a government notice issued Tuesday.",
    "date": "2025-10-28T15:22:31.000Z"
  },
  {
    "title": "Santander Bank Polska Q3 profit beats expectations",
    "url": "https://www.reuters.com/business/finance/santander-bank-polska-q3-profit-beats-expectations-2025-10-29/",
    "description": "Santander Bank Polska on Wednesday reported better-than-expected net profit in the third quarter, helped by growth in net interest income and net fee and commission income.",
    "date": "2025-10-29T06:59:56.000Z"
  },
  {
    "title": "JPMorgan shuffles executives to lead its $1.5 trillion initiative",
    "url": "https://www.reuters.com/business/finance/jpmorgan-shuffles-executives-lead-its-15-trillion-initiative-2025-10-28/",
    "description": "JPMorgan Chase has named long-time executive Jay Horine to oversee its $1.5 trillion investment fund focused on companies critical to U.S. national security, according to a memo seen by Reuters.",
    "date": "2025-10-28T16:54:42.000Z"
  },
  {
    "title": "Visa beats quarterly Street estimates on strong transaction volumes, cross-border growth slows",
    "url": "https://www.reuters.com/business/visa-quarterly-profit-rises-strong-transaction-volumes-2025-10-28/",
    "description": "Visa narrowly beat estimates for fourth-quarter profit on Tuesday and gave an upbeat forecast for its new fiscal year, as strong consumer spending in the U.S. drove card transaction volumes on the payments processing company's network.",
    "date": "2025-10-28T22:50:54.000Z"
  },
  {
    "title": "Private lending to big companies showing signs of froth, executives say",
    "url": "https://www.reuters.com/business/finance/private-lending-big-companies-showing-signs-froth-executives-say-2025-10-28/",
    "description": "Fears of a risky bubble emerging in the private credit market are overblown, but there are signs of lending standards weakening in the market for lending to large companies, executives from the industry said on Tuesday.",
    "date": "2025-10-28T14:34:42.000Z"
  },
  {
    "title": "Exonerated trader Tom Hayes sues UBS for $400 million over Libor accusations",
    "url": "https://www.reuters.com/legal/government/exonerated-trader-tom-hayes-sues-ubs-400-million-over-libor-accusations-2025-10-27/",
    "description": "Tom Hayes, the former trader who was a face of the global Libor-rigging scandal before his conviction was overturned in July, sued his former employer UBS for more than $400 million, saying the Swiss bank cast him as the \"evil mastermind\" of the scandal to shield itself.",
    "date": "2025-10-28T02:18:15.000Z"
  },
  {
    "title": "HSBC lifts income outlook, though Madoff lawsuit charges mar profit",
    "url": "https://www.reuters.com/business/finance/hsbc-third-quarter-profit-slides-14-hit-by-14-billion-litigation-charge-2025-10-28/",
    "description": "HSBC Holdings boosted its income outlook and vowed to shift into growth mode with its takeover of Hang Seng Bank in Hong Kong, despite a hefty drop in third-quarter profit due to $1.4 billion in legal charges.",
    "date": "2025-10-28T12:32:08.000Z"
  },
  {
    "title": "BofA makes executive changes in technology and telecom investment banking teams, memo shows",
    "url": "https://www.reuters.com/business/finance/bofa-makes-executive-changes-technology-telecom-investment-banking-teams-memo-2025-10-28/",
    "description": "Bank of America announced a host of executive changes to its global corporate and investment banking team, according to an internal memo seen by Reuters on Tuesday, as it divided leadership responsibilities for technology and telecom.",
    "date": "2025-10-28T20:27:43.000Z"
  },
  {
    "title": "PayPal flags smaller basket sizes, cautious shoppers amid macro uncertainty",
    "url": "https://www.reuters.com/business/finance/paypal-flags-smaller-basket-sizes-cautious-shoppers-amid-macro-uncertainty-2025-10-28/",
    "description": "PayPal saw a slowdown in payments activity in September that continued into October across both the U.S. and Europe, as consumers became more selective in their purchases, CFO Jamie Miller told analysts on a call.",
    "date": "2025-10-28T17:41:28.000Z"
  },
  {
    "title": "BNP Paribas CEO says EU likely to delay trading book capital rules",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/bnp-paribas-ceo-says-eu-likely-delay-trading-book-capital-rules-2025-10-28/",
    "description": "The European Union is likely to postpone new capital requirements for banks' trading operations for about three years, BNP Paribas Chief Executive Jean-Laurent Bonnafe told analysts on Tuesday.",
    "date": "2025-10-28T14:55:20.000Z"
  },
  {
    "title": "UK unlocks $8.6 bln in trade and investment deals with Saudi Arabia",
    "url": "https://www.reuters.com/business/finance/uk-unlocks-86-bln-trade-investment-deals-with-saudi-arabia-2025-10-28/",
    "description": "Britain said on Tuesday it had unlocked 6.4 billion pounds ($8.6 billion) in trade and investment agreements with Saudi Arabia, following finance minister Rachel Reeves' meetings in Riyadh aimed at deepening economic ties with Gulf nations.",
    "date": "2025-10-28T14:36:43.000Z"
  },
  {
    "title": "Generali, Natixis owner likely to drop asset management deal, sources say",
    "url": "https://www.reuters.com/business/finance/generali-natixis-owner-likely-drop-asset-management-deal-sources-say-2025-10-28/",
    "description": "Italy's biggest insurer Generali and French banking group BPCE are likely to abandon plans to merge their asset management businesses by letting a year-end deadline lapse without a binding agreement, three sources said.",
    "date": "2025-10-28T14:27:11.000Z"
  },
  {
    "title": "BNP Paribas open to partnership with UniCredit on asset management products, CEO says",
    "url": "https://www.reuters.com/business/finance/bnp-paribas-open-partnership-with-unicredit-asset-management-products-ceo-says-2025-10-28/",
    "description": "BNP Paribas would be open to developing an asset management partnership with Italy's UniCredit if the Italian lender ends its distribution agreement with Amundi in mid-2027, Chief Executive Jean-Laurent Bonnafe said on Tuesday.",
    "date": "2025-10-28T14:21:12.000Z"
  },
  {
    "title": "BNP says it would be open to UniCredit asset management deal as report casts doubt over Amundi",
    "url": "https://www.reuters.com/business/finance/unicredit-plans-pull-money-invested-through-amundi-bloomberg-reports-2025-10-28/",
    "description": "BNP Paribas on Tuesday said it would be open to an asset management partnership with UniCredit , amid reports the Italian bank was accelerating efforts to end its ties with French fund manager Amundi .",
    "date": "2025-10-28T18:09:14.000Z"
  },
  {
    "title": "Morning Bid: Gold sold, stocks stall",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-10-28/",
    "description": "What matters in U.S. and global markets today",
    "date": "2025-10-28T11:39:34.000Z"
  },
  {
    "title": "Italy working to avoid savings from flowing abroad, minister says",
    "url": "https://www.reuters.com/business/finance/italy-working-avoid-savings-flowing-abroad-minister-says-2025-10-28/",
    "description": "Italy is working on ways to involve pension funds and insurance companies into high-impact projects as part of efforts to prevent domestic savings from flowing abroad, Economy Minister Giancarlo Giorgetti said on Tuesday.",
    "date": "2025-10-28T11:34:17.000Z"
  },
  {
    "title": "European companies cut jobs in response to slowing economy",
    "url": "https://www.reuters.com/business/european-companies-cut-jobs-response-slowing-economy-2025-10-06/",
    "description": "Several European companies have frozen hiring or cut jobs this year, citing difficult economic conditions exacerbated by U.S. tariffs.",
    "date": "2025-10-28T10:55:25.000Z"
  },
  {
    "title": "Italy banks should set aside resources for unfavourable scenarios, central bank says",
    "url": "https://www.reuters.com/business/finance/italy-banks-should-set-aside-resources-unfavourable-scenarios-central-bank-says-2025-10-28/",
    "description": "Italian banks should use resources generated by the current favourable period to strengthen their capacity to cope with unfavourable scenarios, the country's central bank governor Fabio Panetta said on Tuesday.",
    "date": "2025-10-28T10:32:03.000Z"
  },
  {
    "title": "Russia's Sberbank says 2025 profit to surpass last year's",
    "url": "https://www.reuters.com/business/finance/russias-sberbank-says-2025-profit-surpass-last-years-2025-10-28/",
    "description": "Russia's dominant lender Sberbank said on Tuesday that it expected its 2025 profit to be higher than last year's earnings.",
    "date": "2025-10-28T11:26:43.000Z"
  },
  {
    "title": "British regulator eases short selling rules for hedge funds",
    "url": "https://www.reuters.com/business/finance/britains-fca-eases-short-selling-rules-hedge-funds-2025-10-28/",
    "description": "Britain's financial markets watchdog on Tuesday confirmed that it would stop publishing the identity of stock market short sellers, amid a wider push by UK regulators to cut red tape and make the country more competitive.",
    "date": "2025-10-28T12:36:47.000Z"
  },
  {
    "title": "Activist investors to juice bank M&A after HoldCo's Comerica campaign",
    "url": "https://www.reuters.com/sustainability/sustainable-finance-reporting/activist-investors-juice-bank-ma-after-holdcos-comerica-campaign-2025-10-28/",
    "description": "This month's $10.9 billion sale",
    "date": "2025-10-28T17:23:23.000Z"
  },
  {
    "title": "Trump's bypass move on Comey, James prosecutor could derail cases",
    "url": "https://www.reuters.com/legal/government/trumps-bypass-move-comey-james-prosecutor-could-derail-cases-2025-10-28/",
    "description": "Both Comey and James have argued that their criminal cases must be dismissed on the grounds that the prosecutor who brought them is not validly serving in her role as the interim Attorney for the Eastern District of Virginia.",
    "date": "2025-10-28T10:09:38.000Z"
  },
  {
    "title": "Euro zone banks tighten credit access on trade risks, ECB survey shows",
    "url": "https://www.reuters.com/business/finance/euro-zone-banks-tighten-credit-access-trade-risks-ecb-survey-shows-2025-10-28/",
    "description": "Euro zone banks unexpectedly tightened access to corporate credit in the third quarter, with German lenders leading the way on fears over the economic outlook and tariffs, the European Central Bank said based on a quarterly survey.",
    "date": "2025-10-28T09:05:03.000Z"
  },
  {
    "title": "US to continue dominating global investment flows, finance executives say",
    "url": "https://www.reuters.com/business/finance/us-continue-dominating-global-investment-flows-finance-executives-say-2025-10-28/",
    "description": "The United States will continue to draw the vast majority of investment flows and the risks of a slowdown in the world's largest economy are overblown, the heads of major financial firms said at a conference in Saudi Arabia on Tuesday.",
    "date": "2025-10-28T08:54:47.000Z"
  },
  {
    "title": "Major brokerages expect Fed to cut rates again in December",
    "url": "https://www.reuters.com/business/top-brokerages-eye-fed-rate-cut-ahead-key-policy-meeting-2025-09-30/",
    "description": "Major brokerages expect the U.S. Federal Reserve to deliver a single 25-basis-point interest rate cut at its final policy meeting in December.",
    "date": "2025-10-31T14:48:28.000Z"
  },
  {
    "title": "Spain's blue-chip IBEX finally tops 2007 record high",
    "url": "https://www.reuters.com/business/finance/spains-blue-chip-ibex-finally-tops-2007-record-high-2025-10-28/",
    "description": "Spain's blue-chip index IBEX 35 on Tuesday hit a new record high, surpassing its previous peak in November 2007, closing a year in which it has outperformed every major European equity market, driven by a strong economic environment.",
    "date": "2025-10-28T08:50:04.000Z"
  },
  {
    "title": "Barclays snaps up US loan firm Best Egg for $800 million",
    "url": "https://www.reuters.com/business/finance/barclays-buy-us-personal-loan-firm-best-egg-800-million-2025-10-28/",
    "description": "Barclays will buy U.S. personal loan originator Best Egg for $800 million, the British bank said on Tuesday, as it tries to add scale in its personal banking business in the United States.",
    "date": "2025-10-28T09:08:17.000Z"
  },
  {
    "title": "Russia's Sberbank reports third-quarter profits rise",
    "url": "https://www.reuters.com/business/finance/russias-sberbank-reports-third-quarter-profits-rise-2025-10-28/",
    "description": "Russia's dominant lender Sberbank reported on Tuesday an increase in net profit in the third quarter of 2025 to 448.3 billion roubles ($5.51 billion) from 411.1 billion in the same period last year.",
    "date": "2025-10-28T07:07:06.000Z"
  },
  {
    "title": "Betclic-owner Banijay buys Tipico stake from CVC in deal valuing betting firm at $5.4 billion",
    "url": "https://www.reuters.com/business/finance/banijay-buy-majority-stake-cvcs-betting-firm-tipico-2025-10-28/",
    "description": "French media group Banijay will buy a majority stake in betting firm Tipico from private equity group CVC , it said on Tuesday, in a move that will create one of Europe’s biggest online gaming operators.",
    "date": "2025-10-28T13:17:03.000Z"
  },
  {
    "title": "BNP hurt by rising bad loans as clients turn cautious",
    "url": "https://www.reuters.com/business/finance/bnp-paribas-misses-forecasts-axa-costs-bad-loans-weigh-2025-10-28/",
    "description": "BNP Paribas missed third-quarter profit forecasts on Tuesday as a cautious mood among major corporate clients and higher provisions for bad loans, including an undisclosed issue at its markets arm, weighed on results.",
    "date": "2025-10-28T08:55:25.000Z"
  },
  {
    "title": "Amundi records $17.6 billion in Q3 net inflows, aided by ETF demand",
    "url": "https://www.reuters.com/business/finance/amundi-records-176-billion-q3-net-inflows-aided-by-etf-demand-2025-10-28/",
    "description": "Amundi , Europe's biggest asset manager, reported slightly higher-than-expected net inflows in the third quarter on Tuesday, driven by continued growth in funds that track the market and demand from its Asian joint ventures.",
    "date": "2025-10-28T06:05:05.000Z"
  },
  {
    "title": "Citi to tie up with Coinbase to boost digital payments for institutional clients",
    "url": "https://www.reuters.com/business/finance/citi-tie-up-with-coinbase-boost-digital-payments-institutional-clients-2025-10-28/",
    "description": "Citigroup and cryptocurrency exchange Coinbase plan to collaborate on digital asset payment solutions for the U.S. bank's institutional clients, to expand the offering to global clients in the future.",
    "date": "2025-10-28T05:09:57.000Z"
  },
  {
    "title": "Commerzbank investigating ex-CEO's meeting with UniCredit chief, source says",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/commerzbank-supervisory-board-reviews-meeting-between-former-ceo-unicredit-chief-2025-10-27/",
    "description": "Commerzbank's supervisory board is investigating whether former CEO Manfred Knof violated his duties by meeting suitor UniCredit's CEO in September 2024 and not reporting it, a person with knowledge of the matter said on Monday.",
    "date": "2025-10-27T15:18:22.000Z"
  },
  {
    "title": "UBS applies for US banking licence in wealth management growth drive",
    "url": "https://www.reuters.com/business/finance/ubs-files-application-us-banking-licence-2025-10-27/",
    "description": "UBS has applied for a banking licence in the United States, the Swiss bank said on Monday, underlining its desire to ramp up wealth management in the world's biggest economy even as regulators at home seek to limit its ambitions abroad.",
    "date": "2025-10-27T16:41:26.000Z"
  },
  {
    "title": "World's first yen-pegged stablecoin debuts in Japan",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/worlds-first-yen-pegged-stablecoin-debuts-japan-2025-10-27/",
    "description": "The world's first stablecoin pegged to the yen launched in Japan on Monday, a small but significant move in a country where many consumers still prefer to use traditional payment means like cash and credit cards.",
    "date": "2025-10-27T06:15:38.000Z"
  },
  {
    "title": "HSBC to take $1.1 billion hit after Luxembourg court ruling in Madoff case",
    "url": "https://www.reuters.com/business/finance/hsbc-book-11-billion-provision-after-luxembourg-court-ruling-madoff-case-2025-10-26/",
    "description": "HSBC Holdings said on Monday it would book a $1.1 billion provision in its third-quarter results after losing part of an appeal in a long-running lawsuit tied to Bernard Madoff's Ponzi scheme, history's biggest ever such fraud.",
    "date": "2025-10-27T13:52:16.000Z"
  },
  {
    "title": "FirstSun to buy First Foundation in $785 million all-stock deal",
    "url": "https://www.reuters.com/legal/transactional/firstsun-buy-first-foundation-785-million-all-stock-deal-2025-10-27/",
    "description": "FirstSun Capital Bancorp will buy First Foundation in an all-stock deal valued at $785 million, the companies said on Monday, as mergers and acquisitions within regional banks accelerate amid credit concerns in the sector and macroeconomic uncertainties.",
    "date": "2025-10-27T21:57:48.000Z"
  },
  {
    "title": "Tunisia imposes one-month suspension on migrant-rights group",
    "url": "https://www.reuters.com/business/finance/tunisia-imposes-one-month-suspension-migrant-rights-group-2025-10-27/",
    "description": "Tunisia has ordered the Tunisian Forum for Economic and Social Rights (FTDES), a prominent civil rights and migrant advocacy organization, to suspend activities for a month, the group said on Monday, one of several associations under such orders.",
    "date": "2025-10-27T20:55:39.000Z"
  },
  {
    "title": "Canary Capital, Bitwise to launch first US altcoin ETFs despite shutdown",
    "url": "https://www.reuters.com/legal/transactional/canary-capital-plans-launch-first-us-litecoin-hedera-spot-etfs-tuesday-2025-10-27/",
    "description": "Canary Capital plans to launch the first U.S. exchange-traded products tied to the litecoin and hedera cryptocurrencies on Tuesday, the firm told Reuters, forging ahead despite a government shutdown that has hobbled the U.S. securities regulator.",
    "date": "2025-10-27T23:05:47.000Z"
  },
  {
    "title": "Deutsche Boerse posts stronger-than-expected 6% profit rise in Q3",
    "url": "https://www.reuters.com/business/finance/deutsche-boerse-posts-stronger-than-expected-6-profit-rise-q3-2025-10-27/",
    "description": "German exchange operator Deutsche Boerse on Monday posted a 6% rise in third-quarter net profit, better than analysts had expected, and said it was sticking to its forecasts for the year despite low stock market volatility and a weaker dollar.",
    "date": "2025-10-27T18:16:20.000Z"
  },
  {
    "title": "Italy's Numia appoints former SIA CEO Cordone as chairman",
    "url": "https://www.reuters.com/business/finance/italys-numia-appoints-former-sia-ceo-cordone-chairman-2025-10-27/",
    "description": "Numia, a payments firm backed by Italy's third-largest bank Banco BPM , said on Monday it had appointed Nicola Cordone as chairman.",
    "date": "2025-10-27T16:58:46.000Z"
  },
  {
    "title": "Blackstone hires former Apollo executive to lead European private equity",
    "url": "https://www.reuters.com/business/finance/blackstone-hires-former-apollo-executive-lead-european-private-equity-2025-10-27/",
    "description": "Blackstone has appointed a former executive at private markets peer Apollo to head its European corporate private equity business, filling the role after the incumbent was promoted, the world's biggest alternative asset manager said on Monday.",
    "date": "2025-10-27T16:21:36.000Z"
  },
  {
    "title": "Carbon Measures global accounting group to form independent panel",
    "url": "https://www.reuters.com/sustainability/cop/exxon-backed-carbon-accounting-group-appoint-independent-panel-ceo-says-2025-10-27/",
    "description": "Carbon Measures, a global carbon accounting initiative backed by several big energy and multinational companies, will form an independent panel to help guide its work, its CEO told Reuters.",
    "date": "2025-10-27T18:23:20.000Z"
  },
  {
    "title": "Explainer: What is changing in Italy's financial markets law?",
    "url": "https://www.reuters.com/business/finance/what-is-changing-italys-financial-markets-law-2025-10-27/",
    "description": "The Italian government has approved a major reform of its Testo Unico della Finanza (TUF), the body of laws regulating investment services, financial markets and listed companies, first introduced in 1998.",
    "date": "2025-10-27T14:41:03.000Z"
  },
  {
    "title": "Goldman in talks for $10 billion mandate from Kuwait, Bloomberg News reports",
    "url": "https://www.reuters.com/business/finance/goldman-talks-10-billion-mandate-kuwait-bloomberg-news-reports-2025-10-27/",
    "description": "Goldman Sachs is in talks to secure a $10 billion mandate from Kuwait's wealth fund for its asset-management arm, Bloomberg News reported on Monday.",
    "date": "2025-10-27T13:34:32.000Z"
  },
  {
    "title": "Morning Bid: Stocks zoom on trade and inflation relief",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-10-27/",
    "description": "What matters in U.S. and global markets today",
    "date": "2025-10-27T11:55:07.000Z"
  },
  {
    "title": "Buybacks take backseat as AI drives record US capex spending",
    "url": "https://www.reuters.com/business/finance/buybacks-take-backseat-ai-drives-record-us-capex-spending-2025-10-27/",
    "description": "Investors are increasingly favoring U.S. companies that channel capital toward AI innovation over those offering traditional shareholder payouts such as dividends and buybacks, even as the debate over soaring valuations and an AI bubble rages on.",
    "date": "2025-10-27T11:23:55.000Z"
  },
  {
    "title": "Annual 2026 gold price forecast tops $4,000/oz for first time",
    "url": "https://www.reuters.com/business/finance/annual-2026-gold-price-forecast-tops-4000oz-first-time-2025-10-27/",
    "description": "Gold's winning streak is seen extending into next year, with analysts forecasting an annual average price above $4,000 per ounce for the first time as economic and geopolitical turmoil keep the metal's safe-haven allure intact, a Reuters poll showed.",
    "date": "2025-10-27T11:16:11.000Z"
  },
  {
    "title": "JPMorgan picks Perpetua Resources for $1.5 trillion security fund's first investment",
    "url": "https://www.reuters.com/business/finance/jpmorgan-picks-perpetua-resources-15-trillion-security-funds-first-investment-2025-10-27/",
    "description": "Antimony and gold miner Perpetua Resources is the first investment from JPMorgan Chase's $1.5 trillion investment fund for U.S. national security, a move underscoring the company's key role in producing a metal whose exports China has blocked and which is used to make bullets and other weaponry.",
    "date": "2025-10-27T10:50:34.000Z"
  },
  {
    "title": "Countdown to Fed cut: Bond investors scale back on longer-dated Treasuries",
    "url": "https://www.reuters.com/business/finance/countdown-fed-cut-bond-investors-scale-back-longer-dated-treasuries-2025-10-27/",
    "description": "Bond investors are re-examining their holdings of longer-dated Treasuries, with some reducing positions and others even going short relative to their benchmark, as the Federal Reserve prepares to cut interest rates by another quarter percentage point on Wednesday.",
    "date": "2025-10-27T11:51:14.000Z"
  },
  {
    "title": "Euro zone business credit growth slows but household lending rises",
    "url": "https://www.reuters.com/business/finance/euro-zone-business-credit-growth-slows-household-lending-rises-2025-10-27/",
    "description": "Bank lending to euro zone firms edged down last month but remained near two-year highs, while credit to households expanded at its best pace since early 2023, the European Central Bank said on Monday.",
    "date": "2025-10-27T09:16:37.000Z"
  },
  {
    "title": "Australia sues Microsoft over AI-linked subscription price hikes",
    "url": "https://www.reuters.com/world/asia-pacific/australia-takes-microsoft-court-says-it-misled-27-million-customers-2025-10-26/",
    "description": "Australia's competition regulator on Monday sued Microsoft , accusing it of misleading millions of customers into paying higher prices for its Microsoft 365 software after bundling it with artificial intelligence tool Copilot.",
    "date": "2025-10-27T09:11:11.000Z"
  },
  {
    "title": "Dutch online bank Bunq gets US broker-dealer licence",
    "url": "https://www.reuters.com/business/finance/dutch-online-bank-bunq-gets-us-broker-dealer-licence-2025-10-27/",
    "description": "Dutch online bank Bunq said on Monday that it had received a licence to operate as a broker-dealer in the United States, part of a drive to expand outside of Europe.",
    "date": "2025-10-27T06:04:24.000Z"
  },
  {
    "title": "Novartis nears deal to acquire Avidity Biosciences for over $70 per share, Bloomberg News reports",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/novartis-nears-70-plus-per-share-deal-acquire-avidity-biosciences-bloomberg-news-2025-10-26/",
    "description": "Novartis AG is close to acquiring U.S. biotech Avidity Biosciences for more than $70 per share, Bloomberg News reported, citing a person familiar with the matter who said an announcement could come as early as Sunday.",
    "date": "2025-10-26T15:44:35.000Z"
  },
  {
    "title": "NatWest profit jumps as it upgrades 2025 guidance on loan growth",
    "url": "https://www.reuters.com/business/finance/natwests-q3-profit-rises-30-upgrades-guidance-2025-10-24/",
    "description": "NatWest reported a 30% rise in third-quarter profit on Friday and upgraded its performance target for 2025, as it grew loans and assets in its wealth business and avoided hefty charges for mis-selling car finance that hurt rivals.",
    "date": "2025-10-24T12:53:17.000Z"
  },
  {
    "title": "US could hit Russia with more sanctions over Ukraine war, but also wants Europe to increase pressure",
    "url": "https://www.reuters.com/business/finance/us-could-hit-russia-with-more-sanctions-end-ukraine-war-first-wants-europe-2025-10-25/",
    "description": "U.S. officials also told European counterparts that they support the EU using frozen Russian assets to buy U.S. weapons for Kyiv.",
    "date": "2025-10-25T19:47:05.000Z"
  },
  {
    "title": "UK to cut tax-free cash savings allowance in November budget, Telegraph says",
    "url": "https://www.reuters.com/business/finance/uk-cut-tax-free-cash-savings-allowance-november-budget-telegraph-says-2025-10-25/",
    "description": "Britain's government is likely to halve the amount of cash that people can put in tax-free savings accounts at next month's budget, the Telegraph newspaper reported on Saturday, citing a government minister who said tax incentives needed rebalancing.",
    "date": "2025-10-25T09:51:26.000Z"
  },
  {
    "title": "Fed lays out proposed changes bank stress tests",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/fed-lays-out-proposed-changes-bank-stress-tests-2025-10-24/",
    "description": "The U.S. Federal Reserve unveiled plans Friday to make its models and scenarios for subjecting large banks to annual \"stress tests\" publicly available and responsive to feedback, a major shift in its efforts to make the tests more transparent.",
    "date": "2025-10-24T17:59:35.000Z"
  },
  {
    "title": "EU commissioner laments obstacles to European bank mergers",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/eu-commissioner-asked-about-unicredit-commerzbank-laments-obstacles-european-2025-10-24/",
    "description": "The EU Commissioner for Financial Services, when asked on Friday about German resistance to UniCredit's attempts to take over Commerzbank , lamented obstacles to the creation of larger European banks.",
    "date": "2025-10-24T17:33:28.000Z"
  },
  {
    "title": "JPMorgan names BofA veteran chair of investment banking and M&A, memo shows",
    "url": "https://www.reuters.com/business/finance/jpmorgan-names-bofa-veteran-chair-investment-banking-ma-memo-shows-2025-10-24/",
    "description": "JPMorgan Chase has appointed Bank of America executive Kevin Brunner as the global chair of investment banking and M&A, according to an internal memo seen by Reuters on Friday.",
    "date": "2025-10-24T14:48:13.000Z"
  },
  {
    "title": "JPMorgan poaches investment bankers from Goldman, Deutsche in expansion of business services group",
    "url": "https://www.reuters.com/business/finance/jpmorgan-poaches-investment-bankers-goldman-deutsche-expansion-business-services-2025-10-24/",
    "description": "JPMorgan Chase & Co has poached three senior investment bankers from Deutsche Bank and Goldman Sachs to expand the team that caters to the business services sector - and isn’t done yet - in a push to dramatically increase fee revenue, a top banker told Reuters.",
    "date": "2025-10-24T15:02:34.000Z"
  },
  {
    "title": "Novo Nordisk's new chairman has 'carte blanche' after board clear-out",
    "url": "https://www.reuters.com/sustainability/sustainable-finance-reporting/novo-nordisks-new-chairman-has-carte-blanche-after-board-clear-out-2025-10-24/",
    "description": "A boardroom shake-up at Novo Nordisk has handed unprecedented power to its top shareholder, the Novo Nordisk Foundation, rattling investors despite calls for stronger leadership at the drugmaker behind weight-loss treatment Wegovy.",
    "date": "2025-10-24T15:55:38.000Z"
  },
  {
    "title": "Russian central bank cuts key rate by 'symbolic' 50 bps after new US oil sanctions",
    "url": "https://www.reuters.com/business/finance/russian-central-bank-cuts-key-rate-by-50-bps-after-new-us-oil-sanctions-2025-10-24/",
    "description": "The Russian central bank cut its interest rate by 50 basis points to 16.5% at a board meeting on Friday, its first since the government proposed raising VAT in 2026 and U.S. President Donald Trump imposed sanctions on Russian oil companies.",
    "date": "2025-10-24T13:22:46.000Z"
  },
  {
    "title": "Russia's Nabiullina and her deputy on future rate decisions, oil prices, impact of sanctions",
    "url": "https://www.reuters.com/business/finance/russias-nabiullina-future-rate-decisions-2025-10-24/",
    "description": "Russian Central Bank Governor Elvira Nabiullina and her deputy Alexei Zabotkin addressed a news conference on Friday after the central bank cut its interest rate by 50 basis points to 16.5%.",
    "date": "2025-10-24T13:24:54.000Z"
  },
  {
    "title": "UK tax options for finance minister Reeves in November budget",
    "url": "https://www.reuters.com/business/finance/uk-tax-options-finance-minister-reeves-november-budget-2025-10-24/",
    "description": "British finance minister Rachel Reeves is expected to raise tens of billions of pounds in taxes in her budget on November 26 to stay on track to meet her fiscal targets and avoid a loss of confidence in the bond market.",
    "date": "2025-10-24T12:06:39.000Z"
  },
  {
    "title": "FTSE 100 closes at record high, boosted by financials",
    "url": "https://www.reuters.com/business/finance/london-shares-pause-after-recent-gains-focus-shifts-us-data-2025-10-24/",
    "description": "Britain's FTSE 100 closed at a record high on Friday, capping a strong week for London equities, as financial stocks gained following upbeat results from NatWest and signs of cooling inflation pressures in the United States.",
    "date": "2025-10-24T16:26:30.000Z"
  },
  {
    "title": "Australia's Westpac unit fined $13 million for home loans misconduct",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/australias-westpac-unit-fined-13-million-home-loans-misconduct-2025-10-24/",
    "description": "Australia's Federal Court imposed a A$20 million ($13 million) penalty on a Westpac unit over widespread financial misconduct in arranging home loans, including using falsified payslips, the country's corporate regulator said on Friday.",
    "date": "2025-10-24T10:45:32.000Z"
  },
  {
    "title": "Morning Bid: Tariff Man turns terminator",
    "url": "https://www.reuters.com/business/finance/global-markets-view-usa-2025-10-24/",
    "description": "Everything Mike Dolan and the ROI team are excited to read, watch and listen to over the weekend.",
    "date": "2025-10-24T10:33:43.000Z"
  },
  {
    "title": "NY Attorney General Letitia James, a Trump adversary, pleads not guilty to mortgage-related charges",
    "url": "https://www.reuters.com/legal/government/ny-attorney-general-letitia-james-trump-adversary-plead-not-guilty-mortgage-2025-10-24/",
    "description": "New York Attorney General Letitia James, a longtime critic of President Donald Trump, pleaded not guilty in federal court on Friday to charges related to allegedly lying on mortgage documents.",
    "date": "2025-10-24T19:16:01.000Z"
  },
  {
    "title": "Fed hands banks a win with vote to advance 'stress test' overhaul",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/fed-hand-banks-win-with-proposed-stress-test-overhaul-2025-10-24/",
    "description": "Banks complain that the Fed's exercise is opaque and onerous.",
    "date": "2025-10-24T20:06:40.000Z"
  },
  {
    "title": "HEDGE FLOW Hedge funds boost AI tech bets to highest since 2016, Goldman Sachs says",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/hedge-flow-hedge-funds-boost-ai-tech-bets-highest-since-2016-goldman-sachs-says-2025-10-24/",
    "description": "Hedge funds' exposure to artificial intelligence-related tech hardware reached its highest in October since Goldman Sachs started tracking the data in 2016, the U.S. bank said in a client note.",
    "date": "2025-10-24T09:14:09.000Z"
  },
  {
    "title": "Top HSBC wealth executive Trista Sun to leave bank, memo says",
    "url": "https://www.reuters.com/world/asia-pacific/top-hsbc-wealth-executive-trista-sun-leave-bank-memo-says-2025-10-24/",
    "description": "Trista Sun, one of HSBC's top wealth executives, will leave the bank, following a large scale-down of a China project she oversaw.",
    "date": "2025-10-24T04:50:48.000Z"
  },
  {
    "title": "Blackstone to invest $705 million in India's Federal Bank to become largest shareholder",
    "url": "https://www.reuters.com/world/india/blackstone-affiliate-buys-999-stake-indias-federal-bank-2025-10-24/",
    "description": "Blackstone will invest about $705 million in India's Federal Bank for a 9.9% stake, the private lender said on Friday, adding to the growing list of large deals by marquee investors.",
    "date": "2025-10-24T06:19:45.000Z"
  },
  {
    "title": "ANZ's former CEO says bank was justified in sacking trader",
    "url": "https://www.reuters.com/business/finance/anzs-former-ceo-says-bank-was-justified-sacking-trader-2025-10-24/",
    "description": "Former Australia and New Zealand Banking Group Chief Executive Shayne Elliott said on Friday the bank was justified in sacking a former trader accused of breaking ANZ's code of conduct by sending inappropriate messages at work.",
    "date": "2025-10-24T19:53:07.000Z"
  },
  {
    "title": "UBS promotes Beatriz Martin to Chief Operating Officer amid board changes",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/ubs-vice-chair-gaehwiler-step-down-board-directors-2026-2025-10-24/",
    "description": "Switzerland's UBS on Friday promoted Beatriz Martin to Chief Operating Officer as it announced management changes that included the nomination of UBS veteran Markus Ronner as vice chairman of the bank's board of directors next year.",
    "date": "2025-10-24T07:49:02.000Z"
  },
  {
    "title": "Argentina President Milei to meet JPMorgan CEO Dimon this week",
    "url": "https://www.reuters.com/business/finance/argentina-president-milei-meet-jpmorgan-ceo-dimon-this-week-2025-10-23/",
    "description": "Argentine President Javier Milei will meet with JPMorgan Chase CEO Jamie Dimon in Buenos Aires this week, according to three sources familiar with the matter.",
    "date": "2025-10-23T18:27:08.000Z"
  },
  {
    "title": "LSEG shares soar on trade services stake sale, stock buyback",
    "url": "https://www.reuters.com/business/lseg-unveils-swapclear-deal-share-buyback-after-strong-quarterly-results-2025-10-23/",
    "description": "London Stock Exchange Group said on Thursday it would sell 20% of its post-trade services business and surprised investors with a 1 billion pound ($1.34 billion) buyback as it also hinted at a deeper push into private markets data.",
    "date": "2025-10-23T13:55:36.000Z"
  },
  {
    "title": "UK budget fears clouding L&G shares, says CEO",
    "url": "https://www.reuters.com/business/finance/uk-budget-fears-clouding-lg-shares-says-ceo-2025-10-23/",
    "description": "Britain must not deter pension savers with tax changes in next month's budget, Legal & General CEO Antonio Simoes told Reuters, adding that uncertainty was souring investment as the UK's biggest investor battles to sell its own strategy.",
    "date": "2025-10-23T15:07:16.000Z"
  },
  {
    "title": "NY Attorney General James to challenge US Attorney Halligan's appointment",
    "url": "https://www.reuters.com/world/ny-attorney-general-james-seek-dismissal-indictment-by-challenging-us-attorney-2025-10-23/",
    "description": "New York Attorney General Letitia James on Thursday said her legal team plans to ask a federal judge to dismiss the criminal charges against her on the grounds that the U.S. Attorney in Eastern Virginia who obtained the indictment was unlawfully appointed, according to a court filing.",
    "date": "2025-10-24T13:48:07.000Z"
  },
  {
    "title": "Ringleader behind 'Russian-inspired' UK arson discussed kidnapping Revolut founder, court told",
    "url": "https://www.reuters.com/business/finance/ringleader-behind-russian-inspired-uk-arson-discussed-kidnapping-revolut-founder-2025-10-23/",
    "description": "The ringleader of an arson attack on Ukraine-linked businesses in London last year discussed kidnapping the co-founder of finance app Revolut and torching a warehouse in the Czech Republic with his Russian handler, a British court heard on Thursday.",
    "date": "2025-10-23T16:10:17.000Z"
  },
  {
    "title": "Some UK bond market players look under-prepared for crisis, BoE policymaker warns",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/some-uk-bond-market-players-look-under-prepared-crisis-boe-policymaker-warns-2025-10-23/",
    "description": "Some businesses that operate in the British government bond market have made only limited preparations for a future crisis, potentially increasing the need for a bailout, Bank of England policymaker Jonathan Hall warned on Thursday.",
    "date": "2025-10-23T15:23:50.000Z"
  },
  {
    "title": "Berlin seeks to shield Rosneft's German arm from US sanctions, says source",
    "url": "https://www.reuters.com/business/energy/german-ministry-assumes-us-sanctions-do-not-target-rosnefts-german-subsidiaries-2025-10-23/",
    "description": "Germany is seeking an exemption from U.S. sanctions on Russian oil company Rosneft's German business, a person with direct knowledge of the government discussions said on Thursday, after banks said sanctions could stop them dealing with the local energy supplier.",
    "date": "2025-10-23T13:57:21.000Z"
  },
  {
    "title": "Explainer: How will the West use Russia's frozen assets?",
    "url": "https://www.reuters.com/business/finance/how-will-west-use-russias-frozen-assets-2025-10-02/",
    "description": "The European Union is searching for a way to finance Ukraine's defence and reconstruction in 2026 and 2027 with Russian central bank assets immobilised in the West after Moscow's invasion.",
    "date": "2025-10-23T15:48:52.000Z"
  },
  {
    "title": "Hedge funds now manage record of almost $5 trillion, says HFR",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/hedge-funds-now-manage-record-almost-5-trillion-says-hfr-2025-10-23/",
    "description": "Global hedge fund capital rose to a record of almost $5 trillion in the third quarter and the number of hedge funds is at a decade peak, reflecting an influx of new money into the sector, a report by Hedge Fund Research (HFR) showed on Thursday.",
    "date": "2025-10-23T17:00:23.000Z"
  },
  {
    "title": "JP Morgan sees gold prices averaging $5,055 per ounce by late 2026",
    "url": "https://www.reuters.com/business/jp-morgan-sees-gold-averaging-5055oz-by-late-2026-2025-10-23/",
    "description": "JP Morgan analysts on Thursday maintained a bullish outlook on gold, forecasting prices could reach an average of $5,055 per ounce by the fourth quarter of 2026.",
    "date": "2025-10-23T15:53:19.000Z"
  },
  {
    "title": "HSBC to review Egypt retail business in global restructuring",
    "url": "https://www.reuters.com/business/finance/hsbc-review-egypt-retail-business-global-restructuring-2025-10-23/",
    "description": "HSBC , said on Thursday it will conduct a strategic review of its Egyptian retail banking business as part of the wider restructuring of its global operations.",
    "date": "2025-10-23T12:31:58.000Z"
  },
  {
    "title": "Unilever CEO says US government shutdown has not dented consumer sentiment",
    "url": "https://www.reuters.com/business/finance/unilever-ceo-says-us-government-shutdown-has-not-dented-consumer-sentiment-2025-10-23/",
    "description": "Unilever has not seen a significant impact on consumer sentiment so far from the government shutdown in its key U.S. market, the CEO of the consumer goods company said on Thursday.",
    "date": "2025-10-23T11:42:17.000Z"
  }
]