[
  {
    "title": "Federal shutdown threatens these Trump voters’ livelihoods but not their political loyalties",
    "url": "https://www.reuters.com/world/us/federal-shutdown-threatens-these-trump-voters-livelihoods-not-their-political-2025-11-08/",
    "description": "Both Democrats and Republicans fear the political fallout from the shutdown.",
    "date": "2025-11-08T19:31:45.000Z"
  },
  {
    "title": "US Supreme Court lets Trump withhold $4 billion in food aid funding for now",
    "url": "https://www.reuters.com/world/us/usda-says-it-is-working-comply-with-court-order-pay-food-aid-benefits-2025-11-07/",
    "description": null,
    "date": "2025-11-08T15:29:46.000Z"
  },
  {
    "title": "FAA bars MD-11 flights after fiery UPS jet crash",
    "url": "https://www.reuters.com/world/us/faa-issues-order-prohibiting-md-11-flights-pending-inspection-after-fiery-ups-2025-11-08/",
    "description": null,
    "date": "2025-11-09T04:16:27.000Z"
  },
  {
    "title": "Shots fired in Chicago at immigration officers, Trump administration says",
    "url": "https://www.reuters.com/world/us/shots-fired-chicago-immigration-officers-trump-administration-says-2025-11-08/",
    "description": null,
    "date": "2025-11-08T22:25:40.000Z"
  },
  {
    "title": "UPS, FedEx ground MD-11 fleets after deadly Louisville crash",
    "url": "https://www.reuters.com/business/aerospace-defense/ups-grounds-its-md-11-fleet-after-louisville-crash-2025-11-08/",
    "description": "UPS and FedEx said on Friday they have grounded their combined fleet of more than 50 McDonnell Douglas MD-11 cargo planes following a crash in Louisville, Kentucky this week that killed at least 14 people.",
    "date": "2025-11-08T17:14:27.000Z"
  },
  {
    "title": "Cornell University research funds to be restored in deal with Trump administration",
    "url": "https://www.reuters.com/world/us/cornell-reaches-deal-with-trump-administration-restore-research-funds-nyt-2025-11-07/",
    "description": "Cornell University's $250 million in federal grants were restored under a deal with U.S. President Donald Trump's administration announced on Friday, the fifth such agreement to be struck amid a conservative crackdown on institutions.",
    "date": "2025-11-07T23:56:53.000Z"
  },
  {
    "title": "Police say cleaning woman shot dead in Indiana after arriving at wrong house",
    "url": "https://www.reuters.com/world/us/police-say-cleaning-woman-shot-dead-indiana-after-arriving-wrong-house-2025-11-08/",
    "description": "Detectives in Indiana have completed their initial investigation into the killing of a cleaning woman who mistakenly arrived at the wrong address and was shot through the door by a resident who feared an intruder was outside, police said on Friday.",
    "date": "2025-11-08T03:09:45.000Z"
  },
  {
    "title": "US Justice Department probes meatpackers, attorney general says",
    "url": "https://www.reuters.com/world/us/trump-says-he-asked-doj-investigate-meat-packing-companies-driving-up-beef-2025-11-07/",
    "description": "President Donald Trump on Friday accused meatpacking companies of driving up U.S. beef prices, which have hit records, through manipulation and collusion, and ordered the Justice Department to investigate.",
    "date": "2025-11-08T02:07:45.000Z"
  },
  {
    "title": "Crew of fatal UPS cargo flight tried to control aircraft before crash, NTSB says",
    "url": "https://www.reuters.com/business/aerospace-defense/crew-fatal-ups-cargo-flight-tried-control-aircraft-before-crash-ntsb-says-2025-11-07/",
    "description": "As a bell sounded in the cockpit, three UPS pilots tried to control a cargo flight that crashed this week in Louisville, Kentucky, killing at least 13 people, the National Transportation Safety Board said on Friday.",
    "date": "2025-11-08T03:52:06.000Z"
  },
  {
    "title": "US judge bars Education Department emails blaming shutdown on Democrats",
    "url": "https://www.reuters.com/legal/government/us-judge-bars-education-department-emails-blaming-shutdown-democrats-2025-11-07/",
    "description": "A federal judge ruled on Friday that President Donald Trump's administration violated the free-speech rights of furloughed U.S. Department of Education employees by altering their out-of-office email messages to blame \"Democrat Senators\" for the ongoing government shutdown.",
    "date": "2025-11-07T22:08:40.000Z"
  },
  {
    "title": "Mistrial declared for MIT-educated brothers accused of $25 million cryptocurrency heist",
    "url": "https://www.reuters.com/legal/government/mistrial-declared-mit-educated-brothers-accused-25-million-cryptocurrency-heist-2025-11-08/",
    "description": "A federal judge on Friday declared a mistrial in the case of two Massachusetts Institute of Technology-educated brothers charged with carrying out a novel scheme to steal $25 million worth of cryptocurrency in 12 seconds that prosecutors said exploited the Ethereum blockchain's integrity.",
    "date": "2025-11-08T01:37:20.000Z"
  },
  {
    "title": "First blast of winter weather forecast from Great Lakes to South Florida",
    "url": "https://www.reuters.com/business/environment/first-blast-winter-weather-forecast-great-lakes-south-florida-2025-11-07/",
    "description": "An early taste of winter is expected for the eastern half of the U.S. beginning this weekend, as a fast-moving storm system sweeping down from Canada clears a path for frigid temperatures as far south as Florida, forecasters said.",
    "date": "2025-11-07T18:46:43.000Z"
  },
  {
    "title": "Trump pardons former baseball star Darryl Strawberry, alum of 'Celebrity Apprentice'",
    "url": "https://www.reuters.com/world/us/trump-pardons-former-baseball-star-darryl-strawberry-alum-celebrity-apprentice-2025-11-08/",
    "description": "President Donald Trump has pardoned New York baseball legend and former \"Celebrity Apprentice\" cast member Darryl Strawberry, who was convicted of tax evasion and was among several people pardoned this week.",
    "date": "2025-11-08T00:56:58.000Z"
  },
  {
    "title": "Exclusive: US Army to buy 1 million drones, in major acquisition ramp-up",
    "url": "https://www.reuters.com/business/aerospace-defense/us-army-buy-1-million-drones-major-acquisition-ramp-up-2025-11-07/",
    "description": "The U.S. Army aims to buy at least a million drones in the next two to three years and could acquire anywhere from a half million drones to millions of them annually in the years that follow, U.S. Army Secretary Daniel Driscoll said.",
    "date": "2025-11-07T17:04:33.000Z"
  },
  {
    "title": "US FCC chair to testify before Senate after Kimmel episode",
    "url": "https://www.reuters.com/business/media-telecom/us-fcc-chair-testify-before-senate-after-kimmel-episode-2025-11-07/",
    "description": "U.S. Federal Communications Commission Chairman Brendan Carr will testify on December 17 before the Senate Commerce Committee after he faced bipartisan criticism for pressuring broadcasters to take ABC late-night talk show host Jimmy Kimmel off air.",
    "date": "2025-11-08T00:45:16.000Z"
  },
  {
    "title": "Former CIA boss, ex-FBI officials subpoenaed in DOJ probe, Fox News Digital reports",
    "url": "https://www.reuters.com/world/former-cia-boss-ex-fbi-officials-subpoenaed-doj-probe-fox-news-digital-reports-2025-11-07/",
    "description": "Former CIA Director John Brennan and ex-FBI officials Peter Strzok and Lisa Page have been subpoenaed by a federal grand jury as part of the U.S. Justice Department's probe into the origins of the Trump-Russia investigation, Fox News Digital reported on Friday.",
    "date": "2025-11-07T23:44:16.000Z"
  },
  {
    "title": "Republican bill to pay workers in shutdown falling short in US Senate; voting continues",
    "url": "https://www.reuters.com/world/us/republican-bill-pay-workers-shutdown-falling-short-us-senate-voting-continues-2025-11-07/",
    "description": "A Republican bill in the U.S. Senate to pay federal government workers and military servicemembers during the ongoing government shutdown was falling short on Friday of the votes needed to advance, as voting continued.",
    "date": "2025-11-07T23:21:23.000Z"
  },
  {
    "title": "NY Attorney General James claims DOJ charges are retaliation for Trump lawsuit",
    "url": "https://www.reuters.com/legal/government/ny-attorney-general-james-claims-doj-charges-are-retaliation-trump-lawsuit-2025-11-07/",
    "description": "New York Attorney General Letitia James on Friday asked a federal judge to throw out a federal criminal case against her, arguing it was retaliation by President Donald Trump for her office’s civil fraud lawsuit against him and his family business.",
    "date": "2025-11-07T23:52:51.000Z"
  },
  {
    "title": "Suburban Chicago moms arrested in protest outside immigration detention facility",
    "url": "https://www.reuters.com/world/us/suburban-chicago-moms-arrested-protest-outside-immigration-detention-facility-2025-11-07/",
    "description": "More than a dozen suburban Chicago mothers were arrested outside an immigration detention facility in Broadview, Illinois, on Friday, according to the Cook County Sheriff's Office, in a protest against the ongoing immigration crackdown in the area launched by U.S. President Donald Trump.",
    "date": "2025-11-07T23:09:57.000Z"
  },
  {
    "title": "Democrats' electoral sweep tests Trump’s anti-DEI and immigration agenda",
    "url": "https://www.reuters.com/world/us/democrats-electoral-sweep-tests-trumps-anti-dei-immigration-agenda-2025-11-07/",
    "description": "While the winners focused their campaign around cost of living issues, they also embraced the core tenets of DEI and wove them into their platforms.",
    "date": "2025-11-07T11:29:41.000Z"
  },
  {
    "title": "Trump administration seeks to block food aid funding order",
    "url": "https://www.reuters.com/legal/government/trump-administration-seeks-block-food-aid-funding-order-2025-11-07/",
    "description": "The Trump administration asked a federal appeals court to block a judge's order that the U.S. Department of Agriculture provide full November food stamp benefits to 42 million low-income Americans.",
    "date": "2025-11-07T16:19:30.000Z"
  },
  {
    "title": "US Congressional Budget Office hit by cybersecurity incident",
    "url": "https://www.reuters.com/world/us/us-congressional-budget-office-hacked-by-suspected-foreign-actor-washington-post-2025-11-06/",
    "description": "The U.S. Congressional Budget Office said on Thursday it had identified a security incident and acted to contain the breach at the non-partisan agency that provides key financial research data to lawmakers.",
    "date": "2025-11-07T15:38:39.000Z"
  },
  {
    "title": "Impact of US government shutdown far worse than expected, White House adviser says",
    "url": "https://www.reuters.com/business/retail-consumer/impact-us-government-shutdown-far-worse-than-expected-white-house-adviser-says-2025-11-07/",
    "description": "The economic impact of the U.S. government shutdown is far worse than expected, but the U.S. economy is likely to rebound quickly once it ends, White House economic adviser Kevin Hassett said on Friday.",
    "date": "2025-11-07T14:06:33.000Z"
  },
  {
    "title": "US employment report will not be published again as government shutdown drags on",
    "url": "https://www.reuters.com/business/finance/us-employment-report-will-not-be-published-again-government-shutdown-drags-2025-11-07/",
    "description": "The U.S. Labor Department on Friday will not publish its closely watched employment report for an unprecedented second straight month as the government remains shut, and fears are mounting October's report might not be released when full operations resume.",
    "date": "2025-11-07T15:15:54.000Z"
  },
  {
    "title": "Kendrick Lamar, Lady Gaga lead 2026 Grammy nominations",
    "url": "https://www.reuters.com/business/media-telecom/kendrick-lamar-lady-gaga-lead-2026-grammy-nominations-2025-11-07/",
    "description": "Rapper Kendrick Lamar topped the list of Grammy contenders for the second straight year on Friday with nine nominations, outpacing the seven nods for pop superstar Lady Gaga in the race for the music industry's top honors.",
    "date": "2025-11-07T21:48:24.000Z"
  },
  {
    "title": "James Watson, co-discoverer of DNA's double helix, dead at 97",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/james-watson-co-discoverer-dnas-double-helix-dead-97-2025-11-07/",
    "description": "James D. Watson, the brilliant but controversial American biologist whose 1953 discovery of the structure of DNA, the molecule of heredity, ushered in the age of genetics and provided the foundation for the biotechnology revolution of the late 20th century, has died at the age of 97.",
    "date": "2025-11-07T19:57:25.000Z"
  },
  {
    "title": "Exclusive: US intel found Israeli military lawyers warned there was evidence of Gaza war crimes, former US officials say",
    "url": "https://www.reuters.com/world/us/us-intel-found-israeli-military-lawyers-warned-there-was-evidence-gaza-war-2025-11-07/",
    "description": "The previously unreported intelligence pointed to doubts within the Israeli military about the legality of its tactics that contrasted sharply with Israel’s public stance defending its actions.",
    "date": "2025-11-07T17:46:29.000Z"
  },
  {
    "title": "Pope Leo's critique of Trump emboldens top US Catholics to help immigrants",
    "url": "https://www.reuters.com/world/europe/pope-leos-critique-trump-emboldens-top-us-catholics-help-immigrants-2025-11-07/",
    "description": "Pope Leo's recent criticisms of U.S. President Donald Trump's anti-immigration policies are emboldening Catholic efforts to help immigrants caught up in the administration's hardline crackdown, senior U.S. Church leaders say.",
    "date": "2025-11-07T10:21:40.000Z"
  },
  {
    "title": "US government shutdown drags on as senators fail to find path out",
    "url": "https://www.reuters.com/world/us/senate-democrats-consider-republican-offer-record-us-shutdown-drags-2025-11-06/",
    "description": "U.S. Senate Democrats continued to hold out on agreeing to end the record-long federal government shutdown on Thursday, despite Republican overtures to reverse federal employee layoffs as part of a bid to reopen shuttered agencies.",
    "date": "2025-11-06T23:13:48.000Z"
  },
  {
    "title": "US delays flights at 8 airports due to short staffing of air traffic controllers",
    "url": "https://www.reuters.com/world/us/us-delays-flights-8-airports-due-short-staffing-air-traffic-controllers-2025-11-07/",
    "description": "The U.S. Federal Aviation Administration said on Friday it was delaying flights at eight airports including in Atlanta, San Francisco, Houston, Washington and Newark, citing widespread air traffic staffing issues as controllers have not been paid during the government shutdown.",
    "date": "2025-11-07T18:45:54.000Z"
  },
  {
    "title": "Several people ill at US military base in Maryland after suspicious package",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/several-people-ill-us-military-base-maryland-after-suspicious-package-2025-11-07/",
    "description": "Several people fell ill after a suspicious package was opened at a U.S. military base in Maryland, though they were evaluated and released, the U.S. military said on Friday.",
    "date": "2025-11-07T17:14:28.000Z"
  },
  {
    "title": "Trump finalizes US Gulf oil lease sale, proposes Alaska sale in 2026",
    "url": "https://www.reuters.com/business/energy/trump-finalizes-us-gulf-oil-lease-sale-proposes-alaska-sale-2026-2025-11-07/",
    "description": "The Trump administration will hold an auction for drilling oil and gas off the U.S. Gulf next month and has proposed another in a waterway in southern Alaska, it said on Friday.",
    "date": "2025-11-07T21:49:01.000Z"
  },
  {
    "title": "US EPA approves 14 small refinery biofuel waivers",
    "url": "https://www.reuters.com/sustainability/climate-energy/us-epa-decide-16-small-refinery-biofuel-waivers-friday-2025-11-07/",
    "description": "The Environmental Protection Agency said on Friday it approved 14 requests from small refineries for full or partial exemptions to the nation's biofuel blending mandates, drawing criticism from a top U.S. biofuel trade group.",
    "date": "2025-11-07T17:03:58.000Z"
  },
  {
    "title": "Elise Stefanik, staunch Trump ally, launches bid for New York governor",
    "url": "https://www.reuters.com/world/us/elise-stefanik-staunch-trump-ally-launches-bid-new-york-governor-2025-11-07/",
    "description": "Republican U.S. Representative Elise Stefanik, a staunch ally of President Donald Trump, will run for governor of New York in 2026, taking on incumbent Democrat Kathy Hochul.",
    "date": "2025-11-07T15:19:11.000Z"
  },
  {
    "title": "Trump administration must fully fund food aid benefits by Friday, US judge rules",
    "url": "https://www.reuters.com/legal/government/trump-administration-must-fully-fund-food-aid-benefits-by-friday-us-judge-rules-2025-11-06/",
    "description": "The federal judge ruling blocked the administration's plan to only provide reduced benefits during the government shutdown.",
    "date": "2025-11-07T08:45:38.000Z"
  },
  {
    "title": "Price cuts help more Americans start weight-loss drugs but maybe not stay on them",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/price-cuts-help-more-americans-start-weight-loss-drugs-maybe-not-stay-them-2025-11-07/",
    "description": "A Trump administration deal to cut prices for popular weight-loss drugs like Wegovy and Zepbound will allow millions more Americans to give them a try, but the cost may still be too high to keep patients long term, U.S. obesity specialists said.",
    "date": "2025-11-07T12:02:26.000Z"
  },
  {
    "title": "Nancy Pelosi, first woman to serve as US House speaker, to retire from Congress",
    "url": "https://www.reuters.com/world/us/nancy-pelosi-first-woman-serve-us-house-speaker-retire-congress-2025-11-06/",
    "description": "Nancy Pelosi, the first woman to serve as the powerful speaker of the U.S. House of Representatives, said on Thursday that she will not run for reelection to Congress in 2026, ending the four-decade career of a progressive Democratic icon often vilified by the right.",
    "date": "2025-11-06T22:27:21.000Z"
  },
  {
    "title": "Maryland sues Trump administration for canceling FBI headquarters plan",
    "url": "https://www.reuters.com/world/us/maryland-sues-trump-administration-canceling-fbi-headquarters-plan-2025-11-07/",
    "description": "Maryland on Thursday sued the Trump administration over its decision to scrap a Biden-era plan to construct new FBI headquarters just outside of Washington, D.C., in the state.",
    "date": "2025-11-07T02:23:59.000Z"
  },
  {
    "title": "Democrats' potential resurgence puts investors on watch for policy shifts",
    "url": "https://www.reuters.com/world/us/democrats-potential-resurgence-puts-investors-watch-policy-shifts-2025-11-07/",
    "description": "Democratic victories this week have caught investors' attention, signaling a potential comeback after the party's bruising defeat during last year's election.",
    "date": "2025-11-07T21:28:22.000Z"
  },
  {
    "title": "Trump says US needs to 'remain liquid'",
    "url": "https://www.reuters.com/world/us/trump-says-us-needs-remain-liquid-2025-11-07/",
    "description": "U.S. President Donald Trump on Thursday said the United States needed to remain liquid to respond to unforeseen issues as the government remained shut for the 37th day.",
    "date": "2025-11-07T01:29:24.000Z"
  },
  {
    "title": "Several people at a US military base fall ill after suspicious package with white powder opened, CNN reports",
    "url": "https://www.reuters.com/world/us/multiple-people-us-military-base-fall-ill-after-suspicious-package-delivered-cnn-2025-11-07/",
    "description": "A suspicious package containing white powder delivered to a U.S. military base in Maryland caused multiple people to fall ill and led to several being hospitalised, CNN reported on Thursday.",
    "date": "2025-11-07T05:37:10.000Z"
  },
  {
    "title": "Unions sue over Trump administration's political 'loyalty' hiring plan",
    "url": "https://www.reuters.com/business/world-at-work/unions-sue-over-trump-administrations-political-loyalty-hiring-plan-2025-11-07/",
    "description": "Unions representing federal workers filed a lawsuit on Thursday challenging a decision by U.S. President Donald Trump's administration to include what they said is a partisan \"loyalty question\" in more than 1,700 job posts since October's start.",
    "date": "2025-11-07T19:25:15.000Z"
  },
  {
    "title": "US government launches program to lower Medicaid drug prices",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-government-announces-new-medicaid-drug-pricing-program-2025-11-06/",
    "description": "The U.S. government on Thursday unveiled a new program to cut prescription drug costs for Medicaid patients by tying prices to those paid in other countries.",
    "date": "2025-11-07T15:39:46.000Z"
  },
  {
    "title": "Washington sandwich-thrower cleared of assaulting US agent",
    "url": "https://www.reuters.com/world/washington-sandwich-thrower-cleared-assaulting-us-agent-2025-11-06/",
    "description": "A man who hurled a sandwich at a federal agent in a fit of fury over President Donald Trump’s law enforcement surge in Washington, D.C., was cleared on Thursday of a misdemeanor assault charge.",
    "date": "2025-11-06T21:14:03.000Z"
  },
  {
    "title": "Pharma companies announce direct-to-consumer sales and price cuts in US",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/big-pharma-firms-announce-direct-to-consumer-sales-price-cuts-us-2025-10-13/",
    "description": "Several pharmaceutical companies have said they will sell drugs direct to patients in the U.S. and offered discounts following President Donald Trump's calls to bring down drug prices and cut out \"middlemen\" like pharmacies, insurers and pharmacy benefit managers.",
    "date": "2025-11-07T09:51:57.000Z"
  },
  {
    "title": "UPS plane crash investigation will probe maintenance history, NTSB says",
    "url": "https://www.reuters.com/business/autos-transportation/ups-plane-crash-investigation-will-probe-maintenance-history-ntsb-says-2025-11-06/",
    "description": "U.S. safety investigators said on Thursday they are probing the maintenance history of a UPS cargo plane that was in Texas for repairs weeks before crashing in flames in Louisville, Kentucky, on Tuesday, killing at least 13 people.",
    "date": "2025-11-06T22:58:23.000Z"
  },
  {
    "title": "US judge approves Trump administration's decision to drop Boeing criminal case",
    "url": "https://www.reuters.com/world/us-judge-approves-doj-decision-drop-boeing-criminal-case-2025-11-06/",
    "description": "A U.S. judge approved a request by the Trump administration's Justice Department to dismiss a criminal case against Boeing , allowing the planemaker to avoid prosecution on a charge stemming from two fatal 737 MAX plane crashes that killed 346 people, but he harshly criticized the government's decision.",
    "date": "2025-11-07T01:07:17.000Z"
  },
  {
    "title": "US flight cuts send airlines, travelers scrambling",
    "url": "https://www.reuters.com/sustainability/sustainable-finance-reporting/us-airlines-scramble-rejig-schedules-government-orders-flight-cuts-2025-11-06/",
    "description": "The cuts were expected to hit hundreds of thousands of travelers with little notice.",
    "date": "2025-11-07T01:26:15.000Z"
  },
  {
    "title": "US Supreme Court allows Trump's passport policy targeting transgender people",
    "url": "https://www.reuters.com/world/us-supreme-court-allows-trumps-passport-policy-targeting-transgender-people-2025-11-06/",
    "description": "The Supreme Court on Thursday allowed Donald Trump's administration to bar applicants for U.S. passports from designating the sex reflecting their gender identities on the document, part of the Republican president's crackdown on the rights of transgender Americans.",
    "date": "2025-11-06T22:01:31.000Z"
  },
  {
    "title": "US finalizes domestic flight cuts to start at 4% on Friday",
    "url": "https://www.reuters.com/business/aerospace-defense/us-finalizes-domestic-flight-cuts-start-4-friday-2025-11-07/",
    "description": "The U.S. Federal Aviation Administration on Thursday ordered airlines to cut domestic flight operations by 4% at 40 high-traffic airports starting at 6 a.m. ET (1100 GMT) on Friday, citing safety concerns about air traffic control during the government shutdown.",
    "date": "2025-11-07T00:59:21.000Z"
  },
  {
    "title": "US judge rejects government's riot claims, restricts federal agents' use of force in Chicago",
    "url": "https://www.reuters.com/legal/government/us-judge-rejects-governments-riot-claims-restricts-federal-agents-use-force-2025-11-06/",
    "description": "A federal judge in Chicago on Thursday said immigration officials had lied about the nature of local protests against the Trump administration’s immigration crackdown in the city, and ordered agents to restrict their use of tear gas and other anti-riot weapons in the area.",
    "date": "2025-11-07T01:12:00.000Z"
  },
  {
    "title": "Mamdani wins over New York with bold vision that galvanized young voters",
    "url": "https://www.reuters.com/world/us/mamdani-wins-over-new-york-with-bold-vision-that-galvanized-young-voters-2025-11-06/",
    "description": "Zohran Mamdani's team shaped his stunningly successful message around three promises that resonated with voters, many of them young: a rent freeze, free buses, and universal childcare.",
    "date": "2025-11-06T11:38:35.000Z"
  },
  {
    "title": "US weekly jobless claims increase moderately, Haver Analytics estimates",
    "url": "https://www.reuters.com/world/us/us-weekly-jobless-claims-increase-moderately-haver-analytics-estimates-2025-11-07/",
    "description": "The number of Americans filing new applications for unemployment benefits increased marginally last week, Haver Analytics estimated on Thursday, pointing to stable labor market conditions in October despite a surge in announced layoffs.",
    "date": "2025-11-07T00:45:39.000Z"
  },
  {
    "title": "Trump, in shift, acknowledges Americans are paying \"something\" for tariffs",
    "url": "https://www.reuters.com/world/us/trump-shift-acknowledges-americans-are-paying-something-tariffs-2025-11-06/",
    "description": "It's a shift in rhetoric even as he insisted the policy has benefited Americans overall.",
    "date": "2025-11-06T23:59:53.000Z"
  },
  {
    "title": "Which airports are affected by forced US flight reductions?",
    "url": "https://www.reuters.com/world/us/which-airports-are-affected-by-forced-us-flight-reductions-2025-11-07/",
    "description": "The FAA has told airlines to cut 4% of flights at 40 high-traffic airports starting Friday.",
    "date": "2025-11-07T00:22:01.000Z"
  },
  {
    "title": "Trump administration seeks to negotiate with China on shipping as it pauses port fees",
    "url": "https://www.reuters.com/world/us/trump-administration-seeks-negotiate-with-china-shipping-it-pauses-port-fees-2025-11-06/",
    "description": "The Trump administration said on Thursday it would pursue negotiations with China over its dominance of shipbuilding and ocean logistics as it formalized plans for a one-year pause on U.S. port fees on China-linked vessels as part of a broader deal to reduce trade tensions.",
    "date": "2025-11-06T23:57:27.000Z"
  },
  {
    "title": "US DOJ said to be probing Washington Mayor Bowser over foreign trip, NYT reports",
    "url": "https://www.reuters.com/world/us/us-doj-said-be-probing-washington-mayor-bowser-over-foreign-trip-nyt-reports-2025-11-06/",
    "description": "The U.S. Justice Department is said to be probing Washington, D.C., Mayor Muriel Bowser over a foreign trip, the New York Times reported on Thursday, citing sources.",
    "date": "2025-11-06T22:27:57.000Z"
  },
  {
    "title": "Major cases involving Trump before the US Supreme Court",
    "url": "https://www.reuters.com/legal/major-cases-involving-trump-before-us-supreme-court-2025-09-30/",
    "description": "The U.S. Supreme Court has dealt with a series of cases involving challenges to the actions of President Donald Trump and his administration since he returned to office in January. These cases have involved the U.S. Federal Reserve, tariffs, immigration policy, domestic troop deployment, birthright citizenship, transgender rights, firings of federal workers and agency officials, dismantling the Education Department, cuts to teacher training and medical research grants, foreign aid and other matters.",
    "date": "2025-11-06T22:59:52.000Z"
  },
  {
    "title": "Top cases on the US Supreme Court's docket",
    "url": "https://www.reuters.com/legal/litigation/top-cases-be-heard-during-us-supreme-courts-2025-2026-term-2025-10-03/",
    "description": "The U.S. Supreme Court will decide a series of important cases during its current nine-month term involving issues such as presidential powers, tariffs, transgender athletes, guns, race, campaign finance law, gay \"conversion therapy,\" religious rights and capital punishment.",
    "date": "2025-11-06T22:59:51.000Z"
  },
  {
    "title": "Mamdani's progressive vision for New York shaped by childhood in Uganda, mentors say",
    "url": "https://www.reuters.com/business/media-telecom/mamdanis-progressive-vision-new-york-shaped-by-childhood-uganda-mentors-say-2025-11-06/",
    "description": "When Zohran Mamdani inveighed against inequality and corruption during his underdog bid for New York City mayor, Joseph Beyanga at Uganda's Daily Monitor could hear echoes of conversations almost 20 years earlier with the then-intern on the newspaper's sports desk.",
    "date": "2025-11-06T17:31:43.000Z"
  },
  {
    "title": "Texas sues gaming platform Roblox for allegedly concealing safety risks from parents",
    "url": "https://www.reuters.com/world/texas-sues-roblox-allegedly-concealing-safety-concerns-parents-2025-11-06/",
    "description": "Roblox has been sued by Texas Attorney General Ken Paxton, who on Thursday accused the online gaming platform of deceiving parents about the safety risks it poses to children.",
    "date": "2025-11-06T22:01:09.000Z"
  },
  {
    "title": "Exclusive: Comcast hires bankers to explore bid for Warner Bros Discovery",
    "url": "https://www.reuters.com/business/finance/comcast-hires-bankers-explore-bid-warner-bros-discovery-2025-11-06/",
    "description": "Comcast has retained financial advisors and gained access to financial information as it explores a bid for Warner Bros Discovery’s studio and streaming businesses, according to four sources familiar with the matter.",
    "date": "2025-11-06T21:03:48.000Z"
  },
  {
    "title": "US FAA to unveil details of 10% cut of flights at major airports",
    "url": "https://www.reuters.com/business/aerospace-defense/us-faa-detail-flight-cut-plan-major-airports-later-friday-2025-11-06/",
    "description": "The Federal Aviation Administration said it will unveil details of its plan on Thursday to cut 10% of flights at 40 high-traffic U.S. airports to address safety concerns due to the shortage of air traffic controllers during a record-setting U.S. government shutdown.",
    "date": "2025-11-06T18:30:09.000Z"
  },
  {
    "title": "US preparing subpoenas related to 2016 Russia election-interference intelligence, sources say",
    "url": "https://www.reuters.com/legal/government/us-preparing-subpoenas-related-2016-russia-election-interference-intelligence-2025-11-06/",
    "description": "Federal prosecutors are preparing grand jury subpoenas to investigate Obama-era intelligence officials who produced an assessment finding Russia interfered in the 2016 presidential election in a bid to help Donald Trump, according to two sources familiar with the matter.",
    "date": "2025-11-06T22:25:36.000Z"
  },
  {
    "title": "Border patrol agent who shot Chicago woman boasted about it in text messages",
    "url": "https://www.reuters.com/world/us/border-patrol-agent-who-shot-chicago-woman-boasted-about-it-text-messages-2025-11-06/",
    "description": "A federal agent who shot a Chicago woman multiple times after he said she struck his vehicle with her own bragged about his shooting skills in text messages with other agents, according to records presented Wednesday at a hearing in the case against the woman.",
    "date": "2025-11-07T15:10:10.000Z"
  },
  {
    "title": "A Trump Supreme Court tariff defeat would add to trade uncertainty",
    "url": "https://www.reuters.com/world/us/trump-supreme-court-tariff-defeat-would-add-trade-uncertainty-2025-11-06/",
    "description": "It raised the specter of additional chaos as Trump is widely expected to shift to other trade tactics in the wake of an adverse ruling.",
    "date": "2025-11-06T20:38:57.000Z"
  },
  {
    "title": "New York attorney general says she's asking a court to require USDA to release complete SNAP benefits",
    "url": "https://www.reuters.com/world/us/new-york-attorney-general-says-shes-asking-court-require-usda-release-complete-2025-11-06/",
    "description": "New York Attorney General Letitia James said on Thursday that she was asking a court to require the U.S. Department of Agriculture to release complete Supplemental Nutrition Assistance Program (SNAP) benefits for November.",
    "date": "2025-11-06T20:35:53.000Z"
  },
  {
    "title": "US to announce new dietary guidelines in December, Kennedy says",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-announce-new-dietary-guidelines-december-kennedy-says-2025-11-06/",
    "description": "U.S. President Donald Trump's administration will release new dietary guidelines in December aimed at reducing high rates of obesity and changing the country's food culture, U.S. Health Secretary Robert F. Kennedy Jr. said on Thursday.",
    "date": "2025-11-06T19:04:47.000Z"
  },
  {
    "title": "California vote escalates partisan redistricting fight",
    "url": "https://www.reuters.com/world/us/california-vote-escalates-partisan-redistricting-fight-2025-11-06/",
    "description": "Political hostilities are far from over and are likely to favor Republicans as more states join the rush.",
    "date": "2025-11-06T11:15:29.000Z"
  },
  {
    "title": "Cowboys defensive end Kneeland dead at 24",
    "url": "https://www.reuters.com/sports/cowboys-defensive-end-kneeland-dead-24-2025-11-06/",
    "description": "Dallas Cowboys defensive end Marshawn Kneeland died at the age of 24, the team and the league said on Thursday, in what local police said they are investigating as a possible suicide.",
    "date": "2025-11-07T06:46:44.000Z"
  },
  {
    "title": "Washington Post says it is among victims of cyber breach tied to Oracle software",
    "url": "https://www.reuters.com/business/media-telecom/washington-post-says-it-is-among-victims-cyber-breach-tied-oracle-software-2025-11-06/",
    "description": "The Washington Post said it is among victims of a sweeping cyber breach tied to Oracle software.",
    "date": "2025-11-07T15:21:21.000Z"
  },
  {
    "title": "Republican US lawmakers applaud Trump for holding back Nvidia chips from China",
    "url": "https://www.reuters.com/world/us/republican-us-lawmakers-applaud-trump-holding-back-nvidia-chips-china-2025-11-06/",
    "description": "A group of eight Republican U.S. senators in a letter on Thursday applauded President Donald Trump's decision to continue denying China access to Nvidia's most advanced artificial intelligence chips.",
    "date": "2025-11-06T19:48:35.000Z"
  },
  {
    "title": "White House AI czar rules out federal bailout for the sector",
    "url": "https://www.reuters.com/world/us/white-house-ai-czar-rules-out-federal-bailout-sector-2025-11-06/",
    "description": "David Sacks, the White House artificial intelligence and crypto czar, said that there will be no federal bailout for AI, as U.S. races to cement its position as a global leader in the booming technology.",
    "date": "2025-11-06T19:32:05.000Z"
  },
  {
    "title": "Independent experts to review hepatitis B vaccine data after CDC delays vote",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/independent-vaccine-expert-group-review-data-hepatitis-b-vaccine-2025-11-06/",
    "description": "A group of independent U.S. vaccine experts said on Thursday it plans to review existing data on administering the hepatitis B shot at birth, months after a federal panel postponed a vote on delaying its first dose.",
    "date": "2025-11-06T22:33:21.000Z"
  },
  {
    "title": "Supreme Court's 'major questions' doctrine looms over fate of Trump's tariffs",
    "url": "https://www.reuters.com/legal/government/supreme-courts-major-questions-doctrine-looms-over-fate-trumps-tariffs-2025-11-06/",
    "description": "After the U.S. Supreme Court used a conservative legal principle called the \"major questions\" doctrine to blow holes in Democratic former President Joe Biden's agenda, will Republican President Donald Trump's sweeping tariffs suffer the same fate?",
    "date": "2025-11-06T11:14:34.000Z"
  },
  {
    "title": "Virginia teacher shot by 6-year-old awarded $10 million in civil trial",
    "url": "https://www.reuters.com/legal/litigation/virginia-teacher-shot-by-6-year-old-awarded-10-million-civil-trial-2025-11-06/",
    "description": "A Virginia school teacher who was shot by her 6-year-old student in 2023 was awarded $10 million in damages by a jury on Thursday, concluding a negligence lawsuit she brought against a school administrator.",
    "date": "2025-11-06T20:35:55.000Z"
  },
  {
    "title": "Supreme Court's Gorsuch leads conservatives in tough questions over Trump tariffs",
    "url": "https://www.reuters.com/legal/government/supreme-courts-gorsuch-leads-conservatives-tough-questions-over-trump-tariffs-2025-11-06/",
    "description": "Justice Neil Gorsuch said he was concerned by the administration's assertion that the tariffs are permissible because of the president's broad authority in dealing with foreign countries.",
    "date": "2025-11-06T20:40:30.000Z"
  },
  {
    "title": "Trump gets new review of immunity from New York criminal hush money case",
    "url": "https://www.reuters.com/world/trump-gets-new-review-new-york-criminal-hush-money-case-2025-11-06/",
    "description": "U.S. President Donald Trump was given another chance to erase his New York state hush money criminal conviction, as a federal appeals court on Thursday ordered a judge to reconsider whether the case belonged in federal court.",
    "date": "2025-11-06T18:11:23.000Z"
  },
  {
    "title": "Investigators find 'black boxes' from UPS plane crash that killed at least 12",
    "url": "https://www.reuters.com/business/aerospace-defense/death-toll-louisville-ups-plane-crash-rises-9-2025-11-05/",
    "description": "U.S. federal safety investigators have located the \"black box\" recorders from the wreckage of a UPS cargo plane that crashed in flames on takeoff from the airport at Louisville, Kentucky, killing at least 12 people, officials said on Wednesday.",
    "date": "2025-11-06T06:54:15.000Z"
  },
  {
    "title": "US holiday sales set to top $1 trillion for the first time, NRF forecasts",
    "url": "https://www.reuters.com/business/retail-consumer/us-holiday-sales-set-top-1-trillion-first-time-nrf-forecasts-2025-11-06/",
    "description": "U.S. holiday sales are expected to surpass $1 trillion for the first time, the National Retail Federation said on Thursday, though growth is forecast to slow as economic pressures weigh on consumer sentiment.",
    "date": "2025-11-06T19:26:52.000Z"
  },
  {
    "title": "Most Americans back extending Obamacare tax credits amid government shutdown, KFF poll finds",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/most-americans-back-extending-obamacare-tax-credits-amid-government-shutdown-kff-2025-11-06/",
    "description": "Public support remains strong for extending the Obamacare tax credits, which have been central to the U.S. government shutdown due to disagreements over their inclusion in funding packages, according to a new poll from research firm KFF.",
    "date": "2025-11-06T13:38:20.000Z"
  },
  {
    "title": "Democrats bask in electoral victories a year after Trump's reelection",
    "url": "https://www.reuters.com/world/us/democrats-dominate-first-big-votes-trumps-second-term-uncertainties-remain-2025-11-05/",
    "description": "Trump said he wanted his hometown of New York to be successful and that he might help Mamdani \"a little bit, maybe.\"",
    "date": "2025-11-05T23:07:54.000Z"
  },
  {
    "title": "Texas seeks to block Kenvue dividend amid Tylenol lawsuit",
    "url": "https://www.reuters.com/world/texas-seeks-block-kenvue-dividend-amid-tylenol-lawsuit-2025-11-06/",
    "description": "Texas Attorney General Ken Paxton asked a state judge on Thursday to block Kenvue from paying a nearly $400 million shareholder dividend this month, after suing the drugmaker for allegedly concealing risks to children from the use of Tylenol by pregnant women.",
    "date": "2025-11-06T16:33:17.000Z"
  },
  {
    "title": "USTR: Treasury would sort out any refunds if top court nixes Trump's tariffs",
    "url": "https://www.reuters.com/world/us/ustr-treasury-would-sort-out-any-refunds-if-top-court-nixes-trumps-tariffs-2025-11-06/",
    "description": "Some plaintiffs could get a refund in certain situations if the U.S. Supreme Court rules against President Donald Trump's tariffs, but the Treasury would have to figure out any payment schedules, the nation's top trade official said on Thursday.",
    "date": "2025-11-06T14:52:41.000Z"
  },
  {
    "title": "US unemployment rate rounds up to 4.4% in October, Chicago Fed estimates",
    "url": "https://www.reuters.com/world/us/us-unemployment-rate-rounds-up-44-october-chicago-fed-estimates-2025-11-06/",
    "description": "The U.S. jobless rate likely edged up in October to the highest in four years as the hiring rate for unemployed workers slowed and the rate of layoffs and other job separations increased, according to an estimate by the Chicago Fed released Thursday.",
    "date": "2025-11-06T13:42:24.000Z"
  },
  {
    "title": "Federal judge in Chicago orders clean toilets, access to lawyers for immigration detainees",
    "url": "https://www.reuters.com/legal/government/federal-judge-chicago-orders-clean-toilets-access-lawyers-immigration-detainees-2025-11-06/",
    "description": "The government said the requirements would 'effectively prohibit ICE from temporarily holding any individual in the state of Illinois.'",
    "date": "2025-11-06T02:00:55.000Z"
  },
  {
    "title": "In Chicago immigration crackdown, agents raid daycare, senior living center",
    "url": "https://www.reuters.com/world/us/chicago-immigration-crackdown-agents-raid-daycare-senior-living-center-2025-11-05/",
    "description": "A Spanish-language immersion daycare in a leafy residential neighborhood on the North Side of Chicago was raided by federal immigration agents on Wednesday and a teacher was taken away, panicking school administrators and parents of infants, toddlers and pre-kindergarten children at the center, a staff worker at the daycare told Reuters.",
    "date": "2025-11-05T23:19:59.000Z"
  },
  {
    "title": "Trump grapples with political setback after Democrats ride voter fury over prices",
    "url": "https://www.reuters.com/business/aerospace-defense/trump-grapples-with-political-setback-after-democrats-ride-voter-fury-over-2025-11-05/",
    "description": "Democratic wins highlight the challenge Trump and congressional Republicans face next year.",
    "date": "2025-11-05T23:08:53.000Z"
  },
  {
    "title": "Exclusive: US orders 10% flights cut at major US airports due to shutdown",
    "url": "https://www.reuters.com/business/aerospace-defense/us-may-cut-air-traffic-10-by-friday-without-shutdown-deal-sources-say-2025-11-05/",
    "description": "The shutdown, now in its 36th day, has forced 13,000 air traffic controllers and 50,000 Transportation Security Administration officers to work without pay.",
    "date": "2025-11-06T14:13:01.000Z"
  },
  {
    "title": "Emergency crews respond to ammonia leak at Mississippi fertilizer plant",
    "url": "https://www.reuters.com/world/us/emergency-crews-respond-ammonia-leak-mississippi-fertilizer-plant-2025-11-06/",
    "description": "Emergency teams responded on Wednesday to a chemical leak, possibly caused by an explosion, at a fertilizer plant in Central Mississippi, according to Governor Tate Reeves and media reports. No injuries were immediately reported.",
    "date": "2025-11-06T01:26:52.000Z"
  },
  {
    "title": "Trump administration has revoked 80,000 non-immigrant visas, US official says",
    "url": "https://www.reuters.com/legal/government/trump-administration-has-revoked-80000-non-immigrant-visas-us-official-says-2025-11-06/",
    "description": "President Donald Trump's administration has revoked around 80,000 non-immigrant visas since its inauguration on January 20 for offenses ranging from driving under the influence to assault and theft, a senior State Department official said on Wednesday.",
    "date": "2025-11-06T00:58:24.000Z"
  },
  {
    "title": "US Supreme Court casts doubt on legality of Trump's global tariffs",
    "url": "https://www.reuters.com/world/us/supreme-court-weighs-legality-tariffs-major-test-trumps-power-2025-11-05/",
    "description": "Conservative and liberal justices alike sharply questioned the lawyer representing Trump's administration.",
    "date": "2025-11-05T22:15:31.000Z"
  },
  {
    "title": "New York's small businesses want Mamdani's affordability focus, less Trump saber-rattling",
    "url": "https://www.reuters.com/world/us/new-yorks-small-businesses-want-mamdanis-affordability-focus-less-trump-saber-2025-11-06/",
    "description": "Representatives of New York City's bodegas, grocers and restaurants said on Wednesday they hope New York City Mayor-elect Zohran Mamdani spends less time going after President Donald Trump and focuses on his promises to make the city more affordable.",
    "date": "2025-11-06T08:42:57.000Z"
  },
  {
    "title": "Senate Republicans brush off Trump's push to end filibuster",
    "url": "https://www.reuters.com/business/aerospace-defense/trump-calls-end-filibuster-longest-ever-shutdown-drags-2025-11-05/",
    "description": "U.S. Senate Republicans on Wednesday rebuffed President Donald Trump's call to end the longest government shutdown in history by terminating the filibuster, a rare rejection of the demands of a president who has mainly met with fealty by the Republican-controlled Congress.",
    "date": "2025-11-06T00:37:14.000Z"
  },
  {
    "title": "Trump taps former New Mexico lawmaker to run public lands bureau",
    "url": "https://www.reuters.com/legal/government/trump-taps-former-new-mexico-lawmaker-run-public-lands-bureau-2025-11-05/",
    "description": "U.S. President Donald Trump nominated former congressman Stevan Pearce to serve as director of the Bureau of Land Management, the agency responsible for managing 245 million acres of public lands.",
    "date": "2025-11-05T21:35:53.000Z"
  },
  {
    "title": "ICE plans call center to track unaccompanied migrant children, other immigration offenders",
    "url": "https://www.reuters.com/legal/government/ice-plans-call-center-track-unaccompanied-migrant-children-other-immigration-2025-11-05/",
    "description": "U.S. Immigration and Customs Enforcement aims to open a call center that would have a dedicated unit to track down unaccompanied migrant children with the help of state and local police, an agency contracting document said, part of a wider Trump administration effort to find and potentially deport the minors.",
    "date": "2025-11-05T20:52:37.000Z"
  },
  {
    "title": "Pentagon denies Republican accusations it is shutting them out",
    "url": "https://www.reuters.com/world/us/pentagon-denies-republican-accusations-it-is-shutting-them-out-2025-11-05/",
    "description": "The Pentagon on Wednesday denied accusations from senior Republican lawmakers that the agency's top policy official, Elbridge Colby, was not fully briefing Congress on important national security issues, suggesting a widening rift between the Department of Defense and senators from both parties.",
    "date": "2025-11-05T19:16:02.000Z"
  },
  {
    "title": "Bessent says he is optimistic after Supreme Court hearing on tariffs",
    "url": "https://www.reuters.com/world/bessent-says-he-is-optimistic-after-supreme-court-hearing-tariffs-2025-11-05/",
    "description": "U.S. Treasury Secretary Scott Bessent on Wednesday said he came away from a Supreme Court hearing on the legality of President Donald Trump's sweeping tariffs feeling \"very, very optimistic.\"",
    "date": "2025-11-05T23:40:20.000Z"
  },
  {
    "title": "US families turn to food banks and relatives as benefits stall",
    "url": "https://www.reuters.com/world/us/us-families-turn-food-banks-relatives-benefits-stall-2025-11-05/",
    "description": "When Daletia Chung, of Montgomery County, Maryland, learned that her November food benefits would be delayed, she immediately made a plan with extended family to share meals and groceries so she could keep herself and her child fed.",
    "date": "2025-11-05T19:02:52.000Z"
  },
  {
    "title": "Executive who worked with Charlie Javice at Frank sentenced to 68 months in prison for fraud",
    "url": "https://www.reuters.com/legal/government/executive-who-worked-with-charlie-javice-frank-sentenced-68-months-prison-fraud-2025-11-05/",
    "description": "A former finance executive convicted of helping Charlie Javice defraud JPMorgan Chase into buying the college financial aid startup Frank for $175 million was sentenced on Wednesday to 68 months in prison.",
    "date": "2025-11-05T23:14:46.000Z"
  },
  {
    "title": "Rubio, Hegseth brief lawmakers on boat strikes after congressional frustration",
    "url": "https://www.reuters.com/legal/government/rubio-hegseth-brief-lawmakers-boat-strikes-after-congressional-frustration-2025-11-05/",
    "description": "Top Trump administration officials briefed members of the Senate and House of Representatives on Wednesday about strikes on alleged drug trafficking boats off Venezuela, after frustration in Congress about a lack of transparency about the operation.",
    "date": "2025-11-05T23:26:22.000Z"
  },
  {
    "title": "Citadel CEO Griffin says the people of NYC deserve better than Mamdani's talking points",
    "url": "https://www.reuters.com/world/us/citadel-ceo-griffin-says-people-nyc-deserve-better-than-mamdanis-talking-points-2025-11-05/",
    "description": "Ken Griffin, the CEO of Citadel, said on Wednesday he prays the policies that Mayor-elect Zohran Mamdani uses to lead New York City are different from his talking points.",
    "date": "2025-11-05T22:31:55.000Z"
  },
  {
    "title": "Supreme Court has a packed house for Trump tariffs case amid shutdown",
    "url": "https://www.reuters.com/legal/government/supreme-court-has-packed-house-trump-tariffs-case-amid-shutdown-2025-11-05/",
    "description": "Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick, sitting in the courtroom, marked a rare instance of presidential cabinet officials attending Supreme Court arguments.",
    "date": "2025-11-05T21:52:32.000Z"
  },
  {
    "title": "Mamdani victory fires up Europe's left against right-wing surge at home",
    "url": "https://www.reuters.com/world/europe/mamdani-victory-fires-up-europes-left-against-right-wing-surge-home-2025-11-05/",
    "description": "Mamdani's social media posts have resonated on both sides of the Atlantic.",
    "date": "2025-11-06T08:09:14.000Z"
  },
  {
    "title": "Democrats' hopes for 2026 boosted by critical California vote",
    "url": "https://www.reuters.com/world/us/democrats-hopes-2026-boosted-by-critical-california-vote-2025-11-05/",
    "description": "Democrats head into next year's elections with a fighting chance to win back the House.",
    "date": "2025-11-05T11:02:08.000Z"
  },
  {
    "title": "Georgia voters oust GOP utility commissioners over rising electricity rates",
    "url": "https://www.reuters.com/business/energy/georgia-voters-oust-gop-utility-commissioners-over-rising-electricity-rates-2025-11-05/",
    "description": "Georgia voters on Tuesday night unseated two Republican utility commissioners over escalating electricity rates, in what could be an early signal of a consumer backlash against data centers and Republican President Donald Trump’s aggressive push to develop nuclear power.",
    "date": "2025-11-05T17:30:23.000Z"
  },
  {
    "title": "Wall Street girds for life under Mamdani, worries about New York City's competitiveness",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/wall-street-braces-nyc-mayoral-vote-while-governor-races-give-possible-midterms-2025-11-04/",
    "description": "Wall Street was preparing to work alongside Zohran Mamdani a day after the Democratic Socialist won the New York City mayoral race, a win set to reverberate through the heart of global capitalism as financiers worry the city's competitiveness and business appeal could suffer.",
    "date": "2025-11-05T23:58:18.000Z"
  },
  {
    "title": "US services activity hits eight-month high; employment remains weak",
    "url": "https://www.reuters.com/world/us/us-private-payrolls-rebound-october-adp-says-2025-11-05/",
    "description": "U.S. services sector activity increased to an eight-month high in October as new orders grew solidly, but subdued employment pointed to lackluster labor market conditions against the backdrop of economic uncertainty stemming from tariffs.",
    "date": "2025-11-05T17:36:00.000Z"
  },
  {
    "title": "UPS Kentucky air hub to reopen after plane crash, easing delivery delays",
    "url": "https://www.reuters.com/business/autos-transportation/ups-air-hub-closure-create-delivery-delays-across-its-global-network-2025-11-05/",
    "description": "UPS said on Wednesday it would reopen its sprawling air cargo hub in Louisville, Kentucky, after temporarily shuttering it a day earlier due to a deadly plane crash, a move that will begin easing delays in the delivery firm's global network.",
    "date": "2025-11-06T02:43:53.000Z"
  },
  {
    "title": "Mamdani to Trump: 'Turn the volume up'",
    "url": "https://www.reuters.com/world/us/mamdani-trump-turn-volume-up-2025-11-05/",
    "description": "Mamdani made countering the president's actions a centerpiece of his campaign.",
    "date": "2025-11-05T08:11:17.000Z"
  },
  {
    "title": "Trump, Eli Lilly to announce weight loss drug price cut on Thursday, CBS reports",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-eli-lilly-announce-weight-loss-drug-price-cut-thursday-cbs-reports-2025-11-05/",
    "description": "U.S. President Donald Trump on Thursday is expected to announce a deal with officials from Eli Lilly and Novo Nordisk cutting the price of weight loss drugs in some cases to $150 a month, CBS reported on Wednesday, citing sources.",
    "date": "2025-11-05T18:15:47.000Z"
  },
  {
    "title": "US ends protected status for South Sudanese nationals",
    "url": "https://www.reuters.com/world/africa/us-end-protected-status-south-sudanese-nationals-cbs-2025-11-05/",
    "description": "The Trump administration is ending the temporary protected status for South Sudanese nationals that has been in place for more than a decade, according to a U.S. Department of Homeland Security (DHS) notice published on Wednesday",
    "date": "2025-11-05T14:59:05.000Z"
  },
  {
    "title": "Republican lawmakers lash out at Pentagon for keeping them in the dark",
    "url": "https://www.reuters.com/legal/government/republican-lawmakers-lash-out-pentagon-keeping-them-dark-2025-11-04/",
    "description": "Republican and Democratic lawmakers slammed the Pentagon on Tuesday for not briefing them on national security issues and said at times top defense officials appeared to be undermining U.S. President Donald Trump's own policies, in a rare bipartisan show of frustration with the administration.",
    "date": "2025-11-04T21:30:45.000Z"
  },
  {
    "title": "US House lawmakers probe Delta Air Lines on use of AI in ticket pricing",
    "url": "https://www.reuters.com/world/us/us-house-lawmakers-probe-delta-air-lines-use-ai-ticket-pricing-2025-11-05/",
    "description": "A group of two dozen U.S. House Democratic lawmakers asked Delta Air Lines CEO Ed Bastian on Wednesday to answer questions about whether it will use generative artificial intelligence to help set ticket prices.",
    "date": "2025-11-05T18:55:33.000Z"
  },
  {
    "title": "Takeaways from US election night 2025",
    "url": "https://www.reuters.com/world/us/takeaways-us-election-night-2025-2025-11-05/",
    "description": "The 2025 off-year elections in Virginia, New Jersey, New York City and California provided an early barometer of how some U.S. voters view President Donald Trump's second term and the Democratic Party's efforts to revive its political fortunes.",
    "date": "2025-11-05T04:23:45.000Z"
  },
  {
    "title": "Democrats sweep first major elections of second Trump term",
    "url": "https://www.reuters.com/world/us/elections-new-york-new-jersey-virginia-offer-early-test-trumps-agenda-2025-11-04/",
    "description": "Democrats swept a trio of races, elevating a new generation of leaders and giving the beleaguered party a shot of momentum ahead of next year's congressional elections.",
    "date": "2025-11-05T12:15:14.000Z"
  },
  {
    "title": "US Senate efforts to reopen government show frustration as deal proves elusive",
    "url": "https://www.reuters.com/legal/government/us-senate-efforts-reopen-government-show-frustration-deal-proves-elusive-2025-11-04/",
    "description": "Bipartisan efforts in the U.S. Senate to reopen the federal government as early as this week gave way to fresh signs of frustration on Tuesday, even as Republicans and Democrats aired details of a possible path out of the five-week-old impasse.",
    "date": "2025-11-04T23:08:21.000Z"
  },
  {
    "title": "US service sector activity accelerates in October; employment still subdued",
    "url": "https://www.reuters.com/world/us/us-service-sector-activity-accelerates-october-employment-still-subdued-2025-11-05/",
    "description": "U.S. services sector activity picked up in October amid a solid increase in new orders, but subdued employment pointed to lackluster labor market conditions against the backdrop of economic uncertainty stemming from tariffs on imports.",
    "date": "2025-11-05T15:40:40.000Z"
  },
  {
    "title": "At least seven dead after UPS plane crashes in fireball on takeoff from Louisville, Kentucky",
    "url": "https://www.reuters.com/world/us/louisville-airport-kentucky-reports-aircraft-incident-closes-airfield-2025-11-04/",
    "description": "A UPS wide-body cargo plane crashed on Tuesday and erupted into a fireball moments after takeoff from the international airport in Louisville, Kentucky, killing seven, including all three aboard, and injuring 11 on the ground, officials said.",
    "date": "2025-11-05T13:20:24.000Z"
  },
  {
    "title": "Trump threatens food aid as cities, nonprofits ask judge to intervene",
    "url": "https://www.reuters.com/world/us/trump-snap-benefits-begin-only-when-us-government-opens-2025-11-04/",
    "description": "U.S. President Donald Trump created confusion on Tuesday when he said that food assistance aid for millions of Americans will be given out only when the federal government shutdown ends, as lawyers for cities and nonprofits urged a federal judge to force the White House to fully fund the benefits.",
    "date": "2025-11-04T21:14:29.000Z"
  },
  {
    "title": "America reacts to US election results",
    "url": "https://www.reuters.com/world/us/america-reacts-us-election-results-2025-11-05/",
    "description": "U.S. politicians and interest groups reacted to Democratic wins in a trio of races on Tuesday, the first major elections since Donald Trump returned to the presidency, giving the embattled party new momentum ahead of next year’s congressional midterms.",
    "date": "2025-11-05T04:45:11.000Z"
  },
  {
    "title": "Ten US House races to watch in 2026: Retirements shape key contests",
    "url": "https://www.reuters.com/world/us/ten-us-house-races-watch-2026-2025-11-05/",
    "description": "Republicans in the U.S. House of Representatives will defend a narrow majority in the November 2026 elections a year from now. A pair of retirements added new dynamics to the battle between Republicans and Democrats for control of the chamber.",
    "date": "2025-11-06T16:05:23.000Z"
  },
  {
    "title": "Six races to watch in 2026 US Senate midterm election",
    "url": "https://www.reuters.com/world/us/six-races-watch-2026-us-senate-midterm-election-2025-11-05/",
    "description": "Democrats face an uphill battle to recapture a U.S. Senate majority in the November 2026 midterm elections, as Republicans are defending just two seats seen as competitive by nonpartisan analysts and hold a 53-47 majority.",
    "date": "2025-11-05T11:06:16.000Z"
  },
  {
    "title": "The longest US government shutdowns",
    "url": "https://www.reuters.com/world/us/longest-us-government-shutdowns-2025-10-01/",
    "description": "The U.S. government shutdown hit its 36th day on Wednesday, becoming the longest in history and breaking a record set in 2019 during President Donald Trump's first term in office.",
    "date": "2025-11-05T11:03:44.000Z"
  },
  {
    "title": "Dick Cheney, powerful former US vice president who pushed for Iraq war, dies at 84",
    "url": "https://www.reuters.com/world/us/former-us-vp-dick-cheney-dead-84-punchbowl-news-says-2025-11-04/",
    "description": "As vice president from 2001 to 2009, Cheney fought vigorously for an expansion of the power of the presidency.",
    "date": "2025-11-04T20:36:33.000Z"
  },
  {
    "title": "Trump re-nominates Musk ally and private astronaut Jared Isaacman as NASA chief",
    "url": "https://www.reuters.com/science/trump-nominates-musk-ally-jared-isaacman-position-nasa-chief-2025-11-04/",
    "description": "U.S. President Donald Trump said on Tuesday he was re-nominating Jared Isaacman, the private astronaut and ally of fellow billionaire and SpaceX founder Elon Musk, for the post of NASA administrator, five months after Isaacman's original nomination was withdrawn.",
    "date": "2025-11-05T02:20:33.000Z"
  },
  {
    "title": "Democrats win in Virginia, New Jersey governor races",
    "url": "https://www.reuters.com/world/us/us-elections-watch-this-week-nyc-mayor-governors-redistricting-2025-11-03/",
    "description": "Democrats won races for governor in New Jersey and Virginia on Tuesday, and a self-described democratic socialist was elected New York City mayor, while Californians approved a redistricting initiative designed to help Democrats in midterm elections.",
    "date": "2025-11-05T07:28:15.000Z"
  },
  {
    "title": "FBI agents group blasts Patel over 'erratic' personnel moves targeting agents who probed Trump",
    "url": "https://www.reuters.com/legal/government/fbi-agents-group-blasts-patel-over-erratic-personnel-moves-targeting-agents-who-2025-11-04/",
    "description": "The FBI Agents Association on Tuesday lambasted FBI Director Kash Patel, after the bureau fired, unfired and then re-fired several FBI agents who had worked on cases targeting U.S. President Donald Trump or his allies.",
    "date": "2025-11-04T22:07:12.000Z"
  },
  {
    "title": "Shutdown could close some US airspace, airline stocks fall",
    "url": "https://www.reuters.com/world/us/us-warns-mass-chaos-may-need-close-some-airspace-if-government-shutdown-2025-11-04/",
    "description": "U.S. Transportation Secretary Sean Duffy warned on Tuesday he could be forced to close some of the national airspace to air traffic if the federal government shutdown extends for another week, warning of travel chaos and sparking a selloff in airline shares.",
    "date": "2025-11-04T21:55:59.000Z"
  },
  {
    "title": "US appeals court says Florida can ban Chinese citizens from buying property",
    "url": "https://www.reuters.com/legal/government/us-court-says-florida-can-ban-chinese-citizens-buying-property-2025-11-04/",
    "description": "A U.S. appeals court on Tuesday cleared the way for Florida to enforce a law restricting real estate and land purchases by Chinese citizens, rejecting claims it violates federal law and discriminates against Asians.",
    "date": "2025-11-04T19:27:44.000Z"
  },
  {
    "title": "Trump slams California redistricting vote, says votes under 'review'",
    "url": "https://www.reuters.com/world/us/trump-slams-california-redistricting-vote-says-votes-under-review-2025-11-04/",
    "description": "U.S. President Donald Trump accused the California redistricting proposal on the ballot on Tuesday of being \"unconstitutional\" and said all mail-in ballots were under \"very serious legal and criminal review,\" without giving any evidence for his allegations.",
    "date": "2025-11-04T17:25:34.000Z"
  },
  {
    "title": "Ex-GWG chair charged with securities fraud, DOJ says",
    "url": "https://www.reuters.com/legal/government/ex-gwg-chair-charged-with-securities-fraud-doj-says-2025-11-05/",
    "description": "Bradley Heppner, the former chair of bankrupt financial services company GWG Holdings and founder of alternative asset firm Beneficent , was indicted on five charges including securities fraud and wire fraud, the U.S. Department of Justice said on Tuesday.",
    "date": "2025-11-05T01:15:17.000Z"
  },
  {
    "title": "Trump says he met with Swiss representatives to discuss trade",
    "url": "https://www.reuters.com/world/us/trump-says-he-met-with-swiss-representatives-discuss-trade-2025-11-04/",
    "description": "U.S. President Donald Trump said on Tuesday he met with senior representatives from Switzerland to discuss trade, among other topics, adding his praise for participants \"on a job well done.\"",
    "date": "2025-11-05T05:27:55.000Z"
  },
  {
    "title": "Trump silent on former Vice President Dick Cheney's death",
    "url": "https://www.reuters.com/world/us/trump-silent-former-vice-president-dick-cheneys-death-2025-11-04/",
    "description": "The White House lowered flags to half-staff on Tuesday following the death of former Vice President Dick Cheney, while President Donald Trump and his administration remained silent about the Republican politician's passing.",
    "date": "2025-11-04T22:09:46.000Z"
  },
  {
    "title": "Jeffrey Epstein had accounts with Goldman Sachs and HSBC, documents show",
    "url": "https://www.reuters.com/business/finance/jeffrey-epstein-had-accounts-with-goldman-sachs-hsbc-documents-show-2025-11-04/",
    "description": "Jeffrey Epstein, the disgraced late financier and sex offender, had accounts at Goldman Sachs , HSBC and other banks, new court filings show.",
    "date": "2025-11-04T17:38:14.000Z"
  },
  {
    "title": "Two men arrested over explosion at Harvard Medical School",
    "url": "https://www.reuters.com/legal/litigation/two-men-arrested-over-halloween-weekend-explosion-harvard-medical-school-2025-11-04/",
    "description": "Two Massachusetts men visiting Boston-area colleges on Halloween night when numerous parties were underway have been arrested and charged with causing an explosion at Harvard Medical School's campus, authorities said on Tuesday.",
    "date": "2025-11-05T01:17:59.000Z"
  },
  {
    "title": "Operations resume at Washington airport after bomb threat",
    "url": "https://www.reuters.com/world/us/faa-issues-ground-stop-washington-dc-airport-after-security-issue-reported-2025-11-04/",
    "description": "Operations resumed at Reagan Washington National Airport on Tuesday after a brief halt due to a bomb threat against a United Airlines plane.",
    "date": "2025-11-04T20:17:33.000Z"
  },
  {
    "title": "US to provide $24 million for Caribbean countries hit by Hurricane Melissa",
    "url": "https://www.reuters.com/world/us/us-provide-24-million-caribbean-countries-hit-by-hurricane-melissa-2025-11-04/",
    "description": "The United States is providing $24 million in emergency assistance for Jamaica, Haiti, the Bahamas and Cuba after the countries were hit by Hurricane Melissa last week, the State Department said on Tuesday.",
    "date": "2025-11-04T21:33:34.000Z"
  },
  {
    "title": "US government shutdown ties record, as congressional inaction takes toll",
    "url": "https://www.reuters.com/world/us/us-government-shutdown-ties-record-congressional-inaction-takes-toll-2025-11-04/",
    "description": "The U.S. government shutdown on Tuesday entered its 35th day, matching a record set during President Donald Trump's first term for the longest in history, as Republicans and Democrats in Congress continue to blame each other for the standoff.",
    "date": "2025-11-04T14:37:07.000Z"
  },
  {
    "title": "White House is working on executive order on elections, press secretary says",
    "url": "https://www.reuters.com/world/us/white-house-is-working-executive-order-elections-press-secretary-says-2025-11-04/",
    "description": "The White House is working on an executive order on elections, press secretary Karoline Leavitt said on Tuesday.",
    "date": "2025-11-04T18:54:01.000Z"
  },
  {
    "title": "Trump calls Jewish supporters of New York's Mamdani 'stupid'",
    "url": "https://www.reuters.com/world/us/trump-calls-jewish-supporters-new-yorks-mamdani-stupid-2025-11-04/",
    "description": "Donald Trump said on Tuesday any Jewish person who votes for New York mayoral candidate Zohran Mamdani is a \"stupid person,\" the latest in a string of comments over the course of the U.S. president's career suggesting that Jewish Americans vote against their own interests.",
    "date": "2025-11-04T17:24:17.000Z"
  },
  {
    "title": "US airport security TSA workers ride out shutdown with better pay, benefits than in 2019",
    "url": "https://www.reuters.com/business/world-at-work/us-airport-security-tsa-workers-ride-out-shutdown-with-better-pay-benefits-than-2025-11-04/",
    "description": "Security screeners are in a stronger financial position than they were during the last prolonged closure.",
    "date": "2025-11-04T16:33:25.000Z"
  },
  {
    "title": "Trump administration can reconsider SouthCoast Wind approval, judge rules",
    "url": "https://www.reuters.com/business/energy/trump-administration-may-reconsider-southcoast-wind-project-approval-judge-rules-2025-11-04/",
    "description": "A U.S. District Court judge ruled on Tuesday that U.S. President Donald Trump's Interior Department may reconsider the Biden administration's approval of the SouthCoast Wind project planned off the coast of Massachusetts.",
    "date": "2025-11-04T21:19:39.000Z"
  },
  {
    "title": "American Airlines to trim some management, support staff roles",
    "url": "https://www.reuters.com/business/american-airlines-trims-some-management-support-staff-roles-2025-11-04/",
    "description": "American Airlines said on Tuesday it was eliminating a \"small number\" of management and support staff positions as part of a workforce adjustment.",
    "date": "2025-11-04T18:24:29.000Z"
  },
  {
    "title": "Sandwich-hurling man on trial for 'throwing stuff' at federal agent in Washington",
    "url": "https://www.reuters.com/legal/government/sandwich-hurling-man-trial-throwing-stuff-federal-agent-washington-2025-11-04/",
    "description": "The trial of a former U.S. Justice Department staffer who hurled a sandwich at a federal agent during President Donald Trump’s police crackdown in Washington D.C. began on Tuesday with a federal prosecutor telling a jury, “You can’t go around throwing stuff.\"",
    "date": "2025-11-04T18:06:57.000Z"
  },
  {
    "title": "An Obama-appointed judge's 'roadmap' could help Trump win Supreme Court tariffs case",
    "url": "https://www.reuters.com/legal/government/an-obama-appointed-judges-roadmap-could-help-trump-win-supreme-court-tariffs-2025-11-04/",
    "description": "A judge's opinion from an earlier stage in the case could offer the president a roadmap for victory.",
    "date": "2025-11-04T12:35:10.000Z"
  },
  {
    "title": "Lilly, Novo near White House deals to cut obesity drug prices, gain Medicare access, source says",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/lilly-novo-nordisk-near-white-house-deal-obesity-drug-prices-endpoints-new-2025-11-04/",
    "description": "Eli Lilly and Novo Nordisk are expected to announce deals with the Trump administration to cut prices of their weight-loss drugs in exchange for Medicare coverage, a White House source told Reuters on Tuesday.",
    "date": "2025-11-04T22:13:59.000Z"
  },
  {
    "title": "Exclusive: US not ready to lift Mexican cattle ban over screwworm, Agriculture Secretary Rollins says",
    "url": "https://www.reuters.com/world/us/us-not-ready-lift-mexican-cattle-ban-over-screwworm-agriculture-secretary-2025-11-04/",
    "description": "The U.S. is not yet ready to reopen its border to Mexican cattle amid an outbreak of the flesh-eating New World screwworm parasite, Agriculture Secretary Brooke Rollins said, but she is pleased with Mexico's efforts to contain the pest.",
    "date": "2025-11-04T12:19:46.000Z"
  },
  {
    "title": "US motor vehicle sales drop in October as EV subsidies expire",
    "url": "https://www.reuters.com/business/autos-transportation/us-motor-vehicle-sales-drop-october-ev-subsidies-expire-2025-11-04/",
    "description": "Sales of U.S. light vehicles fell in October as the expiration of federal government subsidies undercut demand for battery-powered electric cars, and an easing labor market and looming higher prices from tariffs could limit any rebound this year.",
    "date": "2025-11-04T17:01:02.000Z"
  },
  {
    "title": "Poll shows 47% of Americans see large US trade deficit as economic emergency",
    "url": "https://www.reuters.com/world/us/poll-shows-47-americans-see-large-us-trade-deficit-economic-emergency-2025-11-04/",
    "description": "About half of Americans view the large U.S. trade deficit with other countries as an economic emergency, according to a poll released on Tuesday, a day before the Supreme Court is due to consider the legality of sweeping tariffs imposed by President Donald Trump under a law meant for emergencies.",
    "date": "2025-11-04T10:02:19.000Z"
  },
  {
    "title": "Trump administration injects more temporary funding for child nutrition program",
    "url": "https://www.reuters.com/legal/litigation/trump-administration-injects-more-temporary-funding-child-nutrition-program-2025-11-03/",
    "description": "The administration of President Donald Trump has made $450 million in tariff revenue available for a childhood nutrition program imperiled by the federal government shutdown, according to federal funding records.",
    "date": "2025-11-04T16:42:21.000Z"
  },
  {
    "title": "Trump backs Cuomo, threatens to cut funds for New York City if Mamdani wins mayoral race",
    "url": "https://www.reuters.com/world/us/trump-threatens-restrict-federal-funds-new-york-city-if-mamdani-wins-2025-11-03/",
    "description": "Trump said a vote for Republican candidate Curtis Sliwa would only help Mamdani.",
    "date": "2025-11-04T02:11:06.000Z"
  },
  {
    "title": "Appeals court skeptical of Sam Bankman-Fried's bid to toss crypto fraud conviction",
    "url": "https://www.reuters.com/legal/government/sam-bankman-frieds-lawyers-argue-new-fraud-trial-ftx-founder-2025-11-04/",
    "description": "A federal appeals court on Tuesday appeared skeptical toward Sam Bankman-Fried's arguments that his fraud conviction and 25-year prison sentence over the collapse of his FTX cryptocurrency exchange should be tossed because his trial was unfair.",
    "date": "2025-11-04T21:41:27.000Z"
  },
  {
    "title": "Trump renews push to end New York City vehicle congestion fee",
    "url": "https://www.reuters.com/world/us/trump-renews-push-end-new-york-city-vehicle-congestion-fee-2025-11-03/",
    "description": "U.S. President Donald Trump said on Monday he would ask Transportation Secretary Sean Duffy to again consider terminating the New York City vehicle congestion fee, more than five months after a federal judge blocked the effort.",
    "date": "2025-11-04T19:20:34.000Z"
  },
  {
    "title": "US extends inspection deadline for Pennsylvania transit agency after fires",
    "url": "https://www.reuters.com/legal/government/us-extends-inspection-deadline-pennsylvania-transit-agency-after-fires-2025-11-04/",
    "description": "President Donald Trump's administration, which has threatened to pull aging railcars from service in Pennsylvania, said on Tuesday it will extend a deadline for a state transit agency to inspect the fleet.",
    "date": "2025-11-04T18:49:51.000Z"
  },
  {
    "title": "Reaction to the death of Dick Cheney, powerful former US vice president",
    "url": "https://www.reuters.com/world/us/reaction-death-dick-cheney-powerful-former-us-vice-president-2025-11-04/",
    "description": "Following are responses to the death of Dick Cheney, the former U.S. vice president:",
    "date": "2025-11-04T20:37:06.000Z"
  },
  {
    "title": "US to pay reduced food aid benefits, but warns of weeks or months of delay",
    "url": "https://www.reuters.com/world/us/trump-administration-use-emergency-funds-pay-partial-food-aid-benefits-2025-11-03/",
    "description": "President Donald Trump's administration said on Monday it plans to partially fund November food benefits for millions of Americans, but warned it could take some states weeks or months to calculate and distribute the aid.",
    "date": "2025-11-03T22:59:47.000Z"
  },
  {
    "title": "Exclusive: Trump ousts watchdog of US housing regulator involved in mortgage probes of his foes",
    "url": "https://www.reuters.com/world/us/watchdog-being-ousted-us-housing-regulator-involved-trump-crackdown-sources-say-2025-11-03/",
    "description": "The internal watchdog for the Federal Housing Finance Agency is being removed from his role.",
    "date": "2025-11-04T02:59:44.000Z"
  },
  {
    "title": "FBI fires more agents who investigated Trump, then reverses course, sources say",
    "url": "https://www.reuters.com/legal/government/fbi-fires-four-more-agents-who-investigated-trump-sources-say-2025-11-03/",
    "description": "The FBI has fired four agents who worked on former Special Counsel Jack Smith's team investigating President Donald Trump, although some of those terminations were later reversed, five people familiar with the matter told Reuters.",
    "date": "2025-11-04T03:04:57.000Z"
  },
  {
    "title": "US elections as they happened: Mamdani to be NYC mayor, Democrats win New Jersey, Virginia",
    "url": "https://www.reuters.com/world/us/election-day-live-us-voters-head-polls-new-york-new-jersey-virginia-2025-11-04/",
    "description": "In Virginia, Democrat Abigail Spanberger easily won the election for governor.",
    "date": "2025-11-05T15:09:44.479Z"
  },
  {
    "title": "For first time in long US government shutdown, hints of progress toward reopening",
    "url": "https://www.reuters.com/world/us/first-time-long-us-government-shutdown-hints-progress-toward-reopening-2025-11-04/",
    "description": "The first glimmers toward ending a near-record long federal government shutdown were seen in the U.S. Capitol, as leading Senate Republicans and Democrats talked of a possible \"off-ramp\" to the disruption.",
    "date": "2025-11-04T00:22:47.000Z"
  },
  {
    "title": "Supreme Court cannot stop all of Trump's tariffs. Deal with it, officials say",
    "url": "https://www.reuters.com/world/china/supreme-court-wont-stop-trumps-tariffs-deal-with-it-officials-say-2025-11-03/",
    "description": "U.S. factory equipment maker OTC Industrial Technologies has long used low-cost countries to supply components - first China and later India - but President Donald Trump's blitz of tariffs on numerous trade partners has upended the supply chain math for CEO Bill Canady.",
    "date": "2025-11-04T03:09:07.000Z"
  },
  {
    "title": "'Wild at Heart' actress Diane Ladd dies at 89",
    "url": "https://www.reuters.com/lifestyle/wild-heart-actress-diane-ladd-dies-89-2025-11-03/",
    "description": "American actress Diane Ladd, a triple Academy Award nominee for her supporting roles in \"Alice Doesn't Live Here Anymore,\" \"Wild at Heart\" and \"Rambling Rose,\" has died at the age of 89, her daughter said on Monday.",
    "date": "2025-11-03T22:21:45.000Z"
  },
  {
    "title": "US treasury chief says he will be present at Supreme Court hearing on tariffs",
    "url": "https://www.reuters.com/world/us/us-treasury-chief-says-he-will-be-present-supreme-court-hearing-tariffs-2025-11-04/",
    "description": "U.S. Treasury Secretary Scott Bessent said on Monday he would be present at the Supreme Court during a hearing this week on the legality of President Donald Trump's tariff policy that the treasury chief called a \"matter of national security.\"",
    "date": "2025-11-04T01:49:14.000Z"
  },
  {
    "title": "US prosecutors defend case against ex-FBI chief Comey",
    "url": "https://www.reuters.com/legal/government/us-prosecutors-defend-case-against-ex-fbi-chief-comey-2025-11-04/",
    "description": "Federal prosecutors revealed in a court filing on Monday that their false statements case against former FBI Director James Comey is centered around discussions he allegedly had with an associate to shape news coverage of Comey's controversial decision to reopen a probe into Democrat Hillary Clinton weeks before the 2016 presidential election.",
    "date": "2025-11-04T00:23:01.000Z"
  },
  {
    "title": "US flight delays spike as air traffic controller absences increase",
    "url": "https://www.reuters.com/world/us/duffy-says-he-would-shutter-us-airspace-if-he-thought-it-was-unsafe-2025-11-03/",
    "description": "U.S. officials delayed a new round of flights on Monday as airlines said 3.2 million air passengers have been hit by delays or canceled flights due to a spike in air traffic controller absences amid a lack of pay as the government shutdown entered its 34th day.",
    "date": "2025-11-03T22:26:02.000Z"
  },
  {
    "title": "Ohtani teases 'three-peat' as Dodgers parade draws Los Angeles crowds",
    "url": "https://www.reuters.com/sports/thousands-line-downtown-los-angeles-dodgers-championship-parade-2025-11-03/",
    "description": "Ecstatic Dodgers fans basked in the glow of their team's second World Series title in a row with a festive parade through the streets of downtown Los Angeles on Monday, days after a thrilling Game Seven win over the Toronto Blue Jays.",
    "date": "2025-11-03T23:21:22.000Z"
  },
  {
    "title": "US travel group warns Congress of Thanksgiving chaos amid government shutdown",
    "url": "https://www.reuters.com/world/us/us-travel-group-warns-congress-thanksgiving-chaos-amid-government-shutdown-2025-11-04/",
    "description": "A travel association has urged the U.S. Congress in a letter on Monday to reopen the federal government ahead of the Thanksgiving travel rush, as the shutdown stretches into its 34th day.",
    "date": "2025-11-04T00:19:40.000Z"
  },
  {
    "title": "US manufacturing mired in weakness as tariff gloom spreads",
    "url": "https://www.reuters.com/world/us/us-manufacturing-contracts-further-october-supplier-delivery-times-lengthen-2025-11-03/",
    "description": "U.S. manufacturing contracted for an eighth straight month in October as new orders remained subdued, and suppliers were taking longer to deliver materials to factories against the backdrop of tariffs on imported goods.",
    "date": "2025-11-04T09:40:48.000Z"
  },
  {
    "title": "US prosecutors say cybersecurity pros ran cybercrime operation",
    "url": "https://www.reuters.com/legal/government/us-prosecutors-say-cybersecurity-pros-ran-cybercrime-operation-2025-11-03/",
    "description": "Prosecutors said three American cybersecurity professionals secretly ran a ransomware operation aimed at shaking down companies across the United States.",
    "date": "2025-11-04T00:45:21.000Z"
  },
  {
    "title": "New York seeks dismissal of lawsuit by Elon Musk's X over hate speech law",
    "url": "https://www.reuters.com/legal/government/new-york-seeks-dismissal-lawsuit-by-elon-musks-x-over-hate-speech-law-2025-11-03/",
    "description": "New York asked a judge on Monday to dismiss a lawsuit by Elon Musk's X to void a state law requiring social media companies to disclose how they monitor hate speech, extremism, harassment, foreign political interference and disinformation.",
    "date": "2025-11-03T23:34:45.000Z"
  },
  {
    "title": "Fed's Cook says she will serve American public despite efforts to fire her",
    "url": "https://www.reuters.com/world/us/feds-cook-acknowledges-attempt-remove-her-declines-comment-amid-legal-action-2025-11-03/",
    "description": "U.S. Federal Reserve Governor Lisa Cook, in her first public appearance since President Donald Trump moved to fire her, said it took a \"thick skin\" to pursue public service in the U.S. and pledged to fulfill the mandate given through her Senate confirmation to defend the central bank's inflation and employment targets.",
    "date": "2025-11-03T21:18:52.000Z"
  },
  {
    "title": "Which of Trump's tariffs could the US Supreme Court strike down?",
    "url": "https://www.reuters.com/legal/government/which-trumps-tariffs-could-us-supreme-court-strike-down-2025-11-03/",
    "description": "The U.S. Supreme Court holds oral arguments on Wednesday over the legality of President Donald Trump's tariffs imposed under a law called the International Emergency Economic Powers Act, or IEEPA, that never previously was used for such a purpose.",
    "date": "2025-11-03T19:58:21.000Z"
  },
  {
    "title": "US states, nonprofits sue over Trump rule limiting student loan forgiveness",
    "url": "https://www.reuters.com/legal/government/us-states-nonprofits-sue-over-trump-rule-limiting-student-loan-forgiveness-2025-11-03/",
    "description": "Several Democratic-led states, cities and nonprofits filed lawsuits on Monday seeking to block a new rule by U.S. President Donald Trump's administration that would exclude organizations from a federal student loan forgiveness program if they are deemed to have a \"substantial illegal purpose.\"",
    "date": "2025-11-03T19:22:19.000Z"
  },
  {
    "title": "University of Pennsylvania says it has called FBI over data breach",
    "url": "https://www.reuters.com/world/us/university-pennsylvania-says-it-has-called-fbi-over-data-breach-2025-11-03/",
    "description": "The University of Pennsylvania says it has called in the Federal Bureau of Investigation after offensive emails were distributed to alumni.",
    "date": "2025-11-03T23:59:24.000Z"
  },
  {
    "title": "More than 3.2 million US air passengers impacted by government shutdown, airline group says",
    "url": "https://www.reuters.com/world/us/more-than-32-million-us-air-passengers-impacted-by-government-shutdown-airline-2025-11-03/",
    "description": "More than 3.2 million U.S. airline passengers have been impacted by delays or cancellations stemming from air traffic controller staffing issues since a government shutdown began on October 1, an airline group said on Monday.",
    "date": "2025-11-03T20:01:20.000Z"
  },
  {
    "title": "Saudi Crown Prince bin Salman will visit Trump on Nov 18, White House official says",
    "url": "https://www.reuters.com/world/us/saudi-crown-prince-bin-salman-will-visit-trump-november-18-white-house-official-2025-11-03/",
    "description": "Saudi Arabia's Crown Prince Mohammed bin Salman will be at the White House on November 18 for an official working visit with U.S. President Donald Trump, a White House official said on Monday.",
    "date": "2025-11-04T00:24:06.000Z"
  },
  {
    "title": "US CFPB data security 'not effective' after Trump clampdown, watchdog report says",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-cfpb-data-security-not-effective-after-trump-clampdown-watchdog-report-says-2025-11-03/",
    "description": "President Donald Trump's clampdown on the U.S. Consumer Financial Protection Bureau earlier this year has compounded IT security lapses at the agency through the cancellation of contracts, according to an audit report released on Monday.",
    "date": "2025-11-04T00:01:36.000Z"
  },
  {
    "title": "Jon Stewart will remain at the helm of 'The Daily Show' until next December",
    "url": "https://www.reuters.com/business/media-telecom/jon-stewart-will-remain-helm-the-daily-show-until-next-december-2025-11-03/",
    "description": "Paramount Skydance said on Monday that comedian Jon Stewart will continue hosting Comedy Central's \"The Daily Show\" every Monday and serve as executive producer for the series until December next year.",
    "date": "2025-11-03T19:43:24.000Z"
  },
  {
    "title": "Tesla sued by family who says faulty doors led to wrongful deaths from fiery crash",
    "url": "https://www.reuters.com/legal/litigation/tesla-sued-by-family-who-says-faulty-doors-led-wrongful-deaths-fiery-crash-2025-11-03/",
    "description": "Tesla has been sued over a fiery Wisconsin crash that killed all five occupants of a Model S, who were allegedly trapped inside because of a design flaw that prevented them from opening the sedan's doors.",
    "date": "2025-11-03T19:44:09.000Z"
  },
  {
    "title": "US economy at risk of wobble as lower-income consumers get squeezed",
    "url": "https://www.reuters.com/world/us/us-economy-risk-wobble-lower-income-consumers-get-squeezed-2025-11-03/",
    "description": "The U.S. consumer's durability as a prop for the economy may be tested in coming weeks as family budgets, particularly among the less affluent, are stressed by rising healthcare costs, the potential loss of federal food benefits, and a wobbly job market outlook that is already taking a toll on earnings.",
    "date": "2025-11-03T11:42:30.000Z"
  },
  {
    "title": "US FDA's drug division chief resigns amid ethics concerns and lawsuit",
    "url": "https://www.reuters.com/legal/litigation/us-fdas-drug-division-chief-resigns-amid-ethics-concerns-lawsuit-2025-11-03/",
    "description": "George Tidmarsh resigned on Sunday amid serious concerns about his personal conduct, a Department of Health and Human Services spokesperson told Reuters.",
    "date": "2025-11-03T16:33:04.000Z"
  },
  {
    "title": "US charges two men in Michigan over alleged ISIS-inspired plot",
    "url": "https://www.reuters.com/world/us/us-charges-two-men-michigan-over-alleged-isis-inspired-plot-2025-11-03/",
    "description": "Federal prosecutors have charged two men tied to what they allege was an ISIS-inspired plot based out of Michigan to carry out an attack in the U.S., according to a court document made public on Monday.",
    "date": "2025-11-03T17:32:25.000Z"
  },
  {
    "title": "NAACP sues Virginia officials, accusing them of disenfranchising student voters",
    "url": "https://www.reuters.com/legal/government/naacp-sues-virginia-officials-accusing-them-disenfranchising-student-voters-2025-11-03/",
    "description": "The NAACP has sued Virginia state election officials, accusing them of disenfranchising students by rejecting voter registration forms from students that do not include details like dormitory names, room numbers and campus mailbox information.",
    "date": "2025-11-03T17:02:39.000Z"
  },
  {
    "title": "YouTube proposes returning ABC, ESPN networks following Disney's request",
    "url": "https://www.reuters.com/world/us/disney-asks-youtube-tv-restore-abc-election-day-coverage-2025-11-03/",
    "description": "YouTube TV has proposed restoring Disney's ABC and ESPN networks, in response to the entertainment giant's earlier request to bring back ABC to the pay-TV platform for Election Day coverage.",
    "date": "2025-11-03T22:58:42.000Z"
  },
  {
    "title": "World Series Game 7 pulls in nearly 26 million viewers on Fox",
    "url": "https://www.reuters.com/business/media-telecom/world-series-game-7-pulls-nearly-26-million-viewers-fox-2025-11-03/",
    "description": "Nearly 26 million viewers tuned in for Game 7 of the baseball World Series, the most since 2017, broadcaster Fox said on Monday after the Los Angeles Dodgers defeated the Toronto Blue Jays in a dramatic finale.",
    "date": "2025-11-03T18:47:37.000Z"
  },
  {
    "title": "US not planning nuclear explosions at this time, energy secretary says",
    "url": "https://www.reuters.com/world/us/us-not-planning-nuclear-explosions-this-time-energy-secretary-says-2025-11-02/",
    "description": "The nuclear weapons testing ordered by U.S. President Donald Trump will not involve nuclear explosions at this time, Energy Secretary Chris Wright said on Sunday.",
    "date": "2025-11-03T16:49:39.000Z"
  },
  {
    "title": "US government shutdown worsens financial woes for court-appointed defense lawyers",
    "url": "https://www.reuters.com/world/us/us-government-shutdown-worsens-financial-woes-court-appointed-defense-lawyers-2025-11-03/",
    "description": "As the U.S. government shutdown disrupts paychecks for federal workers across the country, it is exacerbating the financial woes of lawyers who defend the poorest members of society when they are accused of federal crimes.",
    "date": "2025-11-03T11:31:41.000Z"
  },
  {
    "title": "'We're not a violent city': Chicago locals take on ICE block-by-block",
    "url": "https://www.reuters.com/world/us/were-not-violent-city-chicago-locals-take-ice-block-by-block-2025-11-02/",
    "description": "Since the city took center stage of President Donald Trump’s immigration crackdown in September, its neighborhoods have mobilized against enforcement efforts.",
    "date": "2025-11-03T14:30:44.000Z"
  },
  {
    "title": "Obama tells Democrats to push back against Trump's 'lawlessness and recklessness'",
    "url": "https://www.reuters.com/world/us/obama-tells-democrats-push-back-against-trumps-lawlessness-recklessness-2025-11-02/",
    "description": "“Let’s face it, our country and our policy are in a pretty dark place right now.”",
    "date": "2025-11-02T12:57:12.000Z"
  },
  {
    "title": "Bessent says US food aid benefits could flow by Wednesday",
    "url": "https://www.reuters.com/world/us/bessent-says-us-food-aid-benefits-could-flow-by-wednesday-2025-11-02/",
    "description": "President Donald Trump wants to hear from the courts how to fund SNAP food aid benefits for needy Americans and payments could flow by Wednesday as ordered by a U.S. judge, Treasury Secretary Scott Bessent said on Sunday.",
    "date": "2025-11-02T14:40:19.000Z"
  },
  {
    "title": "US military kills three in strike on drug-trafficking vessel in Caribbean, Hegseth says",
    "url": "https://www.reuters.com/world/us/us-military-kills-three-strike-drug-trafficking-vessel-caribbean-hegseth-says-2025-11-02/",
    "description": "Hegseth said in a post on X that no U.S. forces were harmed in the operation.",
    "date": "2025-11-02T07:00:02.000Z"
  },
  {
    "title": "US probes near miss between Southwest Airlines jet and helicopter",
    "url": "https://www.reuters.com/world/us/us-probes-near-miss-between-southwest-airlines-jet-helicopter-2025-11-02/",
    "description": "The U.S. National Transportation Safety Board said on Sunday it is sending a team to investigate an October 29 close call between a Southwest Airlines jet and a medical helicopter near Cleveland International Airport in Ohio.",
    "date": "2025-11-02T19:39:45.000Z"
  },
  {
    "title": "US government shutdown: How it affects key economic data publishing",
    "url": "https://www.reuters.com/world/us/us-government-shutdown-how-it-affects-key-economic-data-publishing-2025-11-03/",
    "description": "The U.S. government shut down much of its operations on October 1 after Republicans and Democrats failed to reach an agreement to extend funding past the end of the federal fiscal year on September 30.",
    "date": "2025-11-03T13:33:17.000Z"
  },
  {
    "title": "Trump says he will help 'Dilbert' creator Scott Adams obtain cancer treatment",
    "url": "https://www.reuters.com/world/us/trump-says-he-will-help-dilbert-creator-scott-adams-obtain-cancer-treatment-2025-11-03/",
    "description": "U.S. President Donald Trump said on Sunday he would help the creator of the \"Dilbert\" comic strip get treated for his metastatic prostate cancer, after the cartoonist directly appealed to him on social media.",
    "date": "2025-11-03T02:55:54.000Z"
  },
  {
    "title": "Bessent says high US interest rates may have caused housing recession",
    "url": "https://www.reuters.com/business/bessent-says-high-us-interest-rates-may-have-caused-housing-recession-2025-11-02/",
    "description": "Parts of the U.S. economy, particularly housing, may already be in recession because of high interest rates, U.S. Treasury Secretary Scott Bessent said Sunday, repeating his call for the Federal Reserve to accelerate rate cuts.",
    "date": "2025-11-02T21:35:22.000Z"
  },
  {
    "title": "Director of FDA drug evaluation unit placed on leave, NYT reports",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/director-fda-drug-evaluation-unit-placed-leave-nyt-reports-2025-11-02/",
    "description": "The director of the U.S. Food & Drug Administration's Center for Drug Evaluation and Research was placed on administrative leave on Friday, The New York Times reported on Sunday.",
    "date": "2025-11-02T22:35:21.000Z"
  },
  {
    "title": "Trump says he will not attend Supreme Court's oral arguments on tariffs",
    "url": "https://www.reuters.com/world/us/trump-says-he-will-not-attend-supreme-courts-oral-tariff-arguments-2025-11-02/",
    "description": "U.S. President Donald Trump said on Sunday he will not attend the Supreme Court's upcoming oral arguments concerning the legality of his global tariffs.",
    "date": "2025-11-03T12:22:47.000Z"
  },
  {
    "title": "Trump administration must pay food aid benefits within days, judge says",
    "url": "https://www.reuters.com/world/us/trump-administration-must-pay-food-aid-benefits-within-days-judge-says-2025-11-02/",
    "description": "The Rhode Island case is one of two lawsuits filed to block the suspension of food aid benefits.",
    "date": "2025-11-03T11:36:02.000Z"
  },
  {
    "title": "In US first, New Mexico launches free child care for all",
    "url": "https://www.reuters.com/world/us/us-first-new-mexico-launches-free-child-care-all-2025-11-01/",
    "description": "New Mexico became on Saturday the first U.S. state to offer free child care to all residents in a bid to boost its economy and lift education and child welfare levels ranked the worst in the country.",
    "date": "2025-11-01T22:02:16.000Z"
  },
  {
    "title": "Obamacare premiums double, adding post Halloween fright for US health insurance shoppers",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/obamacare-premiums-double-adding-post-halloween-fright-us-health-insurance-2025-11-01/",
    "description": "Americans shopping for 2026 Obamacare health insurance plans are facing a more than doubling of monthly premiums on average and are likely to postpone signing up in hopes of a last-minute reprieve, or walk away, health experts say.",
    "date": "2025-11-03T11:51:04.000Z"
  },
  {
    "title": "US retailers left short-changed as penny production ends",
    "url": "https://www.reuters.com/business/retail-consumer/us-retailers-left-short-changed-penny-production-ends-2025-11-01/",
    "description": "Retail groups recently told Reuters that they are frustrated by the lack of guidance from the Trump administration and lawmakers.",
    "date": "2025-11-01T10:05:52.000Z"
  },
  {
    "title": "A toy maker takes his case against Trump's tariffs to the Supreme Court",
    "url": "https://www.reuters.com/world/us/toy-maker-takes-his-case-against-trumps-tariffs-supreme-court-2025-11-01/",
    "description": "Toy maker Rick Woldenberg said his legal bills have been in the millions of dollars, but he felt suing was a necessary cost.",
    "date": "2025-11-03T11:30:16.000Z"
  },
  {
    "title": "Trump administration cannot suspend food aid benefits, US judges rule",
    "url": "https://www.reuters.com/legal/government/us-judge-blocks-trump-administration-suspending-food-aid-benefits-2025-10-31/",
    "description": "President Donald Trump's administration cannot suspend food aid for millions of Americans during the ongoing government shutdown, two federal judges ruled on Friday, saying the government must use contingency funds to pay for the benefits.",
    "date": "2025-10-31T23:20:17.000Z"
  },
  {
    "title": "White House restricts access for journalists to press secretary's office",
    "url": "https://www.reuters.com/business/media-telecom/white-house-issues-new-rule-restricting-access-journalists-2025-10-31/",
    "description": "A new White House rule issued Friday restricts the ability of credentialed journalists to freely access the offices of press secretary Karoline Leavitt and other top communications officials in the West Wing, near the Oval Office.",
    "date": "2025-11-05T23:02:04.000Z"
  },
  {
    "title": "As US federal food aid lapses, most states unable to fill the void",
    "url": "https://www.reuters.com/world/us/us-federal-food-aid-lapses-most-states-unable-fill-void-2025-11-01/",
    "description": "November food benefits may not be issued by the government due to the federal shutdown. Tennessee is among the vast majority of states that cannot pay for the aid themselves.",
    "date": "2025-11-01T10:03:06.000Z"
  },
  {
    "title": "Republicans shrug off Trump's call to scrap Senate filibuster over shutdown",
    "url": "https://www.reuters.com/world/us/republicans-shrug-off-trumps-call-scrap-senate-filibuster-over-shutdown-2025-10-31/",
    "description": "Republicans on Friday showed little sign of heeding President Donald Trump's latest call to jettison the Senate filibuster and bypass a Democratic roadblock to reopening the partially shuttered federal government.",
    "date": "2025-10-31T17:32:50.000Z"
  },
  {
    "title": "Trump unveils renovated Lincoln bathroom after East Wing demolition",
    "url": "https://www.reuters.com/world/us/trump-unveils-renovated-lincoln-bathroom-after-east-wing-demolition-2025-10-31/",
    "description": "U.S. President Donald Trump said on Friday he has renovated the Lincoln Bedroom's bathroom, putting his latest stamp on the White House after demolishing the East Wing, paving over the Rose Garden and decorating the Oval Office in gold.",
    "date": "2025-10-31T21:28:58.000Z"
  },
  {
    "title": "US appeals court throws out order requiring border official to report to judge",
    "url": "https://www.reuters.com/legal/government/us-appeals-court-throws-out-order-requiring-border-official-report-judge-2025-10-31/",
    "description": "A U.S. court on Friday threw out a Chicago judge’s order directing a top U.S. border official to report to her daily on his agents’ activity as part of the Trump administration’s immigration crackdown in the city.",
    "date": "2025-10-31T21:17:07.000Z"
  },
  {
    "title": "What did Trump, Xi agree to on tariffs, export controls and fentanyl",
    "url": "https://www.reuters.com/world/us/what-did-trump-xi-agree-tariffs-export-controls-fentanyl-2025-11-01/",
    "description": "The White House on Saturday released details about the agreement that U.S. President Donald Trump reached this week with Chinese President Xi Jinping to de-escalate their countries’ trade war, including U.S. tariff reductions and a pause in Beijing's new restrictions on rare earth minerals and magnets.",
    "date": "2025-11-01T23:12:17.000Z"
  },
  {
    "title": "Virginia, Ohio advance redistricting plans amid Trump-inspired national fray",
    "url": "https://www.reuters.com/world/us/virginia-ohio-advance-redistricting-plans-amid-trump-inspired-national-fray-2025-10-31/",
    "description": "The move was the first step toward bypassing the state’s independent redistricting commission — created by voters in 2020 — and taking control of the map-drawing process.",
    "date": "2025-10-31T18:02:57.000Z"
  },
  {
    "title": "US judge permanently blocks Trump order requiring voters to prove citizenship",
    "url": "https://www.reuters.com/world/us-judge-permanently-blocks-trump-order-requiring-voters-prove-citizenship-2025-10-31/",
    "description": "A federal judge found that part of the order was illegal because the U.S. Constitution gives states, not the president, the power to oversee elections.",
    "date": "2025-10-31T21:58:54.000Z"
  },
  {
    "title": "Trump declines to rule out underground nuclear tests",
    "url": "https://www.reuters.com/world/trump-hints-resumption-underground-nuclear-tests-2025-10-31/",
    "description": "President Donald Trump reaffirmed on Friday that the U.S. would resume nuclear testing, but he did not answer directly when asked whether that would include underground nuclear tests that were common during the Cold War.",
    "date": "2025-10-31T21:03:55.000Z"
  },
  {
    "title": "Trump gives first '60 Minutes' interview following CBS lawsuit settlement",
    "url": "https://www.reuters.com/business/media-telecom/trump-sit-with-cbs-news-first-interview-after-lawsuit-semafor-reports-2025-10-31/",
    "description": "CBS News said that U.S. President Donald Trump sat down with CBS anchor Norah O'Donnell for an exclusive interview for \"60 Minutes\" on Friday afternoon, the first with the network after his lawsuit against it.",
    "date": "2025-10-31T23:04:39.000Z"
  },
  {
    "title": "USDA to release November crop supply/demand report despite government shutdown",
    "url": "https://www.reuters.com/world/us/usda-release-november-crop-supplydemand-report-despite-government-shutdown-2025-10-31/",
    "description": "The U.S. Department of Agriculture's National Agricultural Statistics Service (NASS) said on Friday that it will release several key agriculture reports in November, including a monthly crop supply and demand report that was not issued in October due to the ongoing U.S. government shutdown.",
    "date": "2025-10-31T23:25:59.000Z"
  },
  {
    "title": "Drugmakers must face skincare drug price-fixing lawsuit, US judge rules",
    "url": "https://www.reuters.com/legal/litigation/drugmakers-must-face-skincare-drug-price-fixing-lawsuit-us-judge-rules-2025-10-31/",
    "description": "A federal judge on Friday said 36 drugmakers and executives must face nearly all claims in an antitrust lawsuit brought by most U.S. states, accusing them of conspiring to fix prices of 80 generic drugs.",
    "date": "2025-10-31T23:33:11.000Z"
  },
  {
    "title": "Trump asks lawyers to seek clarification on funding food aid after rulings",
    "url": "https://www.reuters.com/world/trump-asks-lawyers-seek-clarification-funding-food-aid-after-rulings-2025-10-31/",
    "description": "U.S. President Donald Trump on Friday said he had instructed his lawyers to ask for clarification regarding court rulings that barred the Trump administration from suspending food aid during the ongoing government shutdown.\n\"If we are given the appropriate legal direction by the Court, it will BE MY HONOR to provide the funding, just like I did with Military and Law Enforcement Pay,\" Trump said in a post on Truth Social.",
    "date": "2025-10-31T22:52:23.000Z"
  },
  {
    "title": "Trump’s war on ‘woke’ forces community lenders to cut services or close",
    "url": "https://www.reuters.com/world/us/trumps-war-woke-forces-community-lenders-cut-services-or-close-2025-10-31/",
    "description": "A year ago, Karlene Sinclair-Robinson was writing loans and hosting education seminars for small businesses and entrepreneurs as finance director of a community development financial institution, or CDFI, in northern Virginia. Now, she’s helping shut it down for good on December 31.",
    "date": "2025-10-31T16:15:10.000Z"
  },
  {
    "title": "Wall Street has misgivings about Mamdani as mayor, but prepares for collaboration",
    "url": "https://www.reuters.com/world/us/wall-street-has-misgivings-about-mamdani-mayor-prepares-collaboration-2025-10-31/",
    "description": "Wall Street and the finance industry have broad misgivings about the prospect of frontrunner Zohran Mamdani becoming New York City's mayor, but many are hopeful he moderates his positions as they prepare to try and work alongside him.",
    "date": "2025-10-31T10:13:25.000Z"
  },
  {
    "title": "US senators want answers on 'anti-drug' strategy as Venezuela tensions rise",
    "url": "https://www.reuters.com/world/us/us-senators-want-answers-anti-drug-strategy-venezuela-tensions-rise-2025-10-31/",
    "description": "Republican and Democratic leaders of the U.S. Senate Armed Services Committee said on Friday the Trump administration had yet to provide details of its operations against drug cartels and their legal basis they had sought.",
    "date": "2025-11-01T02:27:15.000Z"
  },
  {
    "title": "Three injured after fire at HF Sinclair Navajo refinery in New Mexico",
    "url": "https://www.reuters.com/business/energy/three-injured-after-fire-hf-sinclair-navajo-refinery-new-mexico-2025-10-31/",
    "description": "Three individuals were injured after a fire broke out at HF Sinclair's Navajo refinery in Artesia, New Mexico, on Friday, the company said in a statement.",
    "date": "2025-10-31T21:01:05.000Z"
  },
  {
    "title": "NASA to Kim Kardashian: We've been to the moon six times",
    "url": "https://www.reuters.com/science/nasa-kim-kardashian-weve-been-moon-six-times-2025-10-31/",
    "description": "In a testament to Kim Kardashian's power to grab the spotlight, the head of NASA felt compelled this week to set the record straight when the reality TV queen said she believed a well-worn conspiracy theory that the 1969 Apollo 11 moon landing was a fake.",
    "date": "2025-10-31T20:54:18.000Z"
  },
  {
    "title": "Air traffic control absences surge, hitting almost half of major US airports",
    "url": "https://www.reuters.com/world/us/us-expects-more-flight-disruptions-government-shutdown-enters-day-31-2025-10-31/",
    "description": "Nearly 50% of the 30 busiest U.S. airports faced shortages of air traffic controllers, the Federal Aviation Administration said on Friday, leading to flight delays nationwide as a federal government shutdown hit its 31st day.",
    "date": "2025-11-01T03:17:03.000Z"
  },
  {
    "title": "FBI says it has made multiple arrests, disrupted attack plot in Michigan",
    "url": "https://www.reuters.com/world/fbi-says-it-has-made-multiple-arrests-disrupted-attack-plot-michigan-2025-10-31/",
    "description": "FBI Director Kash Patel said on Friday that officials had stopped a potential attack in Michigan, arresting multiple people, without providing further details.",
    "date": "2025-10-31T20:28:54.000Z"
  },
  {
    "title": "US FDA warns four firms over unapproved fluoride drugs for children",
    "url": "https://www.reuters.com/legal/litigation/us-fda-warns-four-firms-over-unapproved-fluoride-drugs-children-2025-10-31/",
    "description": "The U.S. Food and Drug Administration said on Friday it warned four companies that it plans to take enforcement action over their sale of unapproved fluoride-based prescription drugs for children, as part of a broader federal push to remove ingestible fluoride supplements from the market.",
    "date": "2025-10-31T18:24:37.000Z"
  },
  {
    "title": "Heavy rains in New York kill two, disrupt flights",
    "url": "https://www.reuters.com/business/environment/heavy-rains-new-york-kill-two-disrupt-flights-2025-10-31/",
    "description": "Heavy rains lashed New York on Thursday, killing two people in the city, Mayor Eric Adams said, while accompanying storms disrupted flights and weather authorities warned of floods in some areas.",
    "date": "2025-10-31T04:57:39.000Z"
  },
  {
    "title": "Trump calls for US Senate to scrap filibuster rule",
    "url": "https://www.reuters.com/world/us/trump-says-it-is-time-get-rid-us-senates-filibuster-custom-2025-10-31/",
    "description": "Republican U.S. President Donald Trump called on Thursday for the removal of the Senate's filibuster rule, to bypass a Democratic roadblock during a government shutdown now in its 30th day.",
    "date": "2025-10-31T03:14:52.000Z"
  },
  {
    "title": "Vance warns of US aviation 'disaster' if shutdown does not end",
    "url": "https://www.reuters.com/world/us/united-american-ceos-attend-white-house-event-industry-pushes-end-shutdown-2025-10-30/",
    "description": "Vice President JD Vance on Thursday warned of a potential holiday meltdown if a government shutdown stretches into the busy Thanksgiving holiday travel season and urged Democrats to provide the votes to reopen the government.",
    "date": "2025-10-31T03:50:19.000Z"
  },
  {
    "title": "Ex-FBI chief Comey argues 2020 testimony can't sustain false statements case",
    "url": "https://www.reuters.com/world/us/ex-fbi-chief-comey-argues-2020-testimony-cant-sustain-false-statements-case-2025-10-30/",
    "description": "Former FBI Director James Comey on Thursday expanded his legal challenge to a Trump administration criminal case accusing him of making false statements, saying his testimony was truthful and would not substantiate the charge.",
    "date": "2025-10-30T22:25:13.000Z"
  },
  {
    "title": "US weekly jobless claims fall, economists estimate",
    "url": "https://www.reuters.com/sustainability/sustainable-finance-reporting/us-weekly-jobless-claims-fall-economists-estimate-2025-10-30/",
    "description": "The number of Americans filing new applications for unemployment benefits fell last week, economists estimated on Thursday, though new job opportunities for those who are laid off remained scarce amid a reluctance by businesses to boost hiring.",
    "date": "2025-10-30T23:01:45.000Z"
  },
  {
    "title": "Flight delays hit Orlando, Dallas, DC due to shortage of air traffic controllers",
    "url": "https://www.reuters.com/world/us/faa-delaying-flights-dallas-dc-airports-over-air-traffic-staffing-2025-10-30/",
    "description": "Flights at Orlando, Dallas/Fort Worth and Washington, D.C. airports were delayed on Thursday due to a shortage of air traffic controllers during the U.S. government shutdown, the Federal Aviation Administration said.",
    "date": "2025-10-31T00:34:55.000Z"
  },
  {
    "title": "Exclusive: FBI searched California real estate firm linked to bad bank loans",
    "url": "https://www.reuters.com/legal/government/fbi-searched-california-real-estate-firm-linked-bad-bank-loans-2025-10-30/",
    "description": "The FBI last month searched the offices of a California real estate investment firm Continuum Analytics, which is linked to bad loans recently disclosed by Zions and Western Alliance , according to legal correspondence seen by Reuters.",
    "date": "2025-10-30T22:10:45.000Z"
  },
  {
    "title": "Fed's Bowman plans to cut bank-supervision unit by about 30%, email shows",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/feds-bowman-moves-reduce-bank-supervision-unit-by-about-30-bloomberg-news-2025-10-30/",
    "description": "U.S. Federal Reserve Vice Chair for Supervision Michelle Bowman plans to reorganize the agency's supervision and regulation division and cut the unit's staff by about 30%, according to an email sent to staff Thursday.",
    "date": "2025-10-31T01:00:12.000Z"
  },
  {
    "title": "US lawmaker asks Trump administration to help Malaysia crack down on chip smuggling",
    "url": "https://www.reuters.com/legal/government/us-lawmaker-asks-trump-administration-to-help-malaysia-crack-down-chip-smuggling-2025-10-31/",
    "description": "A U.S. Republican senator is asking U.S. President Donald Trump's administration to help the Malaysian government prevent U.S. artificial intelligence chips from being smuggled through the country to China, according to a letter seen by Reuters.",
    "date": "2025-10-31T11:36:22.000Z"
  },
  {
    "title": "Democrats excluded from briefing on US military strikes off South America, senator says",
    "url": "https://www.reuters.com/legal/government/democrats-excluded-briefing-us-military-strikes-off-south-america-senator-says-2025-10-30/",
    "description": "President Donald Trump's administration held a Republicans-only briefing about U.S. strikes on alleged drug vessels near Venezuela, in what one senior Democrat on Thursday called a dangerous trend of increasing partisanship in national security.",
    "date": "2025-10-30T19:28:58.000Z"
  },
  {
    "title": "Trump sets refugee ceiling at record-low 7,500 with focus on white South Africans",
    "url": "https://www.reuters.com/world/us/trump-sets-refugee-admissions-ceiling-7500-fiscal-2026-lowest-cap-record-2025-10-30/",
    "description": "U.S. President Donald Trump set the refugee admissions ceiling at 7,500 for fiscal year 2026, the lowest cap on record, a White House document published on Thursday said, part of a broader effort to reshape refugee policies in the U.S. and worldwide.",
    "date": "2025-10-30T21:34:05.000Z"
  },
  {
    "title": "US grocers brace for sales dip as food aid set to lapse",
    "url": "https://www.reuters.com/business/retail-consumer/us-grocers-brace-sales-dip-food-aid-set-lapse-2025-10-31/",
    "description": "U.S. grocers and food companies ranging from Walmart to Smithfield Foods are bracing for a dip in November sales if federal food aid benefits lapse for the first time due to the ongoing government shutdown.",
    "date": "2025-10-31T17:56:54.000Z"
  },
  {
    "title": "US will 'stoutly defend' its interests, defence secretary tells China",
    "url": "https://www.reuters.com/world/us/us-will-stoutly-defend-its-interests-defence-secretary-tells-china-2025-10-31/",
    "description": "The United States will \"stoutly defend its interests\", Defense Secretary Pete Hegseth told Chinese counterpart Dong Jun during a meeting on Friday in Kuala Lumpur, flagging the importance of maintaining a balance of power in the region.",
    "date": "2025-10-31T07:03:04.000Z"
  },
  {
    "title": "US judge praises prosecutors who were suspended after referring to January 6 'mob'",
    "url": "https://www.reuters.com/legal/litigation/us-judge-praises-prosecutors-who-were-suspended-after-referring-january-6-mob-2025-10-30/",
    "description": "A judge on Thursday lauded two federal prosecutors who were suspended after referring to supporters of President Donald Trump who stormed the U.S. Capitol on January 6, 2021, as \"a mob of rioters\" in a court filing.",
    "date": "2025-10-30T21:30:34.000Z"
  },
  {
    "title": "JetBlue plane diverts to Tampa, injuries reported after flight issue",
    "url": "https://www.reuters.com/world/us/jetblue-flight-diverts-tampa-after-suffering-flight-control-issue-2025-10-30/",
    "description": "A JetBlue Airways flight on Thursday en route from Cancun, Mexico, to New Jersey diverted to Tampa after suffering a flight control issue and a sudden drop in altitude that resulted in some injuries, the Federal Aviation Administration and airline said.",
    "date": "2025-10-31T03:54:07.000Z"
  },
  {
    "title": "DOGE to leave top US markets regulator, sources say",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/doge-leave-top-us-markets-regulator-sources-say-2025-10-30/",
    "description": "U.S. President Donald Trump's Department of Government Efficiency initiative, or DOGE, has wrapped up work at the Securities and Exchange Commission and will exit the agency this week, two sources familiar with the matter told Reuters on Thursday.",
    "date": "2025-10-30T21:43:13.000Z"
  },
  {
    "title": "US judge skeptical Trump administration can legally suspend food benefits",
    "url": "https://www.reuters.com/legal/government/states-urge-us-judge-block-trump-administration-suspending-food-benefits-2025-10-30/",
    "description": "A federal judge in Boston on Thursday said it appeared to her that President Donald Trump's administration cannot legally suspend all food aid for millions of Americans amid the ongoing government shutdown as it plans to do starting Saturday.",
    "date": "2025-10-30T19:37:44.000Z"
  },
  {
    "title": "Exclusive: Pentagon's DOGE unit to revamp military drone program, sources say",
    "url": "https://www.reuters.com/business/aerospace-defense/pentagons-doge-unit-revamp-military-drone-program-sources-say-2025-10-30/",
    "description": "The Pentagon's DOGE unit is leading efforts to overhaul the U.S. military drone program, including streamlining procurement, expand homegrown production, and acquire tens of thousands of cheap drones in the coming months, according to Pentagon officials and people with knowledge of the matter.",
    "date": "2025-10-30T16:12:12.000Z"
  },
  {
    "title": "New York declares state of emergency to fund food banks as federal food aid set to lapse",
    "url": "https://www.reuters.com/world/us/new-york-declares-state-emergency-fund-food-banks-federal-food-aid-set-lapse-2025-10-30/",
    "description": "New York Governor Kathy Hochul on Thursday declared a state of emergency to issue $65 million for assistance to food banks as federal funding for the national food stamp program is set to lapse on November 1.",
    "date": "2025-10-30T18:06:08.000Z"
  },
  {
    "title": "Washington Halloween displays show scariest thing for Democrats is Trump",
    "url": "https://www.reuters.com/world/us/washington-halloween-displays-show-scariest-thing-democrats-is-trump-2025-10-30/",
    "description": "In some neighborhoods of heavily Democratic Washington, Halloween displays with a decidedly political tone have long been a tradition.",
    "date": "2025-10-31T04:42:46.000Z"
  },
  {
    "title": "US government shutdown stalls FBI investigations",
    "url": "https://www.reuters.com/world/us/us-government-shutdown-stalls-fbi-investigations-2025-10-30/",
    "description": "FBI investigations have been slowed or stalled by the second-longest U.S. government shutdown in history, leaving the bureau without funds to pay informants or make undercover drug or gun buys, gaps that an FBI spokesperson said are putting national security at risk.",
    "date": "2025-10-30T10:23:03.000Z"
  },
  {
    "title": "Trump surgeon general pick Casey Means goes into labor,  Senate confirmation hearing delayed",
    "url": "https://www.reuters.com/world/us/trump-surgeon-general-nominee-casey-means-faces-us-senate-hearing-2025-10-30/",
    "description": "The U.S. Senate health committee's planned hearing for President Donald Trump's surgeon general pick Casey Means on Thursday was postponed after the nominee went into labor, according to the panel.",
    "date": "2025-10-30T17:36:16.000Z"
  },
  {
    "title": "Can Democrats find their footing? Tight New Jersey governor's race tests Trump's pull",
    "url": "https://www.reuters.com/world/us/can-democrats-find-their-footing-tight-new-jersey-governors-race-tests-trumps-2025-10-30/",
    "description": "The closely contested New Jersey governor's race between Democrat Mikie Sherrill and Republican Jack Ciattarelli has set new spending records and drawn political heavyweights, as both national parties seek an early gauge of voter sentiment nine months into Republican President Donald Trump's term.",
    "date": "2025-10-30T20:34:57.000Z"
  },
  {
    "title": "Trump administration seeks more federal police officers in Washington, DC",
    "url": "https://www.reuters.com/world/us/trump-administration-recruits-federal-officers-police-washington-dc-2025-10-30/",
    "description": "U.S. President Donald Trump's administration has launched a website to recruit more law enforcement officers to police Washington, D.C., as it seeks to expand its control over the nation's capital.",
    "date": "2025-10-30T21:23:31.000Z"
  },
  {
    "title": "ICE eyes contract to rapidly move immigrants from Texas jails to detention",
    "url": "https://www.reuters.com/legal/government/ice-eyes-contract-rapidly-move-immigrants-texas-jails-detention-2025-10-30/",
    "description": "U.S. Immigration and Customs Enforcement is asking companies to submit proposals for how they would provide round-the-clock services to transport immigrant detainees from Texas jails to ICE custody, documents published this week showed, a move that could speed up deportations and free up ICE officers.",
    "date": "2025-10-30T19:11:35.000Z"
  },
  {
    "title": "Judge allows Trump administration to fire most of DOJ race-relations agency's employees",
    "url": "https://www.reuters.com/legal/government/judge-allows-trump-administration-fire-most-doj-race-relations-agencys-employees-2025-10-30/",
    "description": "A federal judge on Thursday allowed President Donald Trump's administration to proceed with firing nearly every employee at a 1960s-era agency within the U.S. Department of Justice known as \"America's peacemaker\" that is tasked with quelling racial and ethnic tensions in U.S. communities.",
    "date": "2025-10-30T19:09:06.000Z"
  },
  {
    "title": "Health adviser Calley Means leaves White House role, NYT reports",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/rfk-jr-adviser-calley-means-leaves-white-house-role-nyt-reports-2025-10-30/",
    "description": "Calley Means, a health adviser to U.S. Health Secretary Robert F. Kennedy Jr., has left his role at the White House, the New York Times reported on Thursday.",
    "date": "2025-10-30T18:56:02.000Z"
  },
  {
    "title": "Trump ties student loan relief to immigration agenda in new rule",
    "url": "https://www.reuters.com/legal/litigation/trump-links-student-loan-forgiveness-immigration-agenda-new-rule-2025-10-30/",
    "description": "U.S. President Donald Trump's administration will move forward with its plan to exclude from a federal student loan forgiveness program nonprofits that violate laws central to his immigration agenda, according to a new regulation, making it harder for their employees to qualify for cancellation.",
    "date": "2025-10-30T20:24:55.000Z"
  },
  {
    "title": "US government shutdown threatens to shutter Head Start child programs",
    "url": "https://www.reuters.com/legal/government/us-government-shutdown-threatens-shutter-head-start-child-programs-2025-10-30/",
    "description": "Education, child care and nutrition services for tens of thousands of young American children will begin to be cut off on Saturday.",
    "date": "2025-10-30T10:07:23.000Z"
  },
  {
    "title": "Bayer's Monsanto must pay $185 million after state Supreme Court restores chemical leak verdict",
    "url": "https://www.reuters.com/world/bayers-monsanto-must-pay-185-mln-after-washington-court-reinstates-chemical-2025-10-30/",
    "description": "A U.S. court reinstated a $185 million verdict against Bayer's Monsanto unit over chemical contamination at a Washington state school on Thursday.",
    "date": "2025-10-30T20:26:18.000Z"
  },
  {
    "title": "Virginia Democrats advance plan to counter Trump-spawned redistricting in Republican states",
    "url": "https://www.reuters.com/world/us/virginia-democrats-advance-plan-counter-trump-spawned-redistricting-red-states-2025-10-29/",
    "description": "The Democratic-led Virginia House of Delegates voted on Wednesday to amend the state constitution to allow legislators to redraw Virginia's congressional maps next year, heightening a multistate, mid-decade redistricting war spawned by President Donald Trump.",
    "date": "2025-10-30T09:03:37.000Z"
  },
  {
    "title": "Fed lowers rates, but Powell suggests move may be the last of 2025",
    "url": "https://www.reuters.com/business/fed-in-fog-it-heads-toward-another-rate-cut-2025-10-29/",
    "description": "A policy divide within the central bank and a lack of federal government data may put another interest rate cut out of reach this year, Fed Chair Powell said.",
    "date": "2025-10-29T23:13:25.000Z"
  },
  {
    "title": "Democrat running for Congress, 5 others indicted over Chicago immigration protest",
    "url": "https://www.reuters.com/legal/government/democrat-running-congress-5-others-indicted-over-chicago-immigration-protest-2025-10-29/",
    "description": "They face charges of impeding a federal officer in connection with a September protest.",
    "date": "2025-10-29T23:05:33.000Z"
  },
  {
    "title": "Millions face food aid cliff in US government shutdown standoff",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/millions-face-food-aid-cliff-us-government-shutdown-standoff-2025-10-29/",
    "description": "Nearly 42 million people are set to lose food aid due to the second-longest U.S. government shutdown, as Democrats and Republicans in Congress continue to blame each other for a weeks-long legislative stalemate.",
    "date": "2025-10-29T18:02:45.000Z"
  },
  {
    "title": "Portland police say Trump's troop deployment inflamed protests",
    "url": "https://www.reuters.com/legal/government/trial-kicks-off-decide-whether-trump-legally-deployed-troops-portland-2025-10-29/",
    "description": "Portland police testified on Wednesday that President Donald Trump's order to deploy National Guard troops in their city inflamed protests and increased violence, in a trial over whether the troop deployment was legal.",
    "date": "2025-10-29T23:13:09.000Z"
  },
  {
    "title": "Trump acknowledges constitutional limits on third term, for now",
    "url": "https://www.reuters.com/world/us/no-path-amend-constitution-allowing-trump-third-term-us-house-leader-says-2025-10-28/",
    "description": "Trump said he would not seek a third term in office, a marked shift after months of teasing the idea.",
    "date": "2025-10-29T20:34:11.000Z"
  },
  {
    "title": "US health chief says there is not enough data to show Tylenol causes autism",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-health-chief-says-not-enough-data-show-tylenol-causes-autism-still-advises-2025-10-29/",
    "description": "Donald Trump's top health official on Wednesday said evidence does not show that Kenvue's pain medicine Tylenol definitively causes autism but that it should still be used cautiously, a month after the president said U.S. health officials would recommend limiting its use.",
    "date": "2025-10-29T22:09:13.000Z"
  },
  {
    "title": "Former deputy found guilty of second-degree murder in shooting of Sonya Massey",
    "url": "https://www.reuters.com/legal/government/illinois-jury-weighs-case-against-ex-deputy-who-killed-unarmed-black-woman-2025-10-29/",
    "description": "An Illinois jury on Wednesday found a former sheriff's deputy guilty of second-degree murder in the fatal shooting of an unarmed Black woman in her home in a case that drew national attention.",
    "date": "2025-10-29T20:46:21.000Z"
  },
  {
    "title": "US candy makers haunted by Halloween discounts as retailers scare up sales",
    "url": "https://www.reuters.com/business/us-retailers-discounting-hershey-sweets-boost-key-halloween-sales-2025-10-30/",
    "description": "U.S. retailers are discounting some Hershey candy ahead of Halloween on Friday, the confectioner's biggest holiday, after it hiked prices this summer due to cocoa inflation, according to third-party data.",
    "date": "2025-10-30T22:31:07.000Z"
  },
  {
    "title": "US prosecutors suspended after calling January 6 defendants 'mob of rioters,' sources say",
    "url": "https://www.reuters.com/legal/government/prosecutors-suspended-after-calling-january-6-defendants-mob-rioters-sources-say-2025-10-29/",
    "description": "The U.S. Justice Department placed two prosecutors on leave, hours after they referred to Trump supporters who stormed the Capitol on January 6, 2021, as \"a mob of rioters\" in a sentencing memo, said four people familiar with the matter.",
    "date": "2025-10-29T22:54:43.000Z"
  },
  {
    "title": "Colorado sues Trump administration over Space Command HQ move to Alabama",
    "url": "https://www.reuters.com/legal/government/colorado-sues-trump-administration-over-space-command-hq-move-alabama-2025-10-29/",
    "description": "Colorado's attorney general sued President Donald Trump's administration on Wednesday for moving U.S. Space Command's headquarters to Alabama, calling the decision unconstitutional retaliation for the Democratic state's vote-by-mail practices.",
    "date": "2025-10-29T19:41:28.000Z"
  },
  {
    "title": "Trump's critical minerals adviser to meet companies in Sydney on Friday, sources say",
    "url": "https://www.reuters.com/world/us/trumps-critical-minerals-adviser-meet-companies-sydney-friday-sources-say-2025-10-30/",
    "description": "U.S. President Donald Trump's adviser on critical minerals is set to meet officials of about 30 critical minerals companies in Sydney on Friday, two sources familiar with the matter said, as the U.S. and Australia step up cooperation to diversify supply.",
    "date": "2025-10-30T06:42:30.000Z"
  },
  {
    "title": "'Quick reaction' National Guard forces to be trained for civil disturbances by 2026, US officials say",
    "url": "https://www.reuters.com/world/us/quick-reaction-national-guard-forces-be-trained-civil-disturbances-by-2026-us-2025-10-29/",
    "description": "The National Guard is planning to train hundreds of troops in each state to be part of a rapid-response force focused on civil disturbance missions by the start of next year, two U.S. officials said on Wednesday.",
    "date": "2025-10-29T22:50:55.000Z"
  },
  {
    "title": "US Supreme Court demands more information in National Guard case",
    "url": "https://www.reuters.com/world/us/us-supreme-court-demands-more-information-national-guard-case-2025-10-29/",
    "description": "The U.S. Supreme Court signaled on Wednesday that it is actively debating how to interpret the wording of a law that limits when a president can use members of the National Guard in a challenge to President Donald Trump's bid to dispatch troops to the Chicago area.",
    "date": "2025-10-29T21:23:32.000Z"
  },
  {
    "title": "US appeals court pauses order requiring top border official to appear daily before judge",
    "url": "https://www.reuters.com/world/us/us-court-pauses-order-requiring-top-border-official-to-appear-daily-before-judge-2025-10-29/",
    "description": "A top U.S. border official won’t have to appear before a judge in Chicago on Wednesday after a U.S. appeals court paused her order directing him to come to court every weekday to answer questions about the Trump administration’s immigration crackdown in the city.",
    "date": "2025-10-30T00:34:05.000Z"
  },
  {
    "title": "Federal shutdown could cost US economy up to $14 billion",
    "url": "https://www.reuters.com/sustainability/sustainable-finance-reporting/federal-shutdown-could-cost-us-economy-up-14-billion-2025-10-29/",
    "description": "The federal government shutdown could cost the U.S. economy between $7 billion and $14 billion, shaving up to 2% from gross domestic product in the fourth quarter due to the lapse in government spending, the nonpartisan Congressional Budget Office said on Wednesday.",
    "date": "2025-10-29T20:42:06.000Z"
  },
  {
    "title": "Senate Democrats ask DOJ for justification of strikes on alleged drug boats",
    "url": "https://www.reuters.com/world/us/senate-democrats-ask-doj-justification-strikes-alleged-drug-boats-2025-10-29/",
    "description": "U.S. Senate Judiciary Committee Democrats on Wednesday asked the Justice Department to hand over all legal opinions its attorneys have produced to assess the legality of the military's 13 deadly strikes against suspected drug vessels that have killed about 57 people.",
    "date": "2025-10-29T16:29:08.000Z"
  },
  {
    "title": "Trump replaces members of arts commission reviewing White House ballroom plans",
    "url": "https://www.reuters.com/world/us/trump-ousts-arts-commission-reviewing-white-house-ballroom-plans-washington-post-2025-10-29/",
    "description": "U.S. President Donald Trump's administration is replacing all six members of an independent federal agency that planned to review his building projects, including a new ballroom at the White House that critics have slammed.",
    "date": "2025-10-29T14:29:30.000Z"
  },
  {
    "title": "Billions in heating aid for Americans at risk due to shutdown",
    "url": "https://www.reuters.com/world/us/billions-heating-aid-americans-risk-due-shutdown-2025-10-29/",
    "description": "Millions of poor and disadvantaged Americans could face trouble accessing funds for home heating starting next month due to the government shutdown, lawmakers from both parties and nonprofit groups said on Wednesday.",
    "date": "2025-10-29T16:57:58.000Z"
  },
  {
    "title": "SCE wildfire fund to pay millions, fast-track death claims",
    "url": "https://www.reuters.com/legal/litigation/sce-wildfire-fund-pay-millions-fast-track-death-claims-2025-10-29/",
    "description": "Southern California Edison said on Wednesday it would pay several million dollars each to families who lost loved ones in the January wildfires that scorched 14,000 acres in greater Los Angeles and destroyed thousands of homes and businesses.",
    "date": "2025-10-29T16:07:29.000Z"
  },
  {
    "title": "Trump tells US troops he is ready to send 'more than the National Guard' into cities",
    "url": "https://www.reuters.com/world/us/trump-tells-us-troops-he-is-ready-send-more-than-national-guard-into-cities-2025-10-28/",
    "description": "U.S. President Donald Trump has told U.S. troops he was prepared to send \"more than the National Guard\" into U.S. cities if needed, in the latest demonstration of his willingness to escalate a confrontation with Democratic-led local governments that oppose the deployments.",
    "date": "2025-10-29T04:39:58.000Z"
  },
  {
    "title": "Key US mortgage rate drops to 13-month low, industry group says",
    "url": "https://www.reuters.com/markets/us/key-us-mortgage-rate-drops-13-month-low-industry-group-says-2025-10-29/",
    "description": "The interest rate on the most popular U.S. home loan dropped last week to a 13-month low after a key reading of inflation came in lower than expected, cementing expectations for another Federal Reserve interest-rate cut.",
    "date": "2025-10-29T11:08:09.000Z"
  },
  {
    "title": "Judge disqualifies 'acting' US attorney in California",
    "url": "https://www.reuters.com/world/us/judge-disqualifies-acting-us-attorney-california-2025-10-29/",
    "description": "A federal prosecutor appointed by the Trump administration without Senate approval to serve as the \"acting U.S. attorney\" for California's central district was named to that role unlawfully, a U.S. district judge ruled.",
    "date": "2025-10-29T08:59:40.000Z"
  },
  {
    "title": "Trump again targets Fed's Powell on interest rate cuts",
    "url": "https://www.reuters.com/business/media-telecom/trump-again-targets-feds-powell-interest-rate-cuts-2025-10-29/",
    "description": "U.S. President Donald Trump complained on Wednesday about the Federal Reserve, once again taking aim at central bank chief Jerome Powell for perceived delays in cutting interest rates.",
    "date": "2025-10-29T06:47:06.000Z"
  },
  {
    "title": "Judge intensifies oversight of agents in Trump's Chicago immigration crackdown",
    "url": "https://www.reuters.com/legal/government/top-us-border-official-face-judge-chicago-over-use-tear-gas-2025-10-28/",
    "description": "A U.S. judge on Tuesday intensified her monitoring of President Donald Trump's immigration crackdown in Chicago, requiring a top official to appear daily in court and ordering his agency to detail the use of force by its agents including firing tear gas at protesters and bystanders and to hand over body-camera video.",
    "date": "2025-10-29T06:27:38.000Z"
  },
  {
    "title": "Exclusive: US military officials required to sign NDAs tied to Latin America mission",
    "url": "https://www.reuters.com/world/americas/us-military-officials-required-sign-ndas-tied-latin-america-mission-sources-say-2025-10-28/",
    "description": "The development raises new questions about a military buildup that Venezuela fears may lead to an invasion.",
    "date": "2025-10-28T20:44:57.000Z"
  },
  {
    "title": "Trump's popularity dips as Americans sweat cost of living, Reuters/Ipsos poll finds",
    "url": "https://www.reuters.com/world/us/trumps-popularity-dips-americans-sweat-cost-living-reutersipsos-poll-finds-2025-10-28/",
    "description": "The pace of inflation has edged higher since Trump took office in January, even as the job market has weakened, leading the country's central bank to lower interest rates.",
    "date": "2025-10-28T22:54:35.000Z"
  },
  {
    "title": "Senator Schumer sees US shutdown stretching into November",
    "url": "https://www.reuters.com/world/us/senator-schumer-sees-us-shutdown-stretching-into-november-2025-10-28/",
    "description": "Senate Democratic leader Chuck Schumer said on Tuesday the 28-day U.S. government shutdown could stretch into November, when millions face soaring health insurance costs from expiring Affordable Care Act tax credits — raising pressure on lawmakers to resolve the impasse as enrollment begins.",
    "date": "2025-10-29T17:14:34.000Z"
  },
  {
    "title": "States sue over Trump administration suspending food benefits during shutdown",
    "url": "https://www.reuters.com/world/us/states-sue-over-trump-administration-suspending-food-benefits-during-shutdown-2025-10-28/",
    "description": "A coalition of Democratic-led states sued the Trump administration on Tuesday, seeking to avert what would be a historic lapse in food aid for millions of Americans that is set to begin November 1 amid an ongoing government shutdown.",
    "date": "2025-10-28T21:43:44.000Z"
  },
  {
    "title": "Hundreds of air traffic controllers take second jobs as US shutdown continues",
    "url": "https://www.reuters.com/business/world-at-work/hundreds-air-traffic-controllers-take-second-jobs-shutdown-continues-2025-10-28/",
    "description": "Air traffic controllers and trainees are taking side hustles like waiting tables, delivering food for DoorDash and driving for Uber.",
    "date": "2025-10-28T22:00:28.000Z"
  },
  {
    "title": "US revokes approval for 13 routes by Mexican airlines, citing competition issues",
    "url": "https://www.reuters.com/world/us/us-launches-crackdown-against-mexican-air-carriers-citing-competition-issues-2025-10-28/",
    "description": "The U.S. on Tuesday said it has revoked approval for 13 routes by Mexican carriers into the United States and canceled all combined passenger and cargo flights by Mexican airlines to the United States from Mexico City's Felipe Angeles International Airport.",
    "date": "2025-10-29T00:31:05.000Z"
  },
  {
    "title": "Daylight saving time bill stalls again in US Senate",
    "url": "https://www.reuters.com/world/us/long-stalled-push-make-us-daylight-saving-time-permanent-hits-dead-end-2025-10-28/",
    "description": "The U.S. Senate briefly took up a long-stalled effort on Tuesday to make daylight saving time permanent and end the twice-yearly practice of switching clocks, but again failed to reach consensus.",
    "date": "2025-10-28T22:36:49.000Z"
  },
  {
    "title": "Trump says US blocks him from running for third term",
    "url": "https://www.reuters.com/world/us/trump-says-us-blocks-him-running-third-term-2025-10-29/",
    "description": "President Donald Trump said on Wednesday that U.S. law prohibits him from seeking a third term, suggesting that he does not intend to challenge the legal limits on presidential tenure.",
    "date": "2025-10-29T02:08:19.000Z"
  },
  {
    "title": "US consumer confidence slips to six-month low; worries over job availability rising",
    "url": "https://www.reuters.com/world/us/us-consumer-confidence-slips-october-worries-over-jobs-persist-2025-10-28/",
    "description": "U.S. consumer confidence eased to a six-month low in October amid worries about the availability of jobs in the near-term, offering more ammunition for the Federal Reserve to cut interest rates again on Wednesday.",
    "date": "2025-10-28T18:23:25.000Z"
  },
  {
    "title": "US appeals court revives $2.5 billion opioid lawsuit in West Virginia",
    "url": "https://www.reuters.com/legal/government/us-appeals-court-revives-25-billion-opioid-lawsuit-west-virginia-2025-10-28/",
    "description": "A U.S. appeals court on Tuesday revived a $2.5 billion lawsuit against drug distributors accused of contributing to an opioid addiction crisis in West Virginia communities, overturning a 2022 victory at trial by the largest drug suppliers in the U.S.",
    "date": "2025-10-28T22:43:04.000Z"
  },
  {
    "title": "US Senate passes bill to terminate Trump tariffs against Brazil",
    "url": "https://www.reuters.com/world/us/us-senate-passes-bill-terminate-trump-tariffs-against-brazil-2025-10-28/",
    "description": "The Republican-led U.S. Senate passed legislation on Tuesday that would overturn President Donald Trump's tariffs against Brazil by terminating the national emergency he declared in July in retaliation for Brazil's prosecution of its former president, Jair Bolsonaro, for an alleged coup attempt.",
    "date": "2025-10-28T23:46:58.000Z"
  }
]