[
  {
    "title": "Trump Pardons Rudy Giuliani and Others Who Backed Efforts to Overturn 2020 Election, Official Says",
    "url": "https://www.usnews.com/news/us/articles/2025-11-10/trump-pardons-rudy-giuliani-and-others-who-backed-efforts-to-overturn-2020-election-official-says",
    "description": "A Justice Department official says President Donald Trump has pardoned his former personal lawyer Rudy Giuliani, his former chief of staff Mark Meadows and others accused of backing the Republican’s efforts to overturn the 2020 election",
    "date": "Nov. 10, 2025"
  },
  {
    "title": "US Officials in Israel to Press Truce Forward as First Phase of Israel-Hamas Ceasefire Wanes",
    "url": "https://www.usnews.com/news/world/articles/2025-11-10/gaza-health-officials-say-israel-handed-over-the-bodies-of-15-palestinians",
    "description": "Israel has returned the remains of 15 Palestinians to Gaza as part of a U.S.-brokered ceasefire",
    "date": "Nov. 10, 2025"
  },
  {
    "title": "BBC Faces Leadership Crisis After News Bosses Quit Over Trump Speech Edit and Bias Claims",
    "url": "https://www.usnews.com/news/entertainment/articles/2025-11-10/bbc-faces-leadership-crisis-after-news-bosses-quit-over-trump-speech-edit-and-bias-claims",
    "description": "Britain’s biggest and most important media organization, the BBC, is facing turmoil at the top after its top executive and head of news both resigned",
    "date": "Nov. 10, 2025"
  },
  {
    "title": "Indonesia Declares Late Dictator Suharto a National Hero, Despite Outrage From Rights Groups",
    "url": "https://www.usnews.com/news/world/articles/2025-11-10/indonesia-declares-late-dictator-suharto-a-national-hero-despite-outrage-from-rights-groups",
    "description": "Indonesia has declared former dictator Suharto a national hero, provoking outrage from rights group who say the move is an attempt to whitewash decades of human rights abuses and corruption that took place during his 32 years in power",
    "date": "Nov. 10, 2025"
  },
  {
    "title": "Judge to Ponder Challenge to West Virginia National Guard Deployment in the Nation's Capital",
    "url": "https://www.usnews.com/news/best-states/virginia/articles/2025-11-10/judge-to-ponder-challenge-to-west-virginia-national-guard-deployment-in-the-nations-capital",
    "description": "A hearing in set in West Virginia over the deployment of the state National Guard to Washington, D.C., as part of President Donald Trump’s crime-fighting efforts",
    "date": "Nov. 10, 2025"
  },
  {
    "title": "South Korea's Ousted Leader Yoon Indicted for Flying Drones Over North Korea",
    "url": "https://www.usnews.com/news/world/articles/2025-11-10/south-koreas-ousted-leader-yoon-indicted-for-flying-drones-over-north-korea",
    "description": "South Korea’s ousted conservative President Yoon Suk Yeol faces additional criminal charges as prosecutors allege that he flew drones over North Korea to deliberately create tensions and justify his plans to declare martial law",
    "date": "Nov. 10, 2025"
  },
  {
    "title": "States Face Uncertainty as Trump Administration Tries to Reverse SNAP Food Payments",
    "url": "https://www.usnews.com/news/best-states/wisconsin/articles/2025-11-10/states-face-uncertainty-as-trump-administration-tries-to-reverse-snap-food-payments",
    "description": "States are facing uncertainty about providing full monthly benefits for a federal food program serving 42 million Americans",
    "date": "Nov. 10, 2025"
  },
  {
    "title": "China Rolls Out Its Version of the H-1B Visa to Attract Foreign Tech Workers",
    "url": "https://www.usnews.com/news/business/articles/2025-11-10/china-creates-a-new-visa-competing-with-the-us-in-wooing-global-tech-talent",
    "description": "China has a new visa scheme that is creating job opportunities for foreign professionals, part of its effort to attract global talent and gain an edge in global technology",
    "date": "Nov. 10, 2025"
  },
  {
    "title": "Texas Gov. Abbott Launches Reelection Campaign for 4th Term",
    "url": "https://www.usnews.com/news/best-states/texas/articles/2025-11-09/texas-gov-abbott-launches-reelection-campaign-for-4th-term",
    "description": "Gov. Greg Abbott has launched his campaign for a fourth term as governor",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Trump Is Hosting Syria's Al-Sharaa for a First-Of-Its-Kind Meeting at the White House",
    "url": "https://www.usnews.com/news/us/articles/2025-11-10/trump-is-hosting-syrias-al-sharaa-for-a-first-of-its-kind-meeting-at-the-white-house",
    "description": "President Donald Trump is hosting Syrian President Ahmad al-Sharaa at the White House on Monday",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Salman Rushdie Is Being Honored With a Dayton Peace Prize Lifetime Achievement Award",
    "url": "https://www.usnews.com/news/best-states/ohio/articles/2025-11-09/salman-rushdie-is-being-honored-with-a-dayton-peace-prize-lifetime-achievement-award",
    "description": "Salman Rushdie is among those being honored at the Dayton Literary Peace Prize event in Ohio",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "A Look Back at the Weekend's Biggest Stories",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-09/a-look-back-at-the-weekends-biggest-stories",
    "description": "The Senate took the first step to end the government shutdown on Sunday after a group of moderate Democrats agreed to proceed without a guaranteed extension of health care subsidies",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Donald Trump Booed as the 1st Sitting US President at a Regular-Season NFL Game Since Carter in 1978",
    "url": "https://www.usnews.com/news/sports/articles/2025-11-09/donald-trump-plans-to-be-the-1st-sitting-us-president-at-a-regular-season-nfl-game-since-1978",
    "description": "President Donald Trump has become the first sitting president in nearly a half-century at a regular-season NFL game",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Top BBC Bosses Resign After Criticism of the Broadcaster’s Editing of a Trump Speech",
    "url": "https://www.usnews.com/news/world/articles/2025-11-09/bbc-director-resigns-after-criticism-of-the-broadcasters-editing-of-a-trump-speech",
    "description": "The head of the BBC has resigned after criticism of the broadcaster’s editing of a speech by U.S. President Donald Trump",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Trump Administration Demands States 'Undo' Full SNAP Payouts as States Warn of 'Catastrophic Impact'",
    "url": "https://www.usnews.com/news/best-states/texas/articles/2025-11-09/trump-administration-demands-states-undo-full-snap-payouts-as-states-warn-of-catastrophic-impact",
    "description": "President Donald Trump's administration is demanding that states reverse full SNAP benefits issued under recent court orders",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "EU, Latin America and Caribbean Nations Hold Summit Overshadowed by US Military Operation",
    "url": "https://www.usnews.com/news/business/articles/2025-11-09/summit-of-eu-latin-america-and-caribbean-nations-aims-to-strengthen-ties-amid-us-military-operation",
    "description": "European, Latin American, and Caribbean nations have started a two-day summit in Colombia to strengthen ties",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Iraq's Displaced Yazidis and Security Forces Cast Ballots in Early Voting in Parliament Election",
    "url": "https://www.usnews.com/news/world/articles/2025-11-09/iraqs-displaced-yazidis-and-security-forces-cast-ballots-in-early-voting-in-parliament-election",
    "description": "Members of the Iraqi security forces and displaced people are casting their ballots in early voting in the country's parliamentary election",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Ukrainian Strikes Disrupt Power and Heating to 2 Major Cities in Russia",
    "url": "https://www.usnews.com/news/world/articles/2025-11-09/ukrainian-strikes-disrupt-power-and-heating-to-2-major-cities-in-russia",
    "description": "Ukrainian strikes have disrupted power and heating in two major Russian cities near the Ukrainian border, according to local Russian officials",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "7 Myanmar Migrants Dead and 13 Rescued After Boat Capsizes Near Malaysia",
    "url": "https://www.usnews.com/news/world/articles/2025-11-09/a-boat-from-myanmar-with-hundreds-of-migrants-capsizes-off-malaysia-1-body-found-and-10-rescued",
    "description": "Rescuers in Malaysia have recovered the bodies of seven migrants from Myanmar and found 13 survivors from a capsized boat",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "States Are Pushing for More Scrutiny of Antisemitism in Schools",
    "url": "https://www.usnews.com/news/best-states/new-york/articles/2025-11-09/states-are-pushing-for-more-scrutiny-of-antisemitism-in-schools",
    "description": "Tensions over the Israel-Hamas war have spilled into K-12 schools around the U.S., with advocates reporting a rise in antisemitism since the 2023 surprise attack on Israel",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Senate Takes First Step Toward Ending the Government Shutdown",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-09/government-shutdown-reaches-its-40th-day-as-senators-work-through-a-crucial-weekend",
    "description": "The Senate has taken the first step to end the government shutdown after a group of moderate Democrats agreed to proceed without a guaranteed extension of health care subsidies",
    "date": "Nov. 9, 2025"
  },
  {
    "title": "Chicago Police Respond to Report of Shots Fired at Federal Agents Amid Immigration Operations",
    "url": "https://www.usnews.com/news/us/articles/2025-11-08/chicago-police-respond-to-report-of-shots-fired-at-federal-agents-amid-immigration-operations",
    "description": "Chicago Police say they responded to a call of gunshots fired at federal agents during immigration enforcement operations",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Democrats Seize on Trump Administration's Efforts to Fight Food Stamp Payments",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-08/democrats-seize-on-trump-administrations-efforts-to-fight-food-stamp-payments",
    "description": "The Trump administration’s legal efforts to fight having to fully fund food stamps for millions of vulnerable Americans is creating an opening for Democrats eager to use the longest government shutdown in U.S. history to paint the president as callous and out of touch",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "White House Says Naming New Washington Commanders Stadium After Trump Would Be 'Beautiful'",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-08/white-house-says-naming-new-washington-commanders-stadium-after-trump-would-be-beautiful",
    "description": "The White House says it would be “beautiful” to name the new stadium for Washington’s NFL team after President Donald Trump",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Rodrigo Paz Sworn in as Bolivia's New President, Ending 20 Years of One-Party Rule",
    "url": "https://www.usnews.com/news/world/articles/2025-11-08/rodrigo-paz-sworn-in-as-bolivias-new-president-ending-20-years-of-one-party-rule",
    "description": "Rodrigo Paz has been sworn in as Bolivia’s new president, marking a shift after nearly 20 years of one-party rule",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Powerful Tornado in Brazil Kills 6 People and Injures Hundreds More",
    "url": "https://www.usnews.com/news/world/articles/2025-11-08/powerful-tornado-in-brazil-kills-6-people-and-injures-more-than-400-others",
    "description": "A powerful tornado in Brazil's southern state of Parana has killed six people and injured hundreds of others",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Washington's Struggling Economy Takes Another Hit From the Government Shutdown",
    "url": "https://www.usnews.com/news/business/articles/2025-11-08/washingtons-struggling-economy-takes-another-economic-hit-from-the-government-shutdown",
    "description": "Washington's local economy has taken blows from a series of actions by the Trump administration, from the layoffs of federal workers to the ongoing law enforcement intervention with the National Guard",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "From Bollywood to Bodegas, Mamdani’s Mayoral Campaign Found Visual Inspiration in Unlikely Corners",
    "url": "https://www.usnews.com/news/best-states/new-york/articles/2025-11-08/from-bollywood-to-bodegas-mamdanis-mayoral-campaign-found-visual-inspiration-in-unlikely-corners",
    "description": "Zohran Mamdani’s winning run for New York City mayor featured a memorable campaign design that drew its inspiration from a wide range of influences, helping the democratic socialist appeal to young and diverse voters",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Russian Strikes Hit an Apartment Building and Energy Sites in Ukraine, Killing 4",
    "url": "https://www.usnews.com/news/world/articles/2025-11-08/a-russian-drone-strike-at-a-tower-block-in-eastern-ukraine-kills-a-woman-and-injures-11-people",
    "description": "Ukrainian authorities say that a Russian drone has hit an apartment building in eastern Ukraine and three people have been killed and 12 others wounded",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Hundreds Charged With Treason in Tanzania as Authorities Hunt Key Opposition Figures After Election",
    "url": "https://www.usnews.com/news/world/articles/2025-11-08/hundreds-charged-with-treason-in-tanzania-as-authorities-hunt-key-opposition-figures-after-election",
    "description": "Tanzanian authorities have charged hundreds of people with treason over demonstrations around disputed polls last month",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "In Israel, Mamdani’s Win in New York Stirs Alarm Over Shifting US Attitudes",
    "url": "https://www.usnews.com/news/world/articles/2025-11-08/in-israel-mamdanis-win-in-new-york-stirs-alarm-over-shifting-us-attitudes",
    "description": "The election of Zohran Mamdani as New York City’s next mayor has sent a chill across Israel",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "SNAP Food Aid Gets to People in Some States While Others Remain in Limbo Amid Court Battles",
    "url": "https://www.usnews.com/news/us/articles/2025-11-08/people-in-some-states-get-snap-food-aid-while-others-still-wait-for-their-november-benefits",
    "description": "People in some U.S. states have started receiving their November SNAP benefits after delays caused by a legal battle over the government shutdown",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Voters’ Anger at High Electricity Bills and Data Centers Looms Over 2026 Midterms",
    "url": "https://www.usnews.com/news/us/articles/2025-11-08/voters-anger-over-high-electricity-bills-and-data-centers-loom-over-2026-midterms",
    "description": "Voter anger over rising electricity costs is shaping next year's midterm elections",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Weekend Session Gets off to Slow Start in Senate as Lawmakers Look for a Way Out of Shutdown",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-08/senators-to-work-through-the-weekend-on-shutdown-as-republicans-and-democrats-are-still-far-apart",
    "description": "The Senate’s first weekend session since the shutdown began has yielded few signs of progress",
    "date": "Nov. 8, 2025"
  },
  {
    "title": "Biden Urges on Nebraska Democrats as Underdogs in His Return to the Political Stage in Omaha",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/biden-urges-on-nebraska-democrats-as-underdogs-in-his-return-to-the-political-stage-in-omaha",
    "description": "Joe Biden slowly but steadily walked onto the stage in Omaha on Friday",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Justice Department Issues Flurry of Subpoenas in Fresh Inquiry Into Trump-Russia Probe: AP Sources",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/justice-department-issues-flurry-of-subpoenas-in-fresh-inquiry-into-trump-russia-probe-ap-sources",
    "description": "The Justice Department has embarked on a fresh investigation into one of President Donald Trump’s chief grievances, issuing a flurry of subpoenas related to the U.S. government’s inquiry into Russian interference in the 2016 presidential election",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Judge Rules Trump Administration Failed to Meet Legal Requirements for Deploying Troops to Portland",
    "url": "https://www.usnews.com/news/best-states/oregon/articles/2025-11-07/judge-rules-trump-administration-failed-to-meet-legal-requirements-for-deploying-troops-to-portland",
    "description": "A federal judge in Oregon has ruled that President Donald Trump’s administration failed to meet the legal requirements for deploying the National Guard to Portland",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Progressives Warn Democrats Against Alienating the Left and Blast Schumer's Senate Leadership",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/progressives-warn-democrats-about-alienating-the-left-as-they-jeer-key-party-leader",
    "description": "Democrats are riding high after Election Day wins and some are capitalizing on the victory of New York City Mayor-Elect Zohran Mamdani",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Letitia James Calls Mortgage Fraud Case Against Her Vindictive and Asks Judge to Dismiss It",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/letitia-james-calls-mortgage-fraud-case-against-her-vindictive-and-asks-judge-to-dismiss-it",
    "description": "New York Attorney General Letitia James is asking a federal judge to dismiss a mortgage fraud case against her, calling it a vindictive and politically motivated prosecution brought at the behest of a president who regards her as an enemy",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Trump Says US to Boycott G20 in South Africa, Repeating Allegations About Treatment of White Farmers",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/trump-says-us-to-boycott-g20-in-south-africa-repeating-allegations-about-treatment-of-white-farmers",
    "description": "President Donald Trump says no U.S. government officials will be attending the Group of 20 summit this year in South Africa, citing the country’s treatment of white farmers",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Florida Is Suing Planned Parenthood Over the Safety of Abortion Drugs. Here's What to Know",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/florida-is-suing-planned-parenthood-over-the-safety-of-abortion-drugs-heres-what-to-know",
    "description": "Florida’s attorney general has filed a lawsuit against Planned Parenthood, claiming the organization is “misrepresenting the safety” of abortion pills",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Takeaways From the 2025 General Election, in Charts",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/takeaways-from-the-2025-general-election-in-charts",
    "description": "After voters swung toward Republican Donald Trump during last fall’s presidential election, states like Virginia and New Jersey swung back towards Democratic candidates at nearly the same velocity as 2024’s shift, an Associated Press analysis of election data from this week found",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "DC Mayor Bowser Is Not the Target of Justice Department Investigation, Officials Say",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/dc-mayor-bowser-is-not-the-target-of-justice-department-investigation-officials-say",
    "description": "The Justice Department is scrutinizing a trip that Washington, D.C., Mayor Muriel Bowser took to Qatar, but the mayor is not a target of the investigation, a person familiar with the matter told The Associated Press, The probe into a trip Bowser took with staff in 2023 is focused on a lobbyist tied to the Democratic mayor, according to the person, who spoke on the condition of anonymity to discuss the investigation",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Trump Pardons Ex-NYPD Officer Who Was Convicted of Helping China Stalk an Expat",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/trump-pardons-ex-nypd-officer-who-was-convicted-of-helping-china-stalk-an-expat",
    "description": "President Donald Trump has granted a pardon to a former New York police sergeant who was convicted of helping China try to scare an ex-official into going back to his homeland",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "ICE to Open National Call Center to Find Unaccompanied Migrant Children",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/ice-to-open-national-call-center-to-find-unaccompanied-migrant-children-amid-surge-in-partnerships",
    "description": "U.S. Immigration and Customs Enforcement plans to open a national call center to help local and state law enforcement agencies find unaccompanied migrant children",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Trump Accuses Foreign-Owned Meat Packers of Inflating US Beef Prices and Calls for Investigation",
    "url": "https://www.usnews.com/news/business/articles/2025-11-07/trump-accuses-foreign-owned-meat-packers-of-inflating-us-beef-prices-and-calls-for-investigation",
    "description": "President Donald Trump is accusing foreign-owned meat packers of driving up the price of beef in the U.S. and is asking the Department of Justice to open an investigation",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Judge Optimistic About Improvements at Chicago-Area ICE Facility With Alleged 'Inhumane' Conditions",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/judge-optimistic-about-improvements-at-chicago-area-ice-facility-with-alleged-inhumane-conditions",
    "description": "A federal judge expressed optimism Friday at the government’s progress in making required changes to a Chicago-area federal immigration facility with alleged “inhumane” conditions",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "The Government Shutdown Prompts the Cancellation of Some Veterans Day Events",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/the-government-shutdown-prompts-the-cancelation-of-some-veterans-day-events",
    "description": "Volunteers usually gather at Riverside National Cemetery in California on Veterans Day to place flags on graves, but not this year",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "US Skips Human Rights Review by UN Body as Countries Appeal for Its Return Next Year",
    "url": "https://www.usnews.com/news/world/articles/2025-11-07/us-skips-human-rights-review-by-un-body-as-countries-appeal-for-its-return-next-year",
    "description": "The United States on Friday snubbed a U.N. body charged with keeping tabs on the human rights records of all its member countries, on orders of the Trump administration — which has turned its back on the Human Rights Council",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "California Lawmakers Found Money for These Pet Projects Even as They Slashed the Budget",
    "url": "https://www.usnews.com/news/best-states/california/articles/2025-11-07/california-lawmakers-found-money-for-these-pet-projects-even-as-they-slashed-the-budget",
    "description": "Despite facing a $12 billion deficit this year, California’s Legislature still managed to spend at least $415 million for local projects to help lawmakers win their next elections",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Trump Pardons Former Mets Great Darryl Strawberry on Past Tax Evasion and Drug Charges",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/trump-pardons-former-mets-great-darryl-strawberry-on-past-tax-evasion-and-drug-charges",
    "description": "President Donald Trump has pardoned former New York Mets star Darryl Strawberry on past tax evasion and drug charges",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Connecticut Gov. Ned Lamont to Seek Third Term in 2026",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/connecticut-gov-ned-lamont-to-seek-third-term-in-2026",
    "description": "Connecticut Gov. Ned Lamont has filed the necessary paperwork to seek a third term in 2026",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Trump's Energy Secretary Slams UN Climate Conference in Brazil, Where US Absence Is Glaring",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/trumps-energy-secretary-slams-un-climate-conference-in-brazil-where-us-absence-is-glaring",
    "description": "U.S. Energy Secretary Chris Wright has criticized the COP30 environmental summit as harmful and misguided",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Orbán Says Trump Will Not Punish Hungary for Buying Russian Energy, Reducing Impact of Sanctions",
    "url": "https://www.usnews.com/news/world/articles/2025-11-07/trump-weighs-hungarys-request-for-exemption-from-russian-energy-sanctions",
    "description": "Hungarian Prime Minister Viktor Orbán says his country has received an exemption from U.S. sanctions on Russian energy after a meeting in the White House with President Donald Trump",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Alleged Iranian Plot to Kill Israel's Ambassador to Mexico Was Thwarted, US and Israel Say",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/alleged-iranian-plot-to-kill-israels-ambassador-to-mexico-was-thwarted-us-and-israel-say",
    "description": "Israeli and U.S. officials say Mexican authorities with assistance from the United States and Israeli intelligence agencies thwarted what they say was a plot by Iran to assassinate the Israeli ambassador to Mexico",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Consumer Sentiment Tumbles Close to Record Lows in Latest U Michigan Survey",
    "url": "https://www.usnews.com/news/business/articles/2025-11-07/consumer-sentiment-tumbles-close-to-record-lows-in-latest-u-michigan-survey",
    "description": "Consumer sentiment dropped to a three-year low in November, a month into the government shutdown, led by pessimism in both personal finances and anticipated business conditions",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Cornell University to Pay $60M in Deal With Trump Administration to Restore Federal Funding",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/cornell-university-announces-deal-with-trump-administration-to-restore-withheld-federal-funding",
    "description": "Cornell University has agreed to pay $60 million and accept the Trump administration’s interpretation of civil rights laws in order to restore federal funding and end investigations into the Ivy League school",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "FAA Scales Back Flights at 40 Airports. See the Impact in Photos",
    "url": "https://www.usnews.com/news/best-states/new-york/articles/2025-11-07/faa-scales-back-flights-at-40-airports-see-the-impact-in-photos",
    "description": null,
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Supreme Court Issues Emergency Order to Block Full SNAP Food Aid Payments",
    "url": "https://www.usnews.com/news/best-states/massachusetts/articles/2025-11-07/trump-administration-seeks-to-halt-snap-food-aid-payments-after-a-court-order",
    "description": "The Supreme Court has granted the Trump administration’s emergency appeal to temporarily block a court order to fully fund SNAP food aid payments amid the government shutdown",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Trump Administration Moves to Loosen Restrictions It Once Supported on a Harmful Pollutant",
    "url": "https://www.usnews.com/news/business/articles/2025-11-07/trump-administration-moves-to-loosen-restrictions-it-once-supported-on-a-harmful-pollutant",
    "description": "The Trump administration is loosening a federal rule that requires grocery stores, air-conditioning companies and others to reduce powerful greenhouse gases that contribute to global warming",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Denmark's Government Aims to Ban Access to Social Media for Children Under 15",
    "url": "https://www.usnews.com/news/world/articles/2025-11-07/denmarks-government-aims-to-ban-access-to-social-media-for-children-aged-under-15",
    "description": "Denmark's government has announced a plan to ban social media access for anyone under 15",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "The Latest: Hundreds of Flights Canceled Nationwide Due to Government Shutdown",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/the-latest-hundreds-of-flights-canceled-nationwide-due-to-government-shutdown",
    "description": "The Federal Aviation Administration’s unprecedented order to scale back flights nationwide because of the record-long government shutdown has taken effect, with some passengers trying to figure out backup travel plans",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Mexico President's Rivals Cry Foul as She Uses Groping Incident to Address Gender Violence",
    "url": "https://www.usnews.com/news/world/articles/2025-11-07/mexico-presidents-rivals-cry-foul-as-she-uses-groping-incident-to-address-gender-violence",
    "description": "Mexico's political polarization has tarnished what could have been a moment of national solidarity after President Claudia Sheinbaum was groped on a downtown street",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Republican US Rep. Elise Stefanik Is Running for Governor of New York",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/republican-us-rep-elise-stefanik-is-running-for-governor-of-new-york",
    "description": "Republican Rep. Elise Stefanik is running for governor of New York",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "What a Reporter Found When She Investigated US Military Strikes on Venezuelan Drug Boats",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/what-a-reporter-found-when-she-investigated-us-military-strikes-on-venezuelan-drug-boats",
    "description": "Regina Garcia Cano was the reporter behind The Associated Press story that provided the first comprehensive account and identifies of some of the men killed in recent U.S. military strikes on alleged drug smuggling boats",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Trump Has Accused Boat Crews of Being Narco-Terrorists. the Truth, AP Found, Is More Nuanced",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/trump-has-accused-boat-crews-of-being-narco-terrorists-the-truth-ap-found-is-more-nuanced",
    "description": "One was a fisherman struggling to eke out a living on $100 a month",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Zohran Mamdani and London's Muslim Mayor, Sadiq Khan, Have Much in Common, but Also Key Differences",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/zohran-mamdani-and-londons-muslim-mayor-sadiq-khan-have-much-in-common-but-also-key-differences",
    "description": "As a left-leaning Muslim politician, London Mayor Sadiq Khan shares similarities with New York Mayor-elect Zohran Mamdani",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Nancy Pelosi's Exit Opens Way for Tough Fight to Replace Her in San Francisco District",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-07/nancy-pelosis-exit-opens-way-for-tough-fight-to-replace-her-in-san-francisco-district",
    "description": "Former House Speaker Nancy Pelosi’s decision to step aside after nearly four decades in Congress kicks off a wide-open contest to replace her at a time when her home city of San Francisco is roiled in debate about what its future should look like",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Republicans Swat Down Democratic Offer to End Shutdown as Impasse Continues Into 38th Day",
    "url": "https://www.usnews.com/news/business/articles/2025-11-07/democrats-consider-prolonging-the-shutdown-as-republicans-prepare-new-bills-without-health-care-fix",
    "description": "Republicans are swatting down an offer from Democrats to end the government shutdown",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "Trump Is Ramping up a New Effort to Convince a Skeptical Public He Can Fix Affordability Worries",
    "url": "https://www.usnews.com/news/business/articles/2025-11-07/trump-is-ramping-up-a-new-effort-to-convince-a-skeptical-public-he-can-fix-affordability-worries",
    "description": "Expect to hear President Donald Trump talk a lot about affordability in coming months",
    "date": "Nov. 7, 2025"
  },
  {
    "title": "PHOTO ESSAY: Coal Miners With Black Lung Fight Trump Administration Rollback of Safety Protections",
    "url": "https://www.usnews.com/news/best-states/west-virginia/articles/2025-11-06/photo-essay-coal-miners-with-black-lung-fight-trump-administration-rollback-of-safety-protections",
    "description": null,
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Deep in Trump Country, Coal Miners With Black Lung Say Government Is Suffocating the 'Working Man'",
    "url": "https://www.usnews.com/news/best-states/west-virginia/articles/2025-11-06/deep-in-trump-country-coal-miners-with-black-lung-say-government-is-suffocating-the-working-man",
    "description": "Lisa Emery, a respiratory therapist, is deeply concerned about West Virginia coal miners suffering from black lung disease",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "South Korea Says North Korea Fired 1 Ballistic Missile Toward Its Eastern Waters",
    "url": "https://www.usnews.com/news/world/articles/2025-11-07/south-korea-says-north-korea-fired-1-ballistic-missile-toward-its-eastern-waters",
    "description": "South Korea's military says North Korea fired a suspected ballistic missile toward its eastern waters",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Trump Administration Announces 17th Deadly Strike on an Alleged Drug Boat",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/trump-administration-announces-17th-deadly-strike-on-an-alleged-drug-boat",
    "description": "Defense Secretary Pete Hegseth has announced another deadly U.S. strike on a boat he said was trafficking narcotics in the Caribbean Sea",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Obama Celebrates Tuesday Wins and Tells Progressives That Voters Are Rejecting the Trump Agenda",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/obama-celebrates-tuesday-wins-and-tells-progressives-that-voters-are-rejecting-the-trump-agenda",
    "description": "Barack Obama is celebrating Democratic wins earlier this week and saying they are a sign that American voters are rejecting the Trump agenda",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Trump Pardons Former Tennessee House Speaker Convicted of Federal Public Corruption Charges",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/trump-pardons-former-tennessee-house-speaker-convicted-of-federal-public-corruption-charges",
    "description": "President Donald Trump has pardoned former Tennessee House speaker Glen Casada and his aide Cade Cothren",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "New Mormon Apostle Led a Global Temple Building Boom and Has Deep Knowledge of Church Finances",
    "url": "https://www.usnews.com/news/best-states/utah/articles/2025-11-06/new-mormon-apostle-led-a-global-temple-building-boom-and-has-deep-knowledge-of-church-finances",
    "description": "A high-ranking official in The Church of Jesus Christ of Latter-day Saints who oversaw its finances and a global temple building boom has been chosen as the faith’s new apostle",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "New Mexico Lawmakers Propose a Jeffrey Epstein Probe of Activity at Secluded Desert Ranch",
    "url": "https://www.usnews.com/news/best-states/new-mexico/articles/2025-11-06/new-mexico-lawmakers-propose-a-jeffrey-epstein-probe-of-activity-at-secluded-desert-ranch",
    "description": "A secluded desert ranch where financier and sex offender Jeffrey Epstein once entertained guests is coming under new scrutiny in New Mexico",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Republican Rep Elise Stefanik to Announce Run for New York Governor",
    "url": "https://www.usnews.com/news/best-states/new-york/articles/2025-11-06/republican-rep-elise-stefanik-to-announce-run-for-new-york-governor",
    "description": "Republican U.S. Rep. Elise Stefanik is expect to announce a run for New York governor Friday",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "'No Hire' Job Market Leaves Unemployed in Limbo as Threats to Economy Multiply",
    "url": "https://www.usnews.com/news/us/articles/2025-11-07/no-hire-job-market-leaves-unemployed-in-limbo-as-threats-to-economy-multiply",
    "description": "The unemployment rate is low and the economy is still growing, but those out of work face the slowest pace of hiring in more than a decade",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "The Congressional Budget Office Was Hacked. It Says It Has Implemented New Security Measures",
    "url": "https://www.usnews.com/news/business/articles/2025-11-06/the-congressional-budget-office-was-hacked-it-says-it-has-implemented-new-security-measures",
    "description": "The Congressional Budget Office confirmed Thursday that it had been hacked",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Illinois Congressman Forgoes Reelection With Eyebrow-Raising Move to Place Chief of Staff on Ballot",
    "url": "https://www.usnews.com/news/us/articles/2025-11-06/illinois-congressman-forgoes-reelection-with-eyebrow-raising-move-to-place-chief-of-staff-on-ballot",
    "description": "U.S. Rep. Jesus “Chuy” Garcia confirms he won’t seek reelection days after the Illinois Democrat backed a quiet effort to get his chief of staff on the March primary ballot as his replacement",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Pelosi-Isms: 'Throw a Punch, for the Children' and More Forge a Legacy",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/pelosi-isms-in-showing-how-to-throw-a-punch-for-the-children-she-leaves-a-linguistic-legacy",
    "description": "Nancy Pelosi is bringing her history-making career in the U.S. House to an end, but she leaves a linguistic legacy in Congress and beyond",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "UN Approves US-Backed Effort to Lift Sanctions on Syria's President",
    "url": "https://www.usnews.com/news/world/articles/2025-11-06/un-approves-us-backed-effort-to-lift-sanctions-on-syrias-president",
    "description": "The U.N. Security Council has voted to lift a series of sanctions on Syrian President Ahmad al-Sharaa and members of his government days before he's set to arrive in the U.S. for a historic visit to the White House",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Senate Republicans Vote Down Legislation to Limit Trump’s Ability to Attack Venezuela",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/senate-to-vote-on-legislation-to-limit-trump-administration-from-attacking-venezuela",
    "description": "Senate Republicans have rejected legislation that would have put a check on President Donald Trump’s ability to launch an attack against Venezuela",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Maryland Sues Trump Administration Over Location of FBI Headquarters",
    "url": "https://www.usnews.com/news/best-states/maryland/articles/2025-11-06/maryland-sues-trump-administration-over-location-of-fbi-headquarters",
    "description": "Maryland officials have announced a federal lawsuit against the Trump administration for blocking the construction of a new FBI headquarters in the state just outside the nation's capital",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Supreme Court Lets Trump Block Transgender and Nonbinary People From Choosing Passport Sex Markers",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/supreme-court-lets-trump-block-transgender-and-nonbinary-people-from-choosing-passport-sex-markers",
    "description": "The Supreme Court is allowing President Donald Trump’s administration to enforce a policy blocking transgender and nonbinary people from choosing passport sex markers that align with their gender identity",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Trump Administration Speeds up New Rules That Would Make It Easier to Charge Some Protesters",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/trump-administration-speeds-up-new-rules-that-would-make-it-easier-to-charge-some-protesters",
    "description": "The Trump administration is speeding up new rules for the Federal Protective Service, giving it more authority to charge people for offenses on or off federal properties",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Abraham Lincoln Letter Seeking Job for Black Friend and Valet Now on Display at Presidential Museum",
    "url": "https://www.usnews.com/news/best-states/illinois/articles/2025-11-06/abraham-lincoln-letter-seeking-job-for-black-friend-and-valet-now-on-display-at-presidential-museum",
    "description": "An 1861 job-reference letter from Abraham Lincoln on behalf of a young Black friend and valet provides a glimpse of an extraordinary relationship the two had despite the demands the new president had undertaken",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Nebraska Prison Reopens as Federal Immigration Center, Aims for 200 Detainees by Thanksgiving",
    "url": "https://www.usnews.com/news/best-states/nebraska/articles/2025-11-06/nebraska-prison-reopens-as-federal-immigration-center-aims-for-200-detainees-by-thanksgiving",
    "description": "A new federal immigration detention center in rural in southwest Nebraska has begun housing immigration detainees",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Man Who Threw Sandwich at Federal Agent in Washington Is Found Not Guilty of Assault Charge",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/man-who-threw-sandwich-at-federal-agent-in-washington-is-found-not-guilty-of-assault-charge",
    "description": "A former Justice Department employee who threw a sandwich at a federal agent during President Donald Trump’s law enforcement surge in Washington has been found not guilty of assault",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Kazakhstan Will Join the Abraham Accords With Israel in Symbolic Move to Boost the Trump Initiative",
    "url": "https://www.usnews.com/news/world/articles/2025-11-06/kazakhstan-will-join-the-abraham-accords-with-israel-in-symbolic-move-to-boost-the-trump-initiative",
    "description": "Kazakhstan will join the Abraham Accords between Israel and Arab and Muslim majority countries in a move aimed at boosting the initiative that was a hallmark of President Donald Trump’s first administration",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Mamdani in Puerto Rico for an Annual Conference of New York Political Insiders",
    "url": "https://www.usnews.com/news/us/articles/2025-11-06/mamdani-heading-to-puerto-rico-for-an-annual-conference-of-new-york-political-insiders",
    "description": "New York City Mayor-elect Zohran Mamdani is in Puerto Rico this weekend for an annual summit that brings New York’s politicians and lobbyists to sunny San Juan for strategy meetings, workshops and boozy confabs",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Travelers Brace for Chaos as US Government Shutdown Threatens Holiday Flights",
    "url": "https://www.usnews.com/news/business/articles/2025-11-06/travelers-brace-for-chaos-as-us-government-shutdown-threatens-holiday-flights",
    "description": "Travelers across the U.S. are facing potential chaos as a government shutdown threatens to disrupt flights nationwide",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Federal Judge Orders Trump Administration to Fully Fund SNAP Benefits in November",
    "url": "https://www.usnews.com/news/best-states/wisconsin/articles/2025-11-06/government-says-snap-benefit-cuts-wont-be-as-deep-as-announced-for-some-families",
    "description": "A federal judge in Rhode Island has ordered the Trump administration to find the money to fully fund SNAP benefits for November",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Trump Taps DEI Critic to Lead Workplace Civil Rights Agency",
    "url": "https://www.usnews.com/news/business/articles/2025-11-06/trump-taps-dei-critic-to-lead-workplace-civil-rights-agency",
    "description": "President Donald Trump has appointed Andrea Lucas as chair of the nation's top workplace civil rights agency",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Chicago Judge Says Border Patrol Official Lied About Threats Before Restricting Agents' Use Force",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/judge-will-order-federal-agents-in-chicago-to-restrict-using-force-against-protesters-and-media",
    "description": "A federal judge in Chicago issued an extensive injunction restricting federal agents’ use of force, saying Thursday that a top Border Patrol official leading an immigration crackdown repeatedly lied about threats posed by protesters and news media",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Immigrant Who a Judge Allegedly Helped Avoid Arrest Gets Time Served, and Will Soon Be Deported",
    "url": "https://www.usnews.com/news/best-states/wisconsin/articles/2025-11-06/immigrant-sentenced-to-time-served-after-wisconsin-judge-allegedly-helped-him-evade-federal-agents",
    "description": "An immigrant who was arrested after a Milwaukee judge allegedly helped him dodge federal agents has been sentenced to time served for illegally reentering the United States",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Trump Unveils Deal to Expand Coverage and Lower Costs on Obesity Drugs",
    "url": "https://www.usnews.com/news/business/articles/2025-11-06/trump-unveils-deal-to-expand-coverage-and-lower-costs-on-obesity-drugs",
    "description": "President Donald Trump has unveiled a deal with drugmakers Eli Lilly and Novo Nordisk to expand coverage and reduce prices for their popular obesity treatments Zepbound and Wegovy",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Appeals Court Gives Trump Another Shot at Erasing His Hush Money Conviction",
    "url": "https://www.usnews.com/news/best-states/new-york/articles/2025-11-06/appeals-court-gives-trump-gets-another-shot-at-erasing-his-hush-money-conviction",
    "description": "A federal appeals court has given new life to President Donald Trump’s bid to erase his New York hush money conviction",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Photos of Pelosi’s Historic Tenure in the US House as It's Coming to an End",
    "url": "https://www.usnews.com/news/best-states/washington-dc/articles/2025-11-06/photos-of-pelosis-historic-tenure-in-the-us-house-as-its-coming-to-an-end",
    "description": null,
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Trump Hosts Central Asian Leaders as US Seeks to Get Around China on Rare Earth Metals",
    "url": "https://www.usnews.com/news/business/articles/2025-11-06/trump-is-hosting-central-asian-leaders-as-us-seeks-to-get-around-china-on-rare-earth-metals",
    "description": "President Donald Trump has hosted leaders from five Central Asian countries at the White House",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Nancy Pelosi Won't Seek Reelection, Ending Her Storied Career in the US House",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/nancy-pelosi-wont-seek-reelection-ending-her-storied-career-in-the-us-house",
    "description": "Former House Speaker Nancy Pelosi says she won’t seek reelection",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "The Latest: Trump Hosts Central Asian Leaders as US Eyes Sources for Rare Earth Metals",
    "url": "https://www.usnews.com/news/us/articles/2025-11-06/the-latest-shutdown-progress-in-doubt-as-democrats-grow-emboldened-from-election-wins",
    "description": "President Donald Trump is hosting leaders of five Central Asian countries at the White House",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "At White House Meeting, Hungary's Orbán to Seek Trump's Blessing to Keep Buying Russian Oil",
    "url": "https://www.usnews.com/news/world/articles/2025-11-06/at-white-house-meeting-hungarys-orban-to-seek-trumps-blessing-to-keep-buying-russian-oil",
    "description": "Hungarian Prime Minister Viktor Orbán is visiting President Donald Trump in the White House on Friday",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "A New System to Identify and Take Down Russian Drones Is Being Deployed to NATO's Eastern Flank",
    "url": "https://www.usnews.com/news/world/articles/2025-11-06/as-russian-drone-incursions-rattle-europe-poland-and-romania-deploy-a-new-defensive-system",
    "description": "Poland and Romania are deploying a new weapons system to defend against Russian drones",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "At UN Climate Summit, World Leaders Say Time Is Running Short to Stop the Worst Effects of Warming",
    "url": "https://www.usnews.com/news/world/articles/2025-11-06/un-climate-summit-kicks-off-in-brazils-amazon-with-hopes-for-action-despite-us-absence",
    "description": "World leaders gathering the in Brazil's Amazon rainforest for the U.N.‘s annual climate summit warned Thursday that time is running short for urgent and decisive action to prevent the worst effects of climate change",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "US Urges Europe to Move Faster to Phase Out Russian Gas, Expand Pipeline Networks to Ukraine",
    "url": "https://www.usnews.com/news/us/articles/2025-11-06/us-and-european-energy-leaders-in-greece-to-talk-ways-to-better-supply-ukraine",
    "description": "Energy ministers from the United States and Europe have gathered in Athens as the Trump administration seeks to increase gas exports to Europe",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "People From South Sudan Will Lose Temporary US Legal Status",
    "url": "https://www.usnews.com/news/us/articles/2025-11-06/people-from-south-sudan-will-lose-temporary-us-legal-status",
    "description": "The United States is terminating South Sudan’s designation for temporary protected status, which for years allowed people from the East African country to remain in the U.S. legally and escape armed conflict back home",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "Bipartisan Talks to End the Shutdown Intensify, but Agreement Elusive",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-06/shutdown-progress-in-doubt-as-democrats-grow-emboldened-from-election-wins",
    "description": "Talks to reopen the government are intensifying",
    "date": "Nov. 6, 2025"
  },
  {
    "title": "DC National Guard Deployment in the Nation's Capital Ordered by Trump Is Extended to Feb. 28",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/dc-national-guard-deployment-in-the-nations-capital-ordered-by-trump-is-extended-to-feb-28",
    "description": "The Washington D.C. National Guard will be deployed to the nation’s capital through the end of February, according to formal orders reviewed by The Associated Press",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Former South Carolina House Member Indicted on Federal Charges of Defrauding Legal Clients",
    "url": "https://www.usnews.com/news/best-states/south-carolina/articles/2025-11-05/former-south-carolina-house-member-indicted-on-federal-charges-of-defrauding-legal-clients",
    "description": "A former South Carolina state lawmaker has been indicted on federal charges, accused of defrauding his legal clients of hundreds of thousands of dollars",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "North Korea Slams US Sanctions on Cybercrimes and Says Pressure Tactics Will Fail",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/north-korea-slams-us-sanctions-on-cybercrimes-and-says-pressure-tactics-will-fail",
    "description": "North Korea has denounced the Trump administration’s latest sanctions targeting cybercrimes that help finance its illicit nuclear weapons program, accusing the United States of harboring “wicked” hostility toward Pyongyang and vowing unspecified countermeasures",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Hegseth and Rubio Share Classified Details on Boat Strikes With Congressional Leaders",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/hegseth-and-rubio-share-classified-details-on-boat-strikes-with-congressional-leaders",
    "description": "Top Trump administration officials have briefed lawmakers on the growing U.S. campaign to destroy alleged drug-smuggling boats in the waters off South America",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Divided Jewish Leaders React With Warnings and Hope as New York Elects Zohran Mamdani as Mayor",
    "url": "https://www.usnews.com/news/world/articles/2025-11-05/divided-jewish-leaders-react-with-warnings-and-hope-as-new-york-elects-its-first-muslim-mayor",
    "description": "Within hours of Zohran Mamdani’s election as New York’s first Muslim mayor, there were swift and harsh reactions from his Jewish critics",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Federal Agents Drive off With 1-Year-Old Girl After Arresting Her Father in Los Angeles",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/federal-agents-drive-off-with-1-year-old-girl-after-arresting-her-father-in-los-angeles",
    "description": "Federal immigration agents arrested a U.S. citizen in Los Angeles and drove off with his car, which had his one-year-old daughter inside",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Democratic Electoral Wins Re-Energize Protesters at an Anti-Trump Rally in Nation's Capital",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/democratic-electoral-wins-re-energize-protesters-at-an-anti-trump-rally-in-nations-capital",
    "description": "Protesters at an anti-Trump demonstration in Washington, D.C., were re-energized following significant Democratic victories in elections this week",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "States Sue Trump Administration Over Restrictions Put on FEMA Emergency Grants",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/states-sue-trump-administration-over-restrictions-put-on-fema-emergency-grants",
    "description": "Eleven states and Kentucky's governor are suing the Trump administration over what they call unlawful terms on federal funding for disaster and terrorism preparedness",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Trump Faces Rare Republican Pushback as He Presses Senate to Scrap the Filibuster",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/trump-faces-rare-republican-pushback-as-he-presses-senate-to-scrap-the-filibuster",
    "description": "President Donald Trump is finding that Senate Republicans have a limit as he pushes them to scrap the filibuster",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "IRS Direct File Won't Be Available Next Year. Here's What That Means for Taxpayers",
    "url": "https://www.usnews.com/news/business/articles/2025-11-05/irs-direct-file-wont-be-available-next-year-heres-what-that-means-for-taxpayers",
    "description": "The Trump administration has decided not to offer the IRS' electronic tax filing system for free next year, and its future is unclear",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Democrats Are Hopeful Again. but Unresolved Questions Remain About Party's Path Forward",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/democrats-are-hopeful-again-but-unresolved-questions-remain-about-partys-path-forward",
    "description": "Democrats are hopeful again",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Trump Has Other Tariff Options if the Supreme Court Strikes Down His Worldwide Import Taxes",
    "url": "https://www.usnews.com/news/us/articles/2025-11-06/trump-has-other-tariff-options-if-the-supreme-court-strikes-down-his-worldwide-import-taxes",
    "description": "President Donald Trump has warned that the Supreme Court will leave the United States “defenseless’’ and possibly “reduced to almost Third World status’’ if it strikes down the tariffs he imposed this year on nearly every country on earth",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Trump Nominates Former New Mexico Lawmaker to Lead Bureau of Land Management",
    "url": "https://www.usnews.com/news/best-states/montana/articles/2025-11-05/trump-nominates-former-new-mexico-lawmaker-to-lead-bureau-of-land-management",
    "description": "President Donald Trump nominated a former lawmaker from New Mexico to oversee the management of a quarter-billion acres of public lands that are concentrated in Western states",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Virginia Election Winners Break Race and Gender Barriers Amid National Scrutiny on Diversity",
    "url": "https://www.usnews.com/news/best-states/virginia/articles/2025-11-05/virginia-election-winners-break-race-and-gender-barriers-amid-national-scrutiny-on-diversity",
    "description": "Virginia voters have made history by electing candidates who broke race and gender barriers in this week's elections",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Conservative Activist Robert Beadles Admits Hiring Private Investigator Who Tracked Reno Mayor",
    "url": "https://www.usnews.com/news/best-states/nevada/articles/2025-11-05/conservative-activist-robert-beadles-admits-hiring-private-investigator-who-tracked-reno-mayor",
    "description": "A Northern Nevada GOP activist and donor — Robert Beadles — has admitted hiring a private investigator who tracked Reno's mayor three years ago, ending a yearslong legal effort to verify he was behind the tracking",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Takeaways From Tuesday’s Elections",
    "url": "https://www.usnews.com/news/u-s-news-decision-points/articles/2025-11-05/democrats-dominated-tuesdays-off-year-elections",
    "description": "It’s hard to extrapolate larger trends, but Democrats were certainly happy with the results.",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Sherrill Says She Has a Mandate as New Jersey's Next Governor and Will Focus on Affordability",
    "url": "https://www.usnews.com/news/best-states/new-jersey/articles/2025-11-05/sherrill-says-she-has-a-mandate-as-new-jerseys-next-governor-and-will-focus-on-affordability",
    "description": "Mikie Sherrill says she believes she has a mandate as New Jersey's governor-elect to fulfill campaign promises of making the state more affordable",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "2 Pennsylvania Counties Had to Replace Poll Books in the Middle of Election Day Voting",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/2-pennsylvania-counties-had-to-replace-poll-books-in-the-middle-of-election-day-voting",
    "description": "Two Pennsylvania counties were forced to replace poll books at all polling places in the middle of voting because of what officials described as mistakes made in creating voter data ahead of Tuesday's election",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "In Election 2025, the Economy's Still the Main Thing, According to the AP Voter Poll",
    "url": "https://www.usnews.com/news/business/articles/2025-11-05/in-election-2025-the-economys-still-the-main-thing-according-to-the-ap-voter-poll",
    "description": "Economic worries were the dominant concern as voters cast ballots for Tuesday’s elections, according to preliminary findings from the AP Voter Poll",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Mississippi Democrats Appear to Break Republican Supermajority in State Senate",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/mississippi-democrats-appear-to-break-republican-supermajority-in-state-senate",
    "description": "Mississippi Democrats appear to have broken a Republican supermajority in the state Senate",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Democratic Maine Rep. Jared Golden Won't Seek Reelection in Competitive US House District",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/democratic-maine-rep-jared-golden-wont-seek-reelection-in-competitive-us-house-district",
    "description": "Maine Democratic Rep. Jared Golden says he will not seek reelection",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Jury Deliberates in Assault Case Against DC Man Who Threw Sandwich at Federal Agent in Viral Video",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/jury-deliberates-in-assault-case-against-dc-man-who-threw-sandwich-at-federal-agent-in-viral-video",
    "description": "A jury has begun deliberating in the Justice Department’s assault case against a man who threw a sandwich at a federal agent, turning him into a symbol of resistance to President Donald Trump’s law-enforcement surge in the nation’s capital",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Virginia Voters Push Back Hard on Trump Administration Efforts to Reshape Federal Government",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/virginia-voters-push-back-hard-on-trump-administration-efforts-to-reshape-federal-government",
    "description": "Not every voter in Northern Virginia has felt the impact of President Donald Trump’s efforts to reshape the federal government",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Chicago Day Care Worker Detained by Immigration Agents at Drop-Off Time for Children",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/immigration-arrest-of-chicago-daycare-worker-at-drop-off-time-for-kids-sparks-outcry",
    "description": "Witnesses say a Chicago day care employee was detained at work during a drop-off time for children, reflecting the Trump administration’s increasingly aggressive enforcement tactics",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "California Republicans Sue Over New US House Map Approved by Voters",
    "url": "https://www.usnews.com/news/best-states/california/articles/2025-11-05/california-republicans-sue-over-new-u-s-house-map-approved-by-voters",
    "description": "California Republicans have filed a lawsuit to block a new U.S. House map that voters just approved",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "US Proposes the UN Lift Sanctions on Syria's Leader Ahead of White House Visit",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/us-proposes-the-un-lift-sanctions-on-syrias-leader-ahead-of-white-house-visit",
    "description": "The United States is asking the U.N. Security Council to lift sanctions on Syrian President Ahmad al-Sharaa and members of his government ahead of a historic visit to the White House",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Mamdani's Historic Win as New York City's Mayor Sparks Excitement and Hope Among Many US Muslims",
    "url": "https://www.usnews.com/news/best-states/new-york/articles/2025-11-05/mamdanis-historic-win-as-new-york-citys-mayor-sparks-excitement-and-hope-among-many-us-muslims",
    "description": "Zohran Mamdani's historic New York City's mayoral race victory has sparked excitement and hope among many American Muslims",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Senior US Official Praises Mali's Military Junta in Fight Against Armed Groups as Pressure Mounts",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/senior-us-official-praises-malis-military-junta-in-fight-against-armed-groups-as-pressure-mounts",
    "description": "Days after American diplomats and nationals were told to leave Mali, a senior U.S. official praised the military junta and hinted at cooperation between the two governments after years of a strained diplomatic relationship",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "North Carolina’s Largest City Reelects Mayor After Fallout Over Train Stabbing",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/north-carolinas-largest-city-reelects-mayor-after-fallout-over-train-stabbing",
    "description": "Voters in Charlotte, North Carolina, have reelected Democratic Mayor Vi Lyles after safety concerns in the city increased following a recent stabbing on a commuter train",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "AP Race Call: Jacob Frey Wins Re-Election as Mayor of Minneapolis",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/ap-race-call-jacob-frey-wins-re-election-as-mayor-of-minneapolis",
    "description": "Jacob Frey won reelection as mayor of Minneapolis on Wednesday, earning his third term",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Jacob Frey Fends off Democratic Socialist's Challenge to Win 3rd Term as Minneapolis Mayor",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/jacob-frey-fends-off-democratic-socialists-challenge-to-win-3rd-term-as-minneapolis-mayor",
    "description": "Minneapolis Mayor Jacob Frey has won a third term, defeating challenger Omar Fateh in the city's ranked-choice voting election",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Judge in Comey Case Scolds Prosecutors as He Orders Them to Produce Records From Probe",
    "url": "https://www.usnews.com/news/best-states/virginia/articles/2025-11-05/judge-in-comey-case-scolds-prosecutors-as-he-orders-them-to-produce-records-from-probe",
    "description": "A federal judge has ordered prosecutors in the criminal case of former FBI Director James Comey to produce materials from the investigation, saying he’s concerned the Justice Department’s position had been to “indict first\" and investigate second",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Photos of Zohran Mamdani and His Supporters as They Celebrate His Election as NYC's Mayor",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/photos-of-zohran-mamdani-and-his-supporters-as-they-celebrate-his-election-as-nycs-mayor",
    "description": null,
    "date": "Nov. 5, 2025"
  },
  {
    "title": "'Badhai!' in India, a Celebration for Zohran Mamdani's New York Mayoral Win and His Roots",
    "url": "https://www.usnews.com/news/world/articles/2025-11-05/badhai-in-india-a-celebration-for-zohran-mamdanis-new-york-mayoral-win-and-his-roots",
    "description": "Indians have lit up social media to celebrate Zohran Mamdani’s election victory as New York City mayor",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Mamdani Announces Veteran Transition Team as He Makes Plans to Carry Out an Ambitious Agenda for NYC",
    "url": "https://www.usnews.com/news/best-states/new-york/articles/2025-11-05/zohran-mamdani-vows-to-hit-the-ground-running-on-ambitious-agenda-following-historic-victory",
    "description": "Fresh off his historic victory in New York City’s mayoral election, Zohran Mamdani named a slate of seasoned officials to help lead his transition to City Hall",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "How Key Demographic Groups Voted in 2025, According to the AP Voter Poll",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/how-key-demographic-groups-voted-in-2025-according-to-the-ap-voter-poll",
    "description": "There were signs in the AP Voter Poll that there’s plenty of room for Democrats to make up ground among groups that moved toward President Donald Trump in last year’s election",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Trump May Become the Face of Economic Discontent, a Year After Such Worries Helped Him Win Big",
    "url": "https://www.usnews.com/news/business/articles/2025-11-05/trump-may-become-the-face-of-economic-discontent-a-year-after-such-worries-helped-him-win-big",
    "description": "Voters have sent a message to President Donald Trump that the economy doesn't feel as though it's booming — despite what he says",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Data Scientists Perform Last Rites for 'Dearly Departed Datasets' in 2nd Trump Administration",
    "url": "https://www.usnews.com/news/best-states/washington-dc/articles/2025-11-05/data-scientists-perform-last-rites-for-dearly-departed-datasets-in-2nd-trump-administration",
    "description": "A group of U.S. data scientists has published a list of federal datasets that have been altered or removed since President Donald Trump returned to the White House",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Why California Voters Approved a Redistricting Ballot Measure, According to the AP Voter Poll",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/why-california-voters-approved-a-redistricting-ballot-measure-according-to-the-ap-voter-poll",
    "description": "Most California voters didn’t like redrawing their congressional districts to favor Democrats, according to the AP Voter Poll",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Putin Tells Officials to Submit Plans for Possibly Resuming Nuclear Tests After Trump's Remarks",
    "url": "https://www.usnews.com/news/world/articles/2025-11-05/putin-tells-officials-to-submit-plans-for-possibly-resuming-nuclear-tests-after-trumps-remarks",
    "description": "Russian President Vladimir Putin has ordered officials to submit proposals for a possible resumption of nuclear tests in response to President Donald Trump’s statements last month that appeared to suggest the U.S. will restart its own atomic tests",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Democrats Win Big Over GOP Incumbents in 2 Statewide Georgia Utility Regulator Races",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/democrats-win-big-over-gop-incumbents-in-2-statewide-georgia-utility-regulator-races",
    "description": "Democrats have won blowout victories in two races for the Georgia Public Service Commission",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "The Latest: Supreme Court Appears Skeptical of Trump’s Tariffs",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/the-latest-supreme-court-is-set-to-hear-arguments-over-trumps-tariffs",
    "description": "The U.S. Supreme Court has heard arguments over President Donald Trump's tariffs, a key part of his economic and foreign policy",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "The Latest: Trump Promotes His Economic Agenda After Democratic Election Victories",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/the-latest-trump-putting-a-positive-spin-on-the-economy-after-voters-rebuked-his-performance",
    "description": "A day after Democrats dominated the first major Election Day since Donald Trump returned to the White House, the president is in Miami to speak at a forum of business leaders and global athletes about what he sees as his economic achievements",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "What's Next in the National Redistricting Fight After California Approved a New US House Map",
    "url": "https://www.usnews.com/news/best-states/california/articles/2025-11-05/whats-next-in-the-national-redistricting-fight-after-california-approved-a-new-us-house-map",
    "description": "The new congressional map approved by California voters marked a victory for Democrats in the national redistricting battle playing out ahead of the 2026 midterm election",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Mamdani Tells Trump That New York Is Ready to Fight After President's Threats Fail to Thwart Voters",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/mamdani-tells-trump-that-new-york-is-ready-to-fight-after-presidents-threats-fail-to-thwart-voters",
    "description": "Zohran Mamdani has just been elected mayor of New York City and is already challenging President Donald Trump",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Mamdani's Win Inspires Ugandans Who See Hope in Youth Joining Politics",
    "url": "https://www.usnews.com/news/world/articles/2025-11-05/mamdanis-win-inspires-ugandans-who-see-hope-in-youth-joining-politics",
    "description": "Zohran Mamdani's victory in the New York mayoral race inspires many in Uganda, though it feels distant",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "EU Agrees on New Emissions Targets Before Global Climate Summit in Brazil",
    "url": "https://www.usnews.com/news/world/articles/2025-11-05/eu-agrees-on-new-emissions-targets-before-global-climate-summit-in-brazil",
    "description": "The European Union has announced plans to slash carbon emissions by 90% by 2040",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Motorist 'Deliberately' Hit 5 People in Car Ramming on French Atlantic Island",
    "url": "https://www.usnews.com/news/world/articles/2025-11-05/motorist-deliberately-hit-5-people-in-car-ramming-on-french-atlantic-island",
    "description": "A driver has rammed his car into pedestrians and cyclists on the holiday island of Ile d’Oléron, off the west coast of France, leaving at least two people in a critical condition and three others injured",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "The Shutdown Is Hurting Schools Whose Budgets Are Mostly Federal Money",
    "url": "https://www.usnews.com/news/best-states/montana/articles/2025-11-05/the-shutdown-is-hurting-schools-whose-budgets-are-mostly-federal-money",
    "description": "The government shutdown has cut off funds for some school systems that rely on federal money for the bulk of their budgets",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Drone Sightings Force Fresh Flight Cancellations at Belgium's Main Airport",
    "url": "https://www.usnews.com/news/world/articles/2025-11-05/drone-sightings-force-fresh-flight-cancellations-at-belgiums-main-airport",
    "description": "Dozens of flights were canceled at Belgium’s main international airport on Wednesday after drone sightings overnight forced a temporary closure",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Japan Deploys the Military to Counter a Surge in Bear Attacks",
    "url": "https://www.usnews.com/news/news/articles/2025-11-05/japan-sends-troops-to-northern-region-to-help-stop-bear-attacks-after-a-record-number-of-casualties",
    "description": "Japan has deployed troops to help contain a surge of bear attacks that have terrorized residents in the northern prefecture of Akita",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Pope Leo Calls for 'Deep Reflection' About Treatment of Detained Migrants in the United States",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/pope-leo-calls-for-deep-reflection-about-treatment-of-detained-migrants-in-the-united-states",
    "description": "Pope Leo XIV has called for deep reflection in the United States regarding the treatment of detained migrants",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Prosecutors in Asia Seize Yachts, Luxury Cars and Cash From Man Accused of Running Cyberscams",
    "url": "https://www.usnews.com/news/world/articles/2025-11-05/prosecutors-in-asia-seize-yachts-luxury-cars-and-cash-from-man-accused-of-running-cyberscams",
    "description": "Prosecutors in Taiwan, Hong Kong and Singapore say they've seized hundreds of millions of dollars in assets belonging to a Cambodian businessman whom the U.S. accuses of heading a global scam syndicate",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "After Confirming Possible White House Run, California's Newsom Scores a Win in Fight for US House",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/after-confirming-possible-white-house-run-californias-newsom-scores-a-win-in-fight-for-us-house",
    "description": "Gov. Gavin Newsom’s victory in California’s election fight over U.S. House control will help raise his national profile as a Democrat willing to confront President Donald Trump",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Texas Democrats Menefee and Edwards Advance to Runoff for Vacant US House Seat",
    "url": "https://www.usnews.com/news/best-states/texas/articles/2025-11-05/texas-democrats-menefee-and-edwards-advance-to-runoff-for-vacant-us-house-seat",
    "description": "A Houston official and a former City Council member are headed to a runoff for the vacant U.S. House seat in a heavily Democratic district",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "AP Race Call: Menefee and Edwards Advance to a Runoff for U.S. House in Texas’ 18th District",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/ap-race-call-menefee-and-edwards-advance-to-a-runoff-for-u-s-house-in-texas-18th-district",
    "description": "Christian Menefee and Amanda Edwards advanced to a runoff to fill Texas’ 18th Congressional District on Tuesday",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Tuesday’s Races Were a Quiet Rebuke of Trump for Many Voters, AP Voter Poll Finds",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/tuesdays-races-were-a-quiet-rebuke-of-trump-for-many-voters-ap-voter-poll-finds",
    "description": "President Donald Trump wasn’t on the ballot in Tuesday’s elections, but many voters in key races made their choice in opposition to him or considered him to be irrelevant, according to the AP Voter Poll",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "As Vice President During 9/11, Cheney Was at the Center of an Enduring Debate Over US Spy Powers",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/as-vice-president-during-9-11-cheney-is-at-the-center-of-an-enduring-debate-over-us-spy-powers",
    "description": "Dick Cheney was at the center of a public debate over the laws of detention, interrogation and spying that endures more than two decades after the Sept. 11 attacks",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Zohran Mamdani's Rise: From Queens Lawmaker to New York City Mayor",
    "url": "https://www.usnews.com/news/best-states/new-york/articles/2025-11-05/zohran-mamdanis-rise-from-queens-lawmaker-to-new-york-city-mayor",
    "description": "Zohran Mamdani has stormed onto the national political scene by winning New York City's mayoral election",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "What to Know After the Supreme Court Arguments Over Trump's Tariffs",
    "url": "https://www.usnews.com/news/business/articles/2025-11-05/what-to-know-about-the-supreme-court-arguments-over-trumps-tariffs",
    "description": "The Trump administration got a chilly reception at the Supreme Court, where a majority of the court questioned President Donald Trump’s novel use of an emergency powers law to impose worldwide tariffs",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Conservative Supreme Court Justices Appear Skeptical of Trump’s Sweeping Unilateral Tariffs",
    "url": "https://www.usnews.com/news/business/articles/2025-11-05/trump-tariffs-face-supreme-court-test-in-trillion-dollar-test-of-executive-power",
    "description": "A majority of Supreme Court justices seem skeptical about President Donald Trump’s ability to unilaterally impose far-reaching tariffs, putting at risk a cornerstone of his agenda in the biggest legal test yet of his boundary-pushing presidency",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Judge Orders Improvements at a Chicago-Area Immigration Facility After Claims of Inhumane Conditions",
    "url": "https://www.usnews.com/news/best-states/illinois/articles/2025-11-05/excessive-force-allegations-will-be-the-focus-of-a-chicago-court-hearing",
    "description": "A federal judge has ordered improvements at a Chicago-area immigration facility after detainees sued over \"inhumane\" conditions",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "President Donald Trump, in Miami, Brags About the Economy Despite an Election-Night Rebuke",
    "url": "https://www.usnews.com/news/us/articles/2025-11-05/trump-heads-to-miami-to-speak-about-his-economic-agenda-on-the-anniversary-of-his-election-win",
    "description": "President Donald Trump celebrated his economic achievements on the anniversary of his election victory",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Trump Pressures GOP Senators to End the Government Shutdown, Now the Longest Ever",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-05/government-shutdown-becomes-the-longest-on-record-as-fallout-spreads-nationwide",
    "description": "President Donald Trump lashed out at Senate Republicans to end the government shutdown, now the longest ever at 36 days",
    "date": "Nov. 5, 2025"
  },
  {
    "title": "Former Gov. Jim McGreevey and James Solomon Advance to Runoff in Race for Jersey City Mayor",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/former-gov-jim-mcgreevey-and-james-solomon-advance-to-runoff-in-race-for-jersey-city-mayor",
    "description": "Former New Jersey Gov. Jim McGreevey is going another round in his attempted political comeback, more than two decades after he resigned from office",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Editorial Roundup: United States",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/editorial-roundup-united-states",
    "description": null,
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: California Voters Approve New US House Map With up to 5 More Democratic Seats",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-california-voters-approve-new-us-house-map-with-up-to-5-more-democratic-seats",
    "description": "California voters on Tuesday approved a ballot measure that would implement a new congressional map drawn to elect more Democrats to the U.S. House",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Minneapolis Mayor’s Race Advances to Ranked Choice Voting",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-minneapolis-mayors-race-advances-to-ranked-choice-voting",
    "description": "The Minneapolis mayor’s race will advance to ranked choice voting after none of the candidates received at least 50% of the vote in Tuesday’s election",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Texas Voters Approve Constitutional Amendment Requiring US Citizenship to Vote",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-texas-voters-approve-constitutional-amendment-requiring-us-citizenship-to-vote",
    "description": "Texas voters approved a constitutional amendment on Tuesday that states people must be citizens of the United States to vote in Texas",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Texas Voters Approve Constitutional Amendment Affirming Parental Rights",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-texas-voters-approve-constitutional-amendment-affirming-parental-rights",
    "description": "Texas voters on Tuesday approved a constitutional amendment affirming parental rights",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Colorado Voters OK Income Tax Increase to Fund Free Meals for Public School Students",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-colorado-voters-ok-income-tax-increase-to-fund-free-meals-for-public-school-students",
    "description": "Colorado voters approved a ballot measure on Tuesday that would raise state income taxes on households earning at least $300,000 annually to fund free meals for all public school students",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat Sean Ryan Elected Buffalo Mayor",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-democrat-sean-ryan-elected-buffalo-mayor",
    "description": "Democrat Sean Ryan won the mayor’s race in Buffalo on Tuesday, defeating Republican nominee James Gardner",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: James Solomon and Jim McGreevey Advance to Runoff for Jersey City Mayor",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-james-solomon-advances-to-a-runoff-for-jersey-city-mayor",
    "description": "James Solomon and Jim McGreevey advanced to a runoff for mayor of Jersey City on Tuesday",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Maine Voters Approve ‘Red Flag Law’ Allowing Temporary Removal of Firearms",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-maine-voters-approve-red-flag-law-allowing-temporary-removal-of-firearms",
    "description": "Maine voters approved a ballot measure on Tuesday that would allow family or household members to directly petition the courts to temporarily prohibit a person from having dangerous weapons if they are deemed a threat to themselves or others",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Maine Voters Reject Changes to Election Administration in the State",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-maine-voters-reject-changes-to-election-administration-in-the-state",
    "description": "Maine voters on Tuesday rejected a ballot measure that would significantly change how the state administers its elections",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat-Backed Justice Kevin Dougherty Retains His Seat on Pennsylvania Supreme Court",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-democrat-backed-justice-kevin-dougherty-retains-his-seat-on-pennsylvania-supreme-court",
    "description": "Pennsylvania Supreme Court Justice Kevin Dougherty was retained by Pennsylvania voters on Tuesday",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat-Backed Justice David Wecht Retains His Seat on the Pennsylvania Supreme Court",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-democrat-backed-justice-david-wecht-retains-his-seat-on-the-pennsylvania-supreme-court",
    "description": "Pennsylvania Supreme Court Justice David Wecht was retained by Pennsylvania voters on Tuesday",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat Jay Jones Elected Virginia Attorney General Over GOP Incumbent Jason Miyares",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-democrat-jay-jones-elected-virginia-attorney-general-over-gop-incumbent-jason-miyares",
    "description": "Democrat Jay Jones won the race for attorney general of Virginia on Tuesday, ousting Republican incumbent Jason Miyares",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Democrat Jay Jones Wins Race to Be Virginia Attorney General Despite Texts Endorsing Violence",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/democrat-jay-jones-wins-race-to-be-virginia-attorney-general-despite-texts-endorsing-violence",
    "description": "Democrat Jay Jones has won Virginia’s election for attorney general despite turmoil late in his campaign over texts he sent in 2022 embracing violence against a fellow lawmaker",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat-Backed Justice Christine Donohue Retains Seat on Pennsylvania Supreme Court",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-democrat-backed-justice-christine-donohue-retains-seat-on-pennsylvania-supreme-court",
    "description": "Pennsylvania Supreme Court Justice Christine Donohue was retained by Pennsylvania voters on Tuesday",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Zohran Mamdani, a Self-Described Democratic Socialist, Elected New York City Mayor",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-zohran-mamdani-a-self-described-democratic-socialist-elected-new-york-city-mayor",
    "description": "Democrat Zohran Mamdani was elected mayor of New York City on Tuesday",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat Mikie Sherrill Elected NJ Governor Over Trump-Backed Jack Ciattarelli",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/ap-race-call-democrat-mikie-sherrill-elected-nj-governor-over-trump-backed-jack-ciattarelli",
    "description": "Democratic Rep. Mikie Sherrill was elected New Jersey governor on Tuesday over Republican Jack Ciattarelli, who was endorsed by President Donald Trump",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "City Council President Mary Sheffield Wins Election to Become Detroit’s First Female Mayor",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/city-council-president-mary-sheffield-wins-election-to-become-detroits-first-female-mayor",
    "description": "City Council President Mary Sheffield will be Detroit’s newest mayor and the first woman to lead the city",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Mary Sheffield Wins Detroit Mayor’s Race, Will Be First Woman to Lead City",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/ap-race-call-mary-sheffield-wins-detroit-mayors-race-will-be-first-woman-to-lead-city",
    "description": "Mary Sheffield won the race for Detroit mayor on Tuesday, defeating Solomon Kinloch Jr. to become the first woman elected to lead the city",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat Corey O’Connor Wins Pittsburgh Mayor’s Race",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/ap-race-call-democrat-corey-oconnor-wins-pittsburgh-mayors-race",
    "description": "Democrat Corey O’Connor won election as mayor of Pittsburgh on Tuesday",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat Ghazala Hashmi Elected Virginia Lieutenant Governor",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-democrat-ghazala-hashmi-elected-virginia-lieutenant-governor",
    "description": "Democrat Ghazala Hashmi won the lieutenant governor’s race in Virginia on Tuesday, defeating Republican John Reid",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Andre Dickens Wins Reelection as Atlanta Mayor",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-andre-dickens-wins-reelection-as-atlanta-mayor",
    "description": "Andre Dickens won reelection as mayor of Atlanta on Tuesday, earning a second term",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat Aftab Pureval Wins Reelection as Cincinnati Mayor, Defeating Vance’s Relative",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/ap-race-call-democrat-aftab-pureval-wins-reelection-as-cincinnati-mayor-defeating-vances-relative",
    "description": "Aftab Pureval won reelection as mayor of Cincinnati on Tuesday, defeating Cory Bowman, a Republican who is Vice President JD Vance’s half-brother",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Trump Administration Announces 16th Deadly Strike on an Alleged Drug Boat",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/trump-administration-announces-16th-deadly-strike-on-an-alleged-drug-boat",
    "description": "Defense Secretary Pete Hegseth has announced yet another deadly strike on a boat accused of ferrying drugs in the eastern Pacific Ocean",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Dick Cheney's Political Legacy Is Mixed in Home State of Wyoming",
    "url": "https://www.usnews.com/news/best-states/wyoming/articles/2025-11-04/dick-cheneys-political-legacy-is-mixed-in-home-state-of-wyoming",
    "description": "Dick Cheney leaves behind a mixed legacy in his home state of Wyoming",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "AP Race Call: Democrat Abigail Spanberger Elected Virginia Governor",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/ap-race-call-democrat-abigail-spanberger-elected-virginia-governor",
    "description": "Democrat Abigail Spanberger won the governor’s race in Virginia on Tuesday, defeating Republican Winsome Earle-Sears",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Seattle Mayor Bruce Harrell Faces a Hard Reelection Fight Against Progressive Activist Katie Wilson",
    "url": "https://www.usnews.com/news/best-states/washington/articles/2025-11-04/seattle-mayor-bruce-harrell-faces-a-hard-reelection-fight-against-progressive-activist-katie-wilson",
    "description": "Democratic Seattle Mayor Bruce Harrell faces a tough reelection fight against progressive activist Katie Wilson as voters in the liberal city question whether he’s done enough in his first term to address public safety, homelessness and affordability",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Kansas Legislators Won't Have a Special Session to Join the US Redistricting Battle",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/kansas-republicans-drop-push-to-enter-nations-widening-redistricting-battle",
    "description": "The Kansas House's top Republican has given up for now on forcing a special session of the Legislature to redraw the state’s U.S. House districts to give the GOP an additional seat",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Voters Prioritize the Economy Above Immigration and Crime in Election 2025, AP Voter Poll Finds",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/in-election-2025-the-economys-still-the-main-thing-according-to-the-ap-voter-poll",
    "description": "Economic worries were the dominant concern as voters cast ballots for Tuesday’s elections, according to preliminary findings from the AP Voter Poll",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Trump Once Again Nominates Tech Space Traveler Jared Isaacman to Serve as NASA Administrator",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/trump-once-again-nominates-tech-space-traveler-jared-isaacman-to-serve-as-nasa-administrator",
    "description": "President Donald Trump is nominating Jared Isaacman to serve as his NASA administrator after all",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Brazil's Lula Puts Forward New Vision for Protecting the Amazon Rainforest",
    "url": "https://www.usnews.com/news/world/articles/2025-11-04/brazils-lula-puts-forward-new-vision-for-protecting-the-amazon-rainforest",
    "description": "Brazil’s leader, President Luiz Inácio Lula da Silva, says he wants the future of the Amazon rainforest to be built around a major fund that will pay countries to keep their forests standing",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "FACT FOCUS: New York City Ballots Do Not Show Proof of Election Fraud",
    "url": "https://www.usnews.com/news/us/articles/2025-11-04/fact-focus-new-york-city-ballots-do-not-show-proof-of-election-fraud",
    "description": "As voters lined up at the polls Tuesday, social media users claimed that how candidates are listed on New York City ballots is proof that voting is rigged",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "Conservative Activist Laura Loomer, a Trump Ally, Says She Has a New Pentagon Press Pass",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/conservative-activist-laura-loomer-a-trump-ally-says-she-has-a-new-pentagon-press-pass",
    "description": "Conservative activist Laura Loomer says she's been granted credentials to join the Pentagon press corps",
    "date": "Nov. 4, 2025"
  },
  {
    "title": "FBI Fires Additional Agents Who Participated in Investigating Trump, AP Sources Say",
    "url": "https://www.usnews.com/news/politics/articles/2025-11-04/fbi-fires-additional-agents-who-participated-in-investigating-trump-ap-sources-say",
    "description": "The FBI has continued its personnel purge, forcing out additional agents and supervisors tied to the federal investigation into efforts to overturn the 2020 election despite efforts by Washington’s top federal prosecutor to try to stop at least some of the terminations",
    "date": "Nov. 4, 2025"
  }
]